// Copyright (C) 2026 Signal Messenger, LLC.
// SPDX-License-Identifier: AGPL-3.0-only
// AUTOGENERATED! Do not modify!
#pragma once
#include <assert.h>
#include <stdalign.h>
#include <stdbool.h>
#include <stddef.h>
#include <stdint.h>
// A static assert that's only enabled for 64-bit platforms.
#define static_assert_64bit(flag) static_assert((sizeof(void*) == 8) ? (flag) : 1, "")
static_assert_64bit(sizeof(uint8_t) == 1);
static_assert_64bit(alignof(uint8_t) == 1);
typedef uint8_t SignalType_FixedArray32_uint8_t[32];
static_assert_64bit(sizeof(SignalType_FixedArray32_uint8_t) == 32);
static_assert_64bit(alignof(SignalType_FixedArray32_uint8_t) == 1);
typedef const SignalType_FixedArray32_uint8_t* SignalType_ConstPointer_SignalType_FixedArray32_uint8_t;
static_assert_64bit(sizeof(SignalType_ConstPointer_SignalType_FixedArray32_uint8_t) == 8);
static_assert_64bit(alignof(SignalType_ConstPointer_SignalType_FixedArray32_uint8_t) == 8);
typedef const SignalType_ConstPointer_SignalType_FixedArray32_uint8_t* SignalType_ConstPointer_SignalType_ConstPointer_SignalType_FixedArray32_uint8_t;
static_assert_64bit(sizeof(SignalType_ConstPointer_SignalType_ConstPointer_SignalType_FixedArray32_uint8_t) == 8);
static_assert_64bit(alignof(SignalType_ConstPointer_SignalType_ConstPointer_SignalType_FixedArray32_uint8_t) == 8);
typedef uint8_t SignalType_FixedArray129_uint8_t[129];
static_assert_64bit(sizeof(SignalType_FixedArray129_uint8_t) == 129);
static_assert_64bit(alignof(SignalType_FixedArray129_uint8_t) == 1);
typedef const SignalType_FixedArray129_uint8_t* SignalType_ConstPointer_SignalType_FixedArray129_uint8_t;
static_assert_64bit(sizeof(SignalType_ConstPointer_SignalType_FixedArray129_uint8_t) == 8);
static_assert_64bit(alignof(SignalType_ConstPointer_SignalType_FixedArray129_uint8_t) == 8);
typedef uint8_t SignalType_FixedArray153_uint8_t[153];
static_assert_64bit(sizeof(SignalType_FixedArray153_uint8_t) == 153);
static_assert_64bit(alignof(SignalType_FixedArray153_uint8_t) == 1);
typedef const SignalType_FixedArray153_uint8_t* SignalType_ConstPointer_SignalType_FixedArray153_uint8_t;
static_assert_64bit(sizeof(SignalType_ConstPointer_SignalType_FixedArray153_uint8_t) == 8);
static_assert_64bit(alignof(SignalType_ConstPointer_SignalType_FixedArray153_uint8_t) == 8);
typedef uint8_t SignalType_FixedArray15_uint8_t[15];
static_assert_64bit(sizeof(SignalType_FixedArray15_uint8_t) == 15);
static_assert_64bit(alignof(SignalType_FixedArray15_uint8_t) == 1);
typedef const SignalType_FixedArray15_uint8_t* SignalType_ConstPointer_SignalType_FixedArray15_uint8_t;
static_assert_64bit(sizeof(SignalType_ConstPointer_SignalType_FixedArray15_uint8_t) == 8);
static_assert_64bit(alignof(SignalType_ConstPointer_SignalType_FixedArray15_uint8_t) == 8);
typedef uint8_t SignalType_FixedArray16_uint8_t[16];
static_assert_64bit(sizeof(SignalType_FixedArray16_uint8_t) == 16);
static_assert_64bit(alignof(SignalType_FixedArray16_uint8_t) == 1);
typedef const SignalType_FixedArray16_uint8_t* SignalType_ConstPointer_SignalType_FixedArray16_uint8_t;
static_assert_64bit(sizeof(SignalType_ConstPointer_SignalType_FixedArray16_uint8_t) == 8);
static_assert_64bit(alignof(SignalType_ConstPointer_SignalType_FixedArray16_uint8_t) == 8);
typedef uint8_t SignalType_FixedArray177_uint8_t[177];
static_assert_64bit(sizeof(SignalType_FixedArray177_uint8_t) == 177);
static_assert_64bit(alignof(SignalType_FixedArray177_uint8_t) == 1);
typedef const SignalType_FixedArray177_uint8_t* SignalType_ConstPointer_SignalType_FixedArray177_uint8_t;
static_assert_64bit(sizeof(SignalType_ConstPointer_SignalType_FixedArray177_uint8_t) == 8);
static_assert_64bit(alignof(SignalType_ConstPointer_SignalType_FixedArray177_uint8_t) == 8);
typedef uint8_t SignalType_FixedArray17_uint8_t[17];
static_assert_64bit(sizeof(SignalType_FixedArray17_uint8_t) == 17);
static_assert_64bit(alignof(SignalType_FixedArray17_uint8_t) == 1);
typedef const SignalType_FixedArray17_uint8_t* SignalType_ConstPointer_SignalType_FixedArray17_uint8_t;
static_assert_64bit(sizeof(SignalType_ConstPointer_SignalType_FixedArray17_uint8_t) == 8);
static_assert_64bit(alignof(SignalType_ConstPointer_SignalType_FixedArray17_uint8_t) == 8);
typedef uint8_t SignalType_FixedArray289_uint8_t[289];
static_assert_64bit(sizeof(SignalType_FixedArray289_uint8_t) == 289);
static_assert_64bit(alignof(SignalType_FixedArray289_uint8_t) == 1);
typedef const SignalType_FixedArray289_uint8_t* SignalType_ConstPointer_SignalType_FixedArray289_uint8_t;
static_assert_64bit(sizeof(SignalType_ConstPointer_SignalType_FixedArray289_uint8_t) == 8);
static_assert_64bit(alignof(SignalType_ConstPointer_SignalType_FixedArray289_uint8_t) == 8);
typedef uint8_t SignalType_FixedArray329_uint8_t[329];
static_assert_64bit(sizeof(SignalType_FixedArray329_uint8_t) == 329);
static_assert_64bit(alignof(SignalType_FixedArray329_uint8_t) == 1);
typedef const SignalType_FixedArray329_uint8_t* SignalType_ConstPointer_SignalType_FixedArray329_uint8_t;
static_assert_64bit(sizeof(SignalType_ConstPointer_SignalType_FixedArray329_uint8_t) == 8);
static_assert_64bit(alignof(SignalType_ConstPointer_SignalType_FixedArray329_uint8_t) == 8);
typedef uint8_t SignalType_FixedArray409_uint8_t[409];
static_assert_64bit(sizeof(SignalType_FixedArray409_uint8_t) == 409);
static_assert_64bit(alignof(SignalType_FixedArray409_uint8_t) == 1);
typedef const SignalType_FixedArray409_uint8_t* SignalType_ConstPointer_SignalType_FixedArray409_uint8_t;
static_assert_64bit(sizeof(SignalType_ConstPointer_SignalType_FixedArray409_uint8_t) == 8);
static_assert_64bit(alignof(SignalType_ConstPointer_SignalType_FixedArray409_uint8_t) == 8);
typedef uint8_t SignalType_FixedArray473_uint8_t[473];
static_assert_64bit(sizeof(SignalType_FixedArray473_uint8_t) == 473);
static_assert_64bit(alignof(SignalType_FixedArray473_uint8_t) == 1);
typedef const SignalType_FixedArray473_uint8_t* SignalType_ConstPointer_SignalType_FixedArray473_uint8_t;
static_assert_64bit(sizeof(SignalType_ConstPointer_SignalType_FixedArray473_uint8_t) == 8);
static_assert_64bit(alignof(SignalType_ConstPointer_SignalType_FixedArray473_uint8_t) == 8);
typedef uint8_t SignalType_FixedArray497_uint8_t[497];
static_assert_64bit(sizeof(SignalType_FixedArray497_uint8_t) == 497);
static_assert_64bit(alignof(SignalType_FixedArray497_uint8_t) == 1);
typedef const SignalType_FixedArray497_uint8_t* SignalType_ConstPointer_SignalType_FixedArray497_uint8_t;
static_assert_64bit(sizeof(SignalType_ConstPointer_SignalType_FixedArray497_uint8_t) == 8);
static_assert_64bit(alignof(SignalType_ConstPointer_SignalType_FixedArray497_uint8_t) == 8);
typedef uint8_t SignalType_FixedArray64_uint8_t[64];
static_assert_64bit(sizeof(SignalType_FixedArray64_uint8_t) == 64);
static_assert_64bit(alignof(SignalType_FixedArray64_uint8_t) == 1);
typedef const SignalType_FixedArray64_uint8_t* SignalType_ConstPointer_SignalType_FixedArray64_uint8_t;
static_assert_64bit(sizeof(SignalType_ConstPointer_SignalType_FixedArray64_uint8_t) == 8);
static_assert_64bit(alignof(SignalType_ConstPointer_SignalType_FixedArray64_uint8_t) == 8);
typedef uint8_t SignalType_FixedArray65_uint8_t[65];
static_assert_64bit(sizeof(SignalType_FixedArray65_uint8_t) == 65);
static_assert_64bit(alignof(SignalType_FixedArray65_uint8_t) == 1);
typedef const SignalType_FixedArray65_uint8_t* SignalType_ConstPointer_SignalType_FixedArray65_uint8_t;
static_assert_64bit(sizeof(SignalType_ConstPointer_SignalType_FixedArray65_uint8_t) == 8);
static_assert_64bit(alignof(SignalType_ConstPointer_SignalType_FixedArray65_uint8_t) == 8);
typedef uint8_t SignalType_FixedArray97_uint8_t[97];
static_assert_64bit(sizeof(SignalType_FixedArray97_uint8_t) == 97);
static_assert_64bit(alignof(SignalType_FixedArray97_uint8_t) == 1);
typedef const SignalType_FixedArray97_uint8_t* SignalType_ConstPointer_SignalType_FixedArray97_uint8_t;
static_assert_64bit(sizeof(SignalType_ConstPointer_SignalType_FixedArray97_uint8_t) == 8);
static_assert_64bit(alignof(SignalType_ConstPointer_SignalType_FixedArray97_uint8_t) == 8);
static_assert_64bit(sizeof(bool) == 1);
static_assert_64bit(alignof(bool) == 1);
typedef const bool* SignalType_ConstPointer_bool;
static_assert_64bit(sizeof(SignalType_ConstPointer_bool) == 8);
static_assert_64bit(alignof(SignalType_ConstPointer_bool) == 8);
typedef const void* SignalType_ConstPointer_void;
static_assert_64bit(sizeof(SignalType_ConstPointer_void) == 8);
static_assert_64bit(alignof(SignalType_ConstPointer_void) == 8);
static_assert_64bit(sizeof(int8_t) == 1);
static_assert_64bit(alignof(int8_t) == 1);
typedef const int8_t* SignalCStringPtr;
static_assert_64bit(sizeof(SignalCStringPtr) == 8);
static_assert_64bit(alignof(SignalCStringPtr) == 8);
typedef struct SignalPinHash SignalPinHash;
typedef const SignalPinHash* SignalType_ConstPointer_SignalPinHash;
static_assert_64bit(sizeof(SignalType_ConstPointer_SignalPinHash) == 8);
static_assert_64bit(alignof(SignalType_ConstPointer_SignalPinHash) == 8);
typedef struct SignalAes256GcmSiv SignalAes256GcmSiv;
typedef const SignalAes256GcmSiv* SignalType_ConstPointer_SignalAes256GcmSiv;
static_assert_64bit(sizeof(SignalType_ConstPointer_SignalAes256GcmSiv) == 8);
static_assert_64bit(alignof(SignalType_ConstPointer_SignalAes256GcmSiv) == 8);
typedef const uint8_t* SignalType_ConstPointer_uint8_t;
static_assert_64bit(sizeof(SignalType_ConstPointer_uint8_t) == 8);
static_assert_64bit(alignof(SignalType_ConstPointer_uint8_t) == 8);
static_assert_64bit(sizeof(size_t) == 8);
static_assert_64bit(alignof(size_t) == 8);
typedef struct {
  const uint8_t* base;
  size_t length;
} SignalBorrowedBuffer;
static_assert_64bit(offsetof(SignalBorrowedBuffer, base) == 0);
static_assert_64bit(offsetof(SignalBorrowedBuffer, length) == 8);
static_assert_64bit(sizeof(SignalBorrowedBuffer) == 16);
static_assert_64bit(alignof(SignalBorrowedBuffer) == 8);
typedef const SignalBorrowedBuffer* SignalType_ConstPointer_SignalBorrowedBuffer;
static_assert_64bit(sizeof(SignalType_ConstPointer_SignalBorrowedBuffer) == 8);
static_assert_64bit(alignof(SignalType_ConstPointer_SignalBorrowedBuffer) == 8);
typedef struct SignalProtocolAddress SignalProtocolAddress;
typedef const SignalProtocolAddress* SignalType_ConstPointer_SignalProtocolAddress;
static_assert_64bit(sizeof(SignalType_ConstPointer_SignalProtocolAddress) == 8);
static_assert_64bit(alignof(SignalType_ConstPointer_SignalProtocolAddress) == 8);
typedef struct {
  const SignalProtocolAddress* raw;
} SignalConstPointerProtocolAddress;
static_assert_64bit(offsetof(SignalConstPointerProtocolAddress, raw) == 0);
static_assert_64bit(sizeof(SignalConstPointerProtocolAddress) == 8);
static_assert_64bit(alignof(SignalConstPointerProtocolAddress) == 8);
typedef const SignalConstPointerProtocolAddress* SignalType_ConstPointer_SignalConstPointerProtocolAddress;
static_assert_64bit(sizeof(SignalType_ConstPointer_SignalConstPointerProtocolAddress) == 8);
static_assert_64bit(alignof(SignalType_ConstPointer_SignalConstPointerProtocolAddress) == 8);
typedef struct SignalPublicKey SignalPublicKey;
typedef const SignalPublicKey* SignalType_ConstPointer_SignalPublicKey;
static_assert_64bit(sizeof(SignalType_ConstPointer_SignalPublicKey) == 8);
static_assert_64bit(alignof(SignalType_ConstPointer_SignalPublicKey) == 8);
typedef struct {
  const SignalPublicKey* raw;
} SignalConstPointerPublicKey;
static_assert_64bit(offsetof(SignalConstPointerPublicKey, raw) == 0);
static_assert_64bit(sizeof(SignalConstPointerPublicKey) == 8);
static_assert_64bit(alignof(SignalConstPointerPublicKey) == 8);
typedef const SignalConstPointerPublicKey* SignalType_ConstPointer_SignalConstPointerPublicKey;
static_assert_64bit(sizeof(SignalType_ConstPointer_SignalConstPointerPublicKey) == 8);
static_assert_64bit(alignof(SignalType_ConstPointer_SignalConstPointerPublicKey) == 8);
typedef struct SignalCiphertextMessage SignalCiphertextMessage;
typedef const SignalCiphertextMessage* SignalType_ConstPointer_SignalCiphertextMessage;
static_assert_64bit(sizeof(SignalType_ConstPointer_SignalCiphertextMessage) == 8);
static_assert_64bit(alignof(SignalType_ConstPointer_SignalCiphertextMessage) == 8);
typedef struct {
  const SignalCiphertextMessage* raw;
} SignalConstPointerCiphertextMessage;
static_assert_64bit(offsetof(SignalConstPointerCiphertextMessage, raw) == 0);
static_assert_64bit(sizeof(SignalConstPointerCiphertextMessage) == 8);
static_assert_64bit(alignof(SignalConstPointerCiphertextMessage) == 8);
typedef const SignalConstPointerCiphertextMessage* SignalType_ConstPointer_SignalConstPointerCiphertextMessage;
static_assert_64bit(sizeof(SignalType_ConstPointer_SignalConstPointerCiphertextMessage) == 8);
static_assert_64bit(alignof(SignalType_ConstPointer_SignalConstPointerCiphertextMessage) == 8);
typedef struct SignalSessionRecord SignalSessionRecord;
typedef const SignalSessionRecord* SignalType_ConstPointer_SignalSessionRecord;
static_assert_64bit(sizeof(SignalType_ConstPointer_SignalSessionRecord) == 8);
static_assert_64bit(alignof(SignalType_ConstPointer_SignalSessionRecord) == 8);
typedef struct {
  const SignalSessionRecord* raw;
} SignalConstPointerSessionRecord;
static_assert_64bit(offsetof(SignalConstPointerSessionRecord, raw) == 0);
static_assert_64bit(sizeof(SignalConstPointerSessionRecord) == 8);
static_assert_64bit(alignof(SignalConstPointerSessionRecord) == 8);
typedef const SignalConstPointerSessionRecord* SignalType_ConstPointer_SignalConstPointerSessionRecord;
static_assert_64bit(sizeof(SignalType_ConstPointer_SignalConstPointerSessionRecord) == 8);
static_assert_64bit(alignof(SignalType_ConstPointer_SignalConstPointerSessionRecord) == 8);
static_assert_64bit(sizeof(int32_t) == 4);
static_assert_64bit(alignof(int32_t) == 4);
static_assert_64bit(sizeof(uint64_t) == 8);
static_assert_64bit(alignof(uint64_t) == 8);
typedef struct {
  uint64_t e164;
  SignalType_FixedArray16_uint8_t rawAciUuid;
  SignalType_FixedArray16_uint8_t rawPniUuid;
} SignalFfiCdsiLookupResponseEntry;
static_assert_64bit(offsetof(SignalFfiCdsiLookupResponseEntry, e164) == 0);
static_assert_64bit(offsetof(SignalFfiCdsiLookupResponseEntry, rawAciUuid) == 8);
static_assert_64bit(offsetof(SignalFfiCdsiLookupResponseEntry, rawPniUuid) == 24);
static_assert_64bit(sizeof(SignalFfiCdsiLookupResponseEntry) == 40);
static_assert_64bit(alignof(SignalFfiCdsiLookupResponseEntry) == 8);
typedef SignalFfiCdsiLookupResponseEntry* SignalType_MutPointer_SignalFfiCdsiLookupResponseEntry;
static_assert_64bit(sizeof(SignalType_MutPointer_SignalFfiCdsiLookupResponseEntry) == 8);
static_assert_64bit(alignof(SignalType_MutPointer_SignalFfiCdsiLookupResponseEntry) == 8);
typedef struct {
  SignalFfiCdsiLookupResponseEntry* base;
  size_t length;
} SignalOwnedLookupResponseEntryList;
static_assert_64bit(offsetof(SignalOwnedLookupResponseEntryList, base) == 0);
static_assert_64bit(offsetof(SignalOwnedLookupResponseEntryList, length) == 8);
static_assert_64bit(sizeof(SignalOwnedLookupResponseEntryList) == 16);
static_assert_64bit(alignof(SignalOwnedLookupResponseEntryList) == 8);
typedef struct {
  SignalOwnedLookupResponseEntryList entries;
  int32_t debug_permits_used;
} SignalFfiCdsiLookupResponse;
static_assert_64bit(offsetof(SignalFfiCdsiLookupResponse, entries) == 0);
static_assert_64bit(offsetof(SignalFfiCdsiLookupResponse, debug_permits_used) == 16);
static_assert_64bit(sizeof(SignalFfiCdsiLookupResponse) == 24);
static_assert_64bit(alignof(SignalFfiCdsiLookupResponse) == 8);
typedef const SignalFfiCdsiLookupResponse* SignalType_ConstPointer_SignalFfiCdsiLookupResponse;
static_assert_64bit(sizeof(SignalType_ConstPointer_SignalFfiCdsiLookupResponse) == 8);
static_assert_64bit(alignof(SignalType_ConstPointer_SignalFfiCdsiLookupResponse) == 8);
typedef SignalCStringPtr* SignalType_MutPointer_SignalCStringPtr;
static_assert_64bit(sizeof(SignalType_MutPointer_SignalCStringPtr) == 8);
static_assert_64bit(alignof(SignalType_MutPointer_SignalCStringPtr) == 8);
typedef struct {
  SignalCStringPtr* base;
  size_t length;
} SignalOwnedBufferOfCStringPtr;
static_assert_64bit(offsetof(SignalOwnedBufferOfCStringPtr, base) == 0);
static_assert_64bit(offsetof(SignalOwnedBufferOfCStringPtr, length) == 8);
static_assert_64bit(sizeof(SignalOwnedBufferOfCStringPtr) == 16);
static_assert_64bit(alignof(SignalOwnedBufferOfCStringPtr) == 8);
typedef uint8_t* SignalType_MutPointer_uint8_t;
static_assert_64bit(sizeof(SignalType_MutPointer_uint8_t) == 8);
static_assert_64bit(alignof(SignalType_MutPointer_uint8_t) == 8);
typedef struct {
  uint8_t* base;
  size_t length;
} SignalOwnedBuffer;
static_assert_64bit(offsetof(SignalOwnedBuffer, base) == 0);
static_assert_64bit(offsetof(SignalOwnedBuffer, length) == 8);
static_assert_64bit(sizeof(SignalOwnedBuffer) == 16);
static_assert_64bit(alignof(SignalOwnedBuffer) == 8);
static_assert_64bit(sizeof(uint16_t) == 2);
static_assert_64bit(alignof(uint16_t) == 2);
typedef struct {
  uint16_t status;
  const int8_t* message;
  SignalOwnedBufferOfCStringPtr headers;
  SignalOwnedBuffer body;
} SignalFfiChatResponse;
static_assert_64bit(offsetof(SignalFfiChatResponse, status) == 0);
static_assert_64bit(offsetof(SignalFfiChatResponse, message) == 8);
static_assert_64bit(offsetof(SignalFfiChatResponse, headers) == 16);
static_assert_64bit(offsetof(SignalFfiChatResponse, body) == 32);
static_assert_64bit(sizeof(SignalFfiChatResponse) == 48);
static_assert_64bit(alignof(SignalFfiChatResponse) == 8);
typedef const SignalFfiChatResponse* SignalType_ConstPointer_SignalFfiChatResponse;
static_assert_64bit(sizeof(SignalType_ConstPointer_SignalFfiChatResponse) == 8);
static_assert_64bit(alignof(SignalType_ConstPointer_SignalFfiChatResponse) == 8);
typedef size_t* SignalType_MutPointer_size_t;
static_assert_64bit(sizeof(SignalType_MutPointer_size_t) == 8);
static_assert_64bit(alignof(SignalType_MutPointer_size_t) == 8);
typedef struct {
  size_t* base;
  size_t length;
} SignalOwnedBufferOfusize;
static_assert_64bit(offsetof(SignalOwnedBufferOfusize, base) == 0);
static_assert_64bit(offsetof(SignalOwnedBufferOfusize, length) == 8);
static_assert_64bit(sizeof(SignalOwnedBufferOfusize) == 16);
static_assert_64bit(alignof(SignalOwnedBufferOfusize) == 8);
typedef struct {
  SignalOwnedBuffer bytes;
  SignalOwnedBufferOfusize lengths;
} SignalBytestringArray;
static_assert_64bit(offsetof(SignalBytestringArray, bytes) == 0);
static_assert_64bit(offsetof(SignalBytestringArray, lengths) == 16);
static_assert_64bit(sizeof(SignalBytestringArray) == 32);
static_assert_64bit(alignof(SignalBytestringArray) == 8);
typedef struct {
  SignalBytestringArray entries;
} SignalFfiCheckSvr2CredentialsResponse;
static_assert_64bit(offsetof(SignalFfiCheckSvr2CredentialsResponse, entries) == 0);
static_assert_64bit(sizeof(SignalFfiCheckSvr2CredentialsResponse) == 32);
static_assert_64bit(alignof(SignalFfiCheckSvr2CredentialsResponse) == 8);
typedef const SignalFfiCheckSvr2CredentialsResponse* SignalType_ConstPointer_SignalFfiCheckSvr2CredentialsResponse;
static_assert_64bit(sizeof(SignalType_ConstPointer_SignalFfiCheckSvr2CredentialsResponse) == 8);
static_assert_64bit(alignof(SignalType_ConstPointer_SignalFfiCheckSvr2CredentialsResponse) == 8);
typedef SignalPublicKey* SignalType_MutPointer_SignalPublicKey;
static_assert_64bit(sizeof(SignalType_MutPointer_SignalPublicKey) == 8);
static_assert_64bit(alignof(SignalType_MutPointer_SignalPublicKey) == 8);
typedef struct {
  SignalPublicKey* raw;
} SignalMutPointerPublicKey;
static_assert_64bit(offsetof(SignalMutPointerPublicKey, raw) == 0);
static_assert_64bit(sizeof(SignalMutPointerPublicKey) == 8);
static_assert_64bit(alignof(SignalMutPointerPublicKey) == 8);
typedef struct SignalPreKeyBundle SignalPreKeyBundle;
typedef SignalPreKeyBundle* SignalType_MutPointer_SignalPreKeyBundle;
static_assert_64bit(sizeof(SignalType_MutPointer_SignalPreKeyBundle) == 8);
static_assert_64bit(alignof(SignalType_MutPointer_SignalPreKeyBundle) == 8);
typedef struct {
  SignalPreKeyBundle* raw;
} SignalMutPointerPreKeyBundle;
static_assert_64bit(offsetof(SignalMutPointerPreKeyBundle, raw) == 0);
static_assert_64bit(sizeof(SignalMutPointerPreKeyBundle) == 8);
static_assert_64bit(alignof(SignalMutPointerPreKeyBundle) == 8);
typedef SignalMutPointerPreKeyBundle* SignalType_MutPointer_SignalMutPointerPreKeyBundle;
static_assert_64bit(sizeof(SignalType_MutPointer_SignalMutPointerPreKeyBundle) == 8);
static_assert_64bit(alignof(SignalType_MutPointer_SignalMutPointerPreKeyBundle) == 8);
typedef struct {
  SignalMutPointerPreKeyBundle* base;
  size_t length;
} SignalOwnedBufferOfMutPointerPreKeyBundle;
static_assert_64bit(offsetof(SignalOwnedBufferOfMutPointerPreKeyBundle, base) == 0);
static_assert_64bit(offsetof(SignalOwnedBufferOfMutPointerPreKeyBundle, length) == 8);
static_assert_64bit(sizeof(SignalOwnedBufferOfMutPointerPreKeyBundle) == 16);
static_assert_64bit(alignof(SignalOwnedBufferOfMutPointerPreKeyBundle) == 8);
typedef struct {
  SignalMutPointerPublicKey identity_key;
  SignalOwnedBufferOfMutPointerPreKeyBundle pre_key_bundles;
} SignalFfiPreKeysResponse;
static_assert_64bit(offsetof(SignalFfiPreKeysResponse, identity_key) == 0);
static_assert_64bit(offsetof(SignalFfiPreKeysResponse, pre_key_bundles) == 8);
static_assert_64bit(sizeof(SignalFfiPreKeysResponse) == 24);
static_assert_64bit(alignof(SignalFfiPreKeysResponse) == 8);
typedef const SignalFfiPreKeysResponse* SignalType_ConstPointer_SignalFfiPreKeysResponse;
static_assert_64bit(sizeof(SignalType_ConstPointer_SignalFfiPreKeysResponse) == 8);
static_assert_64bit(alignof(SignalType_ConstPointer_SignalFfiPreKeysResponse) == 8);
static_assert_64bit(sizeof(uint32_t) == 4);
static_assert_64bit(alignof(uint32_t) == 4);
typedef struct {
  uint32_t cdn;
  const int8_t* key;
  SignalOwnedBufferOfCStringPtr header_keys;
  SignalOwnedBufferOfCStringPtr header_values;
  const int8_t* signed_upload_url;
} SignalFfiUploadForm;
static_assert_64bit(offsetof(SignalFfiUploadForm, cdn) == 0);
static_assert_64bit(offsetof(SignalFfiUploadForm, key) == 8);
static_assert_64bit(offsetof(SignalFfiUploadForm, header_keys) == 16);
static_assert_64bit(offsetof(SignalFfiUploadForm, header_values) == 32);
static_assert_64bit(offsetof(SignalFfiUploadForm, signed_upload_url) == 48);
static_assert_64bit(sizeof(SignalFfiUploadForm) == 56);
static_assert_64bit(alignof(SignalFfiUploadForm) == 8);
typedef const SignalFfiUploadForm* SignalType_ConstPointer_SignalFfiUploadForm;
static_assert_64bit(sizeof(SignalType_ConstPointer_SignalFfiUploadForm) == 8);
static_assert_64bit(alignof(SignalType_ConstPointer_SignalFfiUploadForm) == 8);
typedef struct SignalCdsiLookup SignalCdsiLookup;
typedef SignalCdsiLookup* SignalType_MutPointer_SignalCdsiLookup;
static_assert_64bit(sizeof(SignalType_MutPointer_SignalCdsiLookup) == 8);
static_assert_64bit(alignof(SignalType_MutPointer_SignalCdsiLookup) == 8);
typedef struct {
  SignalCdsiLookup* raw;
} SignalMutPointerCdsiLookup;
static_assert_64bit(offsetof(SignalMutPointerCdsiLookup, raw) == 0);
static_assert_64bit(sizeof(SignalMutPointerCdsiLookup) == 8);
static_assert_64bit(alignof(SignalMutPointerCdsiLookup) == 8);
typedef const SignalMutPointerCdsiLookup* SignalType_ConstPointer_SignalMutPointerCdsiLookup;
static_assert_64bit(sizeof(SignalType_ConstPointer_SignalMutPointerCdsiLookup) == 8);
static_assert_64bit(alignof(SignalType_ConstPointer_SignalMutPointerCdsiLookup) == 8);
typedef struct SignalAuthenticatedChatConnection SignalAuthenticatedChatConnection;
typedef SignalAuthenticatedChatConnection* SignalType_MutPointer_SignalAuthenticatedChatConnection;
static_assert_64bit(sizeof(SignalType_MutPointer_SignalAuthenticatedChatConnection) == 8);
static_assert_64bit(alignof(SignalType_MutPointer_SignalAuthenticatedChatConnection) == 8);
typedef struct {
  SignalAuthenticatedChatConnection* raw;
} SignalMutPointerAuthenticatedChatConnection;
static_assert_64bit(offsetof(SignalMutPointerAuthenticatedChatConnection, raw) == 0);
static_assert_64bit(sizeof(SignalMutPointerAuthenticatedChatConnection) == 8);
static_assert_64bit(alignof(SignalMutPointerAuthenticatedChatConnection) == 8);
typedef const SignalMutPointerAuthenticatedChatConnection* SignalType_ConstPointer_SignalMutPointerAuthenticatedChatConnection;
static_assert_64bit(sizeof(SignalType_ConstPointer_SignalMutPointerAuthenticatedChatConnection) == 8);
static_assert_64bit(alignof(SignalType_ConstPointer_SignalMutPointerAuthenticatedChatConnection) == 8);
typedef struct SignalProvisioningChatConnection SignalProvisioningChatConnection;
typedef SignalProvisioningChatConnection* SignalType_MutPointer_SignalProvisioningChatConnection;
static_assert_64bit(sizeof(SignalType_MutPointer_SignalProvisioningChatConnection) == 8);
static_assert_64bit(alignof(SignalType_MutPointer_SignalProvisioningChatConnection) == 8);
typedef struct {
  SignalProvisioningChatConnection* raw;
} SignalMutPointerProvisioningChatConnection;
static_assert_64bit(offsetof(SignalMutPointerProvisioningChatConnection, raw) == 0);
static_assert_64bit(sizeof(SignalMutPointerProvisioningChatConnection) == 8);
static_assert_64bit(alignof(SignalMutPointerProvisioningChatConnection) == 8);
typedef const SignalMutPointerProvisioningChatConnection* SignalType_ConstPointer_SignalMutPointerProvisioningChatConnection;
static_assert_64bit(sizeof(SignalType_ConstPointer_SignalMutPointerProvisioningChatConnection) == 8);
static_assert_64bit(alignof(SignalType_ConstPointer_SignalMutPointerProvisioningChatConnection) == 8);
typedef struct SignalUnauthenticatedChatConnection SignalUnauthenticatedChatConnection;
typedef SignalUnauthenticatedChatConnection* SignalType_MutPointer_SignalUnauthenticatedChatConnection;
static_assert_64bit(sizeof(SignalType_MutPointer_SignalUnauthenticatedChatConnection) == 8);
static_assert_64bit(alignof(SignalType_MutPointer_SignalUnauthenticatedChatConnection) == 8);
typedef struct {
  SignalUnauthenticatedChatConnection* raw;
} SignalMutPointerUnauthenticatedChatConnection;
static_assert_64bit(offsetof(SignalMutPointerUnauthenticatedChatConnection, raw) == 0);
static_assert_64bit(sizeof(SignalMutPointerUnauthenticatedChatConnection) == 8);
static_assert_64bit(alignof(SignalMutPointerUnauthenticatedChatConnection) == 8);
typedef const SignalMutPointerUnauthenticatedChatConnection* SignalType_ConstPointer_SignalMutPointerUnauthenticatedChatConnection;
static_assert_64bit(sizeof(SignalType_ConstPointer_SignalMutPointerUnauthenticatedChatConnection) == 8);
static_assert_64bit(alignof(SignalType_ConstPointer_SignalMutPointerUnauthenticatedChatConnection) == 8);
typedef struct SignalRegistrationService SignalRegistrationService;
typedef SignalRegistrationService* SignalType_MutPointer_SignalRegistrationService;
static_assert_64bit(sizeof(SignalType_MutPointer_SignalRegistrationService) == 8);
static_assert_64bit(alignof(SignalType_MutPointer_SignalRegistrationService) == 8);
typedef struct {
  SignalRegistrationService* raw;
} SignalMutPointerRegistrationService;
static_assert_64bit(offsetof(SignalMutPointerRegistrationService, raw) == 0);
static_assert_64bit(sizeof(SignalMutPointerRegistrationService) == 8);
static_assert_64bit(alignof(SignalMutPointerRegistrationService) == 8);
typedef const SignalMutPointerRegistrationService* SignalType_ConstPointer_SignalMutPointerRegistrationService;
static_assert_64bit(sizeof(SignalType_ConstPointer_SignalMutPointerRegistrationService) == 8);
static_assert_64bit(alignof(SignalType_ConstPointer_SignalMutPointerRegistrationService) == 8);
typedef struct SignalBackupRestoreResponse SignalBackupRestoreResponse;
typedef SignalBackupRestoreResponse* SignalType_MutPointer_SignalBackupRestoreResponse;
static_assert_64bit(sizeof(SignalType_MutPointer_SignalBackupRestoreResponse) == 8);
static_assert_64bit(alignof(SignalType_MutPointer_SignalBackupRestoreResponse) == 8);
typedef struct {
  SignalBackupRestoreResponse* raw;
} SignalMutPointerBackupRestoreResponse;
static_assert_64bit(offsetof(SignalMutPointerBackupRestoreResponse, raw) == 0);
static_assert_64bit(sizeof(SignalMutPointerBackupRestoreResponse) == 8);
static_assert_64bit(alignof(SignalMutPointerBackupRestoreResponse) == 8);
typedef const SignalMutPointerBackupRestoreResponse* SignalType_ConstPointer_SignalMutPointerBackupRestoreResponse;
static_assert_64bit(sizeof(SignalType_ConstPointer_SignalMutPointerBackupRestoreResponse) == 8);
static_assert_64bit(alignof(SignalType_ConstPointer_SignalMutPointerBackupRestoreResponse) == 8);
typedef struct SignalBackupStoreResponse SignalBackupStoreResponse;
typedef SignalBackupStoreResponse* SignalType_MutPointer_SignalBackupStoreResponse;
static_assert_64bit(sizeof(SignalType_MutPointer_SignalBackupStoreResponse) == 8);
static_assert_64bit(alignof(SignalType_MutPointer_SignalBackupStoreResponse) == 8);
typedef struct {
  SignalBackupStoreResponse* raw;
} SignalMutPointerBackupStoreResponse;
static_assert_64bit(offsetof(SignalMutPointerBackupStoreResponse, raw) == 0);
static_assert_64bit(sizeof(SignalMutPointerBackupStoreResponse) == 8);
static_assert_64bit(alignof(SignalMutPointerBackupStoreResponse) == 8);
typedef const SignalMutPointerBackupStoreResponse* SignalType_ConstPointer_SignalMutPointerBackupStoreResponse;
static_assert_64bit(sizeof(SignalType_ConstPointer_SignalMutPointerBackupStoreResponse) == 8);
static_assert_64bit(alignof(SignalType_ConstPointer_SignalMutPointerBackupStoreResponse) == 8);
typedef struct SignalRegisterAccountResponse SignalRegisterAccountResponse;
typedef SignalRegisterAccountResponse* SignalType_MutPointer_SignalRegisterAccountResponse;
static_assert_64bit(sizeof(SignalType_MutPointer_SignalRegisterAccountResponse) == 8);
static_assert_64bit(alignof(SignalType_MutPointer_SignalRegisterAccountResponse) == 8);
typedef struct {
  SignalRegisterAccountResponse* raw;
} SignalMutPointerRegisterAccountResponse;
static_assert_64bit(offsetof(SignalMutPointerRegisterAccountResponse, raw) == 0);
static_assert_64bit(sizeof(SignalMutPointerRegisterAccountResponse) == 8);
static_assert_64bit(alignof(SignalMutPointerRegisterAccountResponse) == 8);
typedef const SignalMutPointerRegisterAccountResponse* SignalType_ConstPointer_SignalMutPointerRegisterAccountResponse;
static_assert_64bit(sizeof(SignalType_ConstPointer_SignalMutPointerRegisterAccountResponse) == 8);
static_assert_64bit(alignof(SignalType_ConstPointer_SignalMutPointerRegisterAccountResponse) == 8);
typedef struct {
  bool present;
  const int8_t* first;
  SignalType_FixedArray32_uint8_t second;
} SignalOptionalPairOfCStringPtrc_uchar32;
static_assert_64bit(offsetof(SignalOptionalPairOfCStringPtrc_uchar32, present) == 0);
static_assert_64bit(offsetof(SignalOptionalPairOfCStringPtrc_uchar32, first) == 8);
static_assert_64bit(offsetof(SignalOptionalPairOfCStringPtrc_uchar32, second) == 16);
static_assert_64bit(sizeof(SignalOptionalPairOfCStringPtrc_uchar32) == 48);
static_assert_64bit(alignof(SignalOptionalPairOfCStringPtrc_uchar32) == 8);
typedef const SignalOptionalPairOfCStringPtrc_uchar32* SignalType_ConstPointer_SignalOptionalPairOfCStringPtrc_uchar32;
static_assert_64bit(sizeof(SignalType_ConstPointer_SignalOptionalPairOfCStringPtrc_uchar32) == 8);
static_assert_64bit(alignof(SignalType_ConstPointer_SignalOptionalPairOfCStringPtrc_uchar32) == 8);
typedef struct {
  bool present;
  SignalType_FixedArray16_uint8_t bytes;
} SignalOptionalUuid;
static_assert_64bit(offsetof(SignalOptionalUuid, present) == 0);
static_assert_64bit(offsetof(SignalOptionalUuid, bytes) == 1);
static_assert_64bit(sizeof(SignalOptionalUuid) == 17);
static_assert_64bit(alignof(SignalOptionalUuid) == 1);
typedef const SignalOptionalUuid* SignalType_ConstPointer_SignalOptionalUuid;
static_assert_64bit(sizeof(SignalType_ConstPointer_SignalOptionalUuid) == 8);
static_assert_64bit(alignof(SignalType_ConstPointer_SignalOptionalUuid) == 8);
typedef SignalType_FixedArray17_uint8_t* SignalType_MutPointer_SignalType_FixedArray17_uint8_t;
static_assert_64bit(sizeof(SignalType_MutPointer_SignalType_FixedArray17_uint8_t) == 8);
static_assert_64bit(alignof(SignalType_MutPointer_SignalType_FixedArray17_uint8_t) == 8);
typedef struct {
  SignalType_FixedArray17_uint8_t* base;
  size_t length;
} SignalOwnedBufferOfc_uchar17;
static_assert_64bit(offsetof(SignalOwnedBufferOfc_uchar17, base) == 0);
static_assert_64bit(offsetof(SignalOwnedBufferOfc_uchar17, length) == 8);
static_assert_64bit(sizeof(SignalOwnedBufferOfc_uchar17) == 16);
static_assert_64bit(alignof(SignalOwnedBufferOfc_uchar17) == 8);
typedef const SignalOwnedBufferOfc_uchar17* SignalType_ConstPointer_SignalOwnedBufferOfc_uchar17;
static_assert_64bit(sizeof(SignalType_ConstPointer_SignalOwnedBufferOfc_uchar17) == 8);
static_assert_64bit(alignof(SignalType_ConstPointer_SignalOwnedBufferOfc_uchar17) == 8);
typedef const SignalOwnedBuffer* SignalType_ConstPointer_SignalOwnedBuffer;
static_assert_64bit(sizeof(SignalType_ConstPointer_SignalOwnedBuffer) == 8);
static_assert_64bit(alignof(SignalType_ConstPointer_SignalOwnedBuffer) == 8);
typedef struct {
  uint8_t id;
  SignalOwnedBuffer encrypted_name;
  uint64_t last_seen;
  uint16_t registration_id;
  SignalOwnedBuffer created_at_ciphertext;
} SignalLinkedDeviceInternalFfiResult;
static_assert_64bit(offsetof(SignalLinkedDeviceInternalFfiResult, id) == 0);
static_assert_64bit(offsetof(SignalLinkedDeviceInternalFfiResult, encrypted_name) == 8);
static_assert_64bit(offsetof(SignalLinkedDeviceInternalFfiResult, last_seen) == 24);
static_assert_64bit(offsetof(SignalLinkedDeviceInternalFfiResult, registration_id) == 32);
static_assert_64bit(offsetof(SignalLinkedDeviceInternalFfiResult, created_at_ciphertext) == 40);
static_assert_64bit(sizeof(SignalLinkedDeviceInternalFfiResult) == 56);
static_assert_64bit(alignof(SignalLinkedDeviceInternalFfiResult) == 8);
typedef SignalLinkedDeviceInternalFfiResult* SignalType_MutPointer_SignalLinkedDeviceInternalFfiResult;
static_assert_64bit(sizeof(SignalType_MutPointer_SignalLinkedDeviceInternalFfiResult) == 8);
static_assert_64bit(alignof(SignalType_MutPointer_SignalLinkedDeviceInternalFfiResult) == 8);
typedef struct {
  SignalLinkedDeviceInternalFfiResult* base;
  size_t length;
  size_t size_bytes;
} SignalOwnedBufferOfMaxAlignedLinkedDeviceInternalFfiResult;
static_assert_64bit(offsetof(SignalOwnedBufferOfMaxAlignedLinkedDeviceInternalFfiResult, base) == 0);
static_assert_64bit(offsetof(SignalOwnedBufferOfMaxAlignedLinkedDeviceInternalFfiResult, length) == 8);
static_assert_64bit(offsetof(SignalOwnedBufferOfMaxAlignedLinkedDeviceInternalFfiResult, size_bytes) == 16);
static_assert_64bit(sizeof(SignalOwnedBufferOfMaxAlignedLinkedDeviceInternalFfiResult) == 24);
static_assert_64bit(alignof(SignalOwnedBufferOfMaxAlignedLinkedDeviceInternalFfiResult) == 8);
typedef const SignalOwnedBufferOfMaxAlignedLinkedDeviceInternalFfiResult* SignalType_ConstPointer_SignalOwnedBufferOfMaxAlignedLinkedDeviceInternalFfiResult;
static_assert_64bit(sizeof(SignalType_ConstPointer_SignalOwnedBufferOfMaxAlignedLinkedDeviceInternalFfiResult) == 8);
static_assert_64bit(alignof(SignalType_ConstPointer_SignalOwnedBufferOfMaxAlignedLinkedDeviceInternalFfiResult) == 8);
typedef struct {
  const int8_t* first;
  const int8_t* second;
} SignalPairOfCStringPtrCStringPtr;
static_assert_64bit(offsetof(SignalPairOfCStringPtrCStringPtr, first) == 0);
static_assert_64bit(offsetof(SignalPairOfCStringPtrCStringPtr, second) == 8);
static_assert_64bit(sizeof(SignalPairOfCStringPtrCStringPtr) == 16);
static_assert_64bit(alignof(SignalPairOfCStringPtrCStringPtr) == 8);
typedef const SignalPairOfCStringPtrCStringPtr* SignalType_ConstPointer_SignalPairOfCStringPtrCStringPtr;
static_assert_64bit(sizeof(SignalType_ConstPointer_SignalPairOfCStringPtrCStringPtr) == 8);
static_assert_64bit(alignof(SignalType_ConstPointer_SignalPairOfCStringPtrCStringPtr) == 8);
typedef struct {
  SignalOwnedBufferOfCStringPtr first;
  SignalOwnedBufferOfCStringPtr second;
} SignalPairOfOwnedBufferOfCStringPtrOwnedBufferOfCStringPtr;
static_assert_64bit(offsetof(SignalPairOfOwnedBufferOfCStringPtrOwnedBufferOfCStringPtr, first) == 0);
static_assert_64bit(offsetof(SignalPairOfOwnedBufferOfCStringPtrOwnedBufferOfCStringPtr, second) == 16);
static_assert_64bit(sizeof(SignalPairOfOwnedBufferOfCStringPtrOwnedBufferOfCStringPtr) == 32);
static_assert_64bit(alignof(SignalPairOfOwnedBufferOfCStringPtrOwnedBufferOfCStringPtr) == 8);
typedef const SignalPairOfOwnedBufferOfCStringPtrOwnedBufferOfCStringPtr* SignalType_ConstPointer_SignalPairOfOwnedBufferOfCStringPtrOwnedBufferOfCStringPtr;
static_assert_64bit(sizeof(SignalType_ConstPointer_SignalPairOfOwnedBufferOfCStringPtrOwnedBufferOfCStringPtr) == 8);
static_assert_64bit(alignof(SignalType_ConstPointer_SignalPairOfOwnedBufferOfCStringPtrOwnedBufferOfCStringPtr) == 8);
typedef struct {
  SignalOwnedBuffer first;
  SignalOwnedBuffer second;
} SignalPairOfOwnedBufferOwnedBuffer;
static_assert_64bit(offsetof(SignalPairOfOwnedBufferOwnedBuffer, first) == 0);
static_assert_64bit(offsetof(SignalPairOfOwnedBufferOwnedBuffer, second) == 16);
static_assert_64bit(sizeof(SignalPairOfOwnedBufferOwnedBuffer) == 32);
static_assert_64bit(alignof(SignalPairOfOwnedBufferOwnedBuffer) == 8);
typedef const SignalPairOfOwnedBufferOwnedBuffer* SignalType_ConstPointer_SignalPairOfOwnedBufferOwnedBuffer;
static_assert_64bit(sizeof(SignalType_ConstPointer_SignalPairOfOwnedBufferOwnedBuffer) == 8);
static_assert_64bit(alignof(SignalType_ConstPointer_SignalPairOfOwnedBufferOwnedBuffer) == 8);
typedef struct {
  SignalType_FixedArray16_uint8_t bytes;
} SignalUuid;
static_assert_64bit(offsetof(SignalUuid, bytes) == 0);
static_assert_64bit(sizeof(SignalUuid) == 16);
static_assert_64bit(alignof(SignalUuid) == 1);
typedef const SignalUuid* SignalType_ConstPointer_SignalUuid;
static_assert_64bit(sizeof(SignalType_ConstPointer_SignalUuid) == 8);
static_assert_64bit(alignof(SignalType_ConstPointer_SignalUuid) == 8);
typedef void* SignalType_MutPointer_void;
static_assert_64bit(sizeof(SignalType_MutPointer_void) == 8);
static_assert_64bit(alignof(SignalType_MutPointer_void) == 8);
typedef void (*SignalType_FunctionPointer_void_SignalType_MutPointer_void)(SignalType_MutPointer_void);
static_assert_64bit(sizeof(SignalType_FunctionPointer_void_SignalType_MutPointer_void) == 8);
static_assert_64bit(alignof(SignalType_FunctionPointer_void_SignalType_MutPointer_void) == 8);
typedef struct SignalConnectionManager SignalConnectionManager;
typedef const SignalConnectionManager* SignalType_ConstPointer_SignalConnectionManager;
static_assert_64bit(sizeof(SignalType_ConstPointer_SignalConnectionManager) == 8);
static_assert_64bit(alignof(SignalType_ConstPointer_SignalConnectionManager) == 8);
typedef SignalType_ConstPointer_SignalConnectionManager (*SignalType_FunctionPointer_SignalType_ConstPointer_SignalConnectionManager_SignalType_MutPointer_void)(SignalType_MutPointer_void);
static_assert_64bit(sizeof(SignalType_FunctionPointer_SignalType_ConstPointer_SignalConnectionManager_SignalType_MutPointer_void) == 8);
static_assert_64bit(alignof(SignalType_FunctionPointer_SignalType_ConstPointer_SignalConnectionManager_SignalType_MutPointer_void) == 8);
typedef struct {
  void* ctx;
  SignalType_FunctionPointer_SignalType_ConstPointer_SignalConnectionManager_SignalType_MutPointer_void get_connection_manager;
  SignalType_FunctionPointer_void_SignalType_MutPointer_void destroy;
} SignalFfiConnectChatBridgeStruct;
static_assert_64bit(offsetof(SignalFfiConnectChatBridgeStruct, ctx) == 0);
static_assert_64bit(offsetof(SignalFfiConnectChatBridgeStruct, get_connection_manager) == 8);
static_assert_64bit(offsetof(SignalFfiConnectChatBridgeStruct, destroy) == 16);
static_assert_64bit(sizeof(SignalFfiConnectChatBridgeStruct) == 24);
static_assert_64bit(alignof(SignalFfiConnectChatBridgeStruct) == 8);
typedef const SignalFfiConnectChatBridgeStruct* SignalType_ConstPointer_SignalFfiConnectChatBridgeStruct;
static_assert_64bit(sizeof(SignalType_ConstPointer_SignalFfiConnectChatBridgeStruct) == 8);
static_assert_64bit(alignof(SignalType_ConstPointer_SignalFfiConnectChatBridgeStruct) == 8);
typedef struct SignalFfiError SignalFfiError;
typedef const SignalFfiError* SignalType_ConstPointer_SignalFfiError;
static_assert_64bit(sizeof(SignalType_ConstPointer_SignalFfiError) == 8);
static_assert_64bit(alignof(SignalType_ConstPointer_SignalFfiError) == 8);
typedef struct SignalHsmEnclaveClient SignalHsmEnclaveClient;
typedef const SignalHsmEnclaveClient* SignalType_ConstPointer_SignalHsmEnclaveClient;
static_assert_64bit(sizeof(SignalType_ConstPointer_SignalHsmEnclaveClient) == 8);
static_assert_64bit(alignof(SignalType_ConstPointer_SignalHsmEnclaveClient) == 8);
typedef struct {
  uint8_t* base;
  size_t length;
} SignalBorrowedMutableBuffer;
static_assert_64bit(offsetof(SignalBorrowedMutableBuffer, base) == 0);
static_assert_64bit(offsetof(SignalBorrowedMutableBuffer, length) == 8);
static_assert_64bit(sizeof(SignalBorrowedMutableBuffer) == 16);
static_assert_64bit(alignof(SignalBorrowedMutableBuffer) == 8);
typedef int32_t (*SignalType_FunctionPointer_int32_t_SignalType_MutPointer_void_SignalType_MutPointer_size_t_SignalBorrowedMutableBuffer)(SignalType_MutPointer_void, SignalType_MutPointer_size_t, SignalBorrowedMutableBuffer);
static_assert_64bit(sizeof(SignalType_FunctionPointer_int32_t_SignalType_MutPointer_void_SignalType_MutPointer_size_t_SignalBorrowedMutableBuffer) == 8);
static_assert_64bit(alignof(SignalType_FunctionPointer_int32_t_SignalType_MutPointer_void_SignalType_MutPointer_size_t_SignalBorrowedMutableBuffer) == 8);
typedef int32_t (*SignalType_FunctionPointer_int32_t_SignalType_MutPointer_void_uint64_t)(SignalType_MutPointer_void, uint64_t);
static_assert_64bit(sizeof(SignalType_FunctionPointer_int32_t_SignalType_MutPointer_void_uint64_t) == 8);
static_assert_64bit(alignof(SignalType_FunctionPointer_int32_t_SignalType_MutPointer_void_uint64_t) == 8);
typedef struct {
  void* ctx;
  SignalType_FunctionPointer_int32_t_SignalType_MutPointer_void_SignalType_MutPointer_size_t_SignalBorrowedMutableBuffer read;
  SignalType_FunctionPointer_int32_t_SignalType_MutPointer_void_uint64_t skip;
  SignalType_FunctionPointer_void_SignalType_MutPointer_void destroy;
} SignalFfiSyncInputStreamStruct;
static_assert_64bit(offsetof(SignalFfiSyncInputStreamStruct, ctx) == 0);
static_assert_64bit(offsetof(SignalFfiSyncInputStreamStruct, read) == 8);
static_assert_64bit(offsetof(SignalFfiSyncInputStreamStruct, skip) == 16);
static_assert_64bit(offsetof(SignalFfiSyncInputStreamStruct, destroy) == 24);
static_assert_64bit(sizeof(SignalFfiSyncInputStreamStruct) == 32);
static_assert_64bit(alignof(SignalFfiSyncInputStreamStruct) == 8);
typedef const SignalFfiSyncInputStreamStruct* SignalType_ConstPointer_SignalFfiSyncInputStreamStruct;
static_assert_64bit(sizeof(SignalType_ConstPointer_SignalFfiSyncInputStreamStruct) == 8);
static_assert_64bit(alignof(SignalType_ConstPointer_SignalFfiSyncInputStreamStruct) == 8);
typedef struct SignalMessageBackupKey SignalMessageBackupKey;
typedef const SignalMessageBackupKey* SignalType_ConstPointer_SignalMessageBackupKey;
static_assert_64bit(sizeof(SignalType_ConstPointer_SignalMessageBackupKey) == 8);
static_assert_64bit(alignof(SignalType_ConstPointer_SignalMessageBackupKey) == 8);
typedef struct SignalMessageBackupValidationOutcome SignalMessageBackupValidationOutcome;
typedef const SignalMessageBackupValidationOutcome* SignalType_ConstPointer_SignalMessageBackupValidationOutcome;
static_assert_64bit(sizeof(SignalType_ConstPointer_SignalMessageBackupValidationOutcome) == 8);
static_assert_64bit(alignof(SignalType_ConstPointer_SignalMessageBackupValidationOutcome) == 8);
typedef const SignalCdsiLookup* SignalType_ConstPointer_SignalCdsiLookup;
static_assert_64bit(sizeof(SignalType_ConstPointer_SignalCdsiLookup) == 8);
static_assert_64bit(alignof(SignalType_ConstPointer_SignalCdsiLookup) == 8);
typedef struct SignalLookupRequest SignalLookupRequest;
typedef const SignalLookupRequest* SignalType_ConstPointer_SignalLookupRequest;
static_assert_64bit(sizeof(SignalType_ConstPointer_SignalLookupRequest) == 8);
static_assert_64bit(alignof(SignalType_ConstPointer_SignalLookupRequest) == 8);
typedef const SignalAuthenticatedChatConnection* SignalType_ConstPointer_SignalAuthenticatedChatConnection;
static_assert_64bit(sizeof(SignalType_ConstPointer_SignalAuthenticatedChatConnection) == 8);
static_assert_64bit(alignof(SignalType_ConstPointer_SignalAuthenticatedChatConnection) == 8);
static_assert_64bit(sizeof(int64_t) == 8);
static_assert_64bit(alignof(int64_t) == 8);
typedef struct {
  int32_t source_attachment_cdn;
  const int8_t* source_key;
  int64_t object_length;
  const SignalType_FixedArray15_uint8_t* media_id;
  const SignalType_FixedArray64_uint8_t* encryption_key;
} SignalBridgeCopyBackupMediaItemFfiArg;
static_assert_64bit(offsetof(SignalBridgeCopyBackupMediaItemFfiArg, source_attachment_cdn) == 0);
static_assert_64bit(offsetof(SignalBridgeCopyBackupMediaItemFfiArg, source_key) == 8);
static_assert_64bit(offsetof(SignalBridgeCopyBackupMediaItemFfiArg, object_length) == 16);
static_assert_64bit(offsetof(SignalBridgeCopyBackupMediaItemFfiArg, media_id) == 24);
static_assert_64bit(offsetof(SignalBridgeCopyBackupMediaItemFfiArg, encryption_key) == 32);
static_assert_64bit(sizeof(SignalBridgeCopyBackupMediaItemFfiArg) == 40);
static_assert_64bit(alignof(SignalBridgeCopyBackupMediaItemFfiArg) == 8);
typedef const SignalBridgeCopyBackupMediaItemFfiArg* SignalType_ConstPointer_SignalBridgeCopyBackupMediaItemFfiArg;
static_assert_64bit(sizeof(SignalType_ConstPointer_SignalBridgeCopyBackupMediaItemFfiArg) == 8);
static_assert_64bit(alignof(SignalType_ConstPointer_SignalBridgeCopyBackupMediaItemFfiArg) == 8);
typedef enum {
  SignalBridgeCopyBackupMediaResultFfiResultSuccess,
  SignalBridgeCopyBackupMediaResultFfiResultSourceNotFound,
  SignalBridgeCopyBackupMediaResultFfiResultWrongSourceLength,
  SignalBridgeCopyBackupMediaResultFfiResultOutOfSpace,
} SignalBridgeCopyBackupMediaResultFfiResult_Tag;
typedef struct {
  int32_t cdn;
} SignalBridgeCopyBackupMediaResultFfiResultSignalSuccess_Body;
typedef struct {
  SignalBridgeCopyBackupMediaResultFfiResult_Tag tag;
  union {
    SignalBridgeCopyBackupMediaResultFfiResultSignalSuccess_Body success;
  };
} SignalBridgeCopyBackupMediaResultFfiResult;
static_assert_64bit(sizeof(SignalBridgeCopyBackupMediaResultFfiResult) == 8);
static_assert_64bit(alignof(SignalBridgeCopyBackupMediaResultFfiResult) == 4);
typedef struct {
  SignalType_FixedArray15_uint8_t media_id;
  SignalBridgeCopyBackupMediaResultFfiResult result;
} SignalBridgeCopyBackupMediaOutcomeFfiResult;
static_assert_64bit(offsetof(SignalBridgeCopyBackupMediaOutcomeFfiResult, media_id) == 0);
static_assert_64bit(offsetof(SignalBridgeCopyBackupMediaOutcomeFfiResult, result) == 16);
static_assert_64bit(sizeof(SignalBridgeCopyBackupMediaOutcomeFfiResult) == 24);
static_assert_64bit(alignof(SignalBridgeCopyBackupMediaOutcomeFfiResult) == 4);
typedef SignalBridgeCopyBackupMediaOutcomeFfiResult* SignalType_MutPointer_SignalBridgeCopyBackupMediaOutcomeFfiResult;
static_assert_64bit(sizeof(SignalType_MutPointer_SignalBridgeCopyBackupMediaOutcomeFfiResult) == 8);
static_assert_64bit(alignof(SignalType_MutPointer_SignalBridgeCopyBackupMediaOutcomeFfiResult) == 8);
typedef struct {
  SignalBridgeCopyBackupMediaOutcomeFfiResult* base;
  size_t length;
  size_t size_bytes;
} SignalOwnedBufferOfMaxAlignedBridgeCopyBackupMediaOutcomeFfiResult;
static_assert_64bit(offsetof(SignalOwnedBufferOfMaxAlignedBridgeCopyBackupMediaOutcomeFfiResult, base) == 0);
static_assert_64bit(offsetof(SignalOwnedBufferOfMaxAlignedBridgeCopyBackupMediaOutcomeFfiResult, length) == 8);
static_assert_64bit(offsetof(SignalOwnedBufferOfMaxAlignedBridgeCopyBackupMediaOutcomeFfiResult, size_bytes) == 16);
static_assert_64bit(sizeof(SignalOwnedBufferOfMaxAlignedBridgeCopyBackupMediaOutcomeFfiResult) == 24);
static_assert_64bit(alignof(SignalOwnedBufferOfMaxAlignedBridgeCopyBackupMediaOutcomeFfiResult) == 8);
typedef SignalFfiError* SignalType_MutPointer_SignalFfiError;
static_assert_64bit(sizeof(SignalType_MutPointer_SignalFfiError) == 8);
static_assert_64bit(alignof(SignalType_MutPointer_SignalFfiError) == 8);
typedef struct {
  SignalFfiError* raw;
} SignalFfiBulkPolledStreamTerminationReason;
static_assert_64bit(offsetof(SignalFfiBulkPolledStreamTerminationReason, raw) == 0);
static_assert_64bit(sizeof(SignalFfiBulkPolledStreamTerminationReason) == 8);
static_assert_64bit(alignof(SignalFfiBulkPolledStreamTerminationReason) == 8);
typedef struct {
  SignalOwnedBufferOfMaxAlignedBridgeCopyBackupMediaOutcomeFfiResult chunk;
  SignalFfiBulkPolledStreamTerminationReason termination;
} SignalCopyBackupMediaNextChunkFfiResult;
static_assert_64bit(offsetof(SignalCopyBackupMediaNextChunkFfiResult, chunk) == 0);
static_assert_64bit(offsetof(SignalCopyBackupMediaNextChunkFfiResult, termination) == 24);
static_assert_64bit(sizeof(SignalCopyBackupMediaNextChunkFfiResult) == 32);
static_assert_64bit(alignof(SignalCopyBackupMediaNextChunkFfiResult) == 8);
typedef const SignalCopyBackupMediaNextChunkFfiResult* SignalType_ConstPointer_SignalCopyBackupMediaNextChunkFfiResult;
static_assert_64bit(sizeof(SignalType_ConstPointer_SignalCopyBackupMediaNextChunkFfiResult) == 8);
static_assert_64bit(alignof(SignalType_ConstPointer_SignalCopyBackupMediaNextChunkFfiResult) == 8);
typedef struct SignalCopyBackupMediaStream SignalCopyBackupMediaStream;
typedef const SignalCopyBackupMediaStream* SignalType_ConstPointer_SignalCopyBackupMediaStream;
static_assert_64bit(sizeof(SignalType_ConstPointer_SignalCopyBackupMediaStream) == 8);
static_assert_64bit(alignof(SignalType_ConstPointer_SignalCopyBackupMediaStream) == 8);
typedef int32_t (*SignalType_FunctionPointer_int32_t_SignalType_MutPointer_void)(SignalType_MutPointer_void);
static_assert_64bit(sizeof(SignalType_FunctionPointer_int32_t_SignalType_MutPointer_void) == 8);
static_assert_64bit(alignof(SignalType_FunctionPointer_int32_t_SignalType_MutPointer_void) == 8);
typedef int32_t (*SignalType_FunctionPointer_int32_t_SignalType_MutPointer_void_SignalType_MutPointer_SignalFfiError)(SignalType_MutPointer_void, SignalType_MutPointer_SignalFfiError);
static_assert_64bit(sizeof(SignalType_FunctionPointer_int32_t_SignalType_MutPointer_void_SignalType_MutPointer_SignalFfiError) == 8);
static_assert_64bit(alignof(SignalType_FunctionPointer_int32_t_SignalType_MutPointer_void_SignalType_MutPointer_SignalFfiError) == 8);
typedef int32_t (*SignalType_FunctionPointer_int32_t_SignalType_MutPointer_void_SignalBytestringArray)(SignalType_MutPointer_void, SignalBytestringArray);
static_assert_64bit(sizeof(SignalType_FunctionPointer_int32_t_SignalType_MutPointer_void_SignalBytestringArray) == 8);
static_assert_64bit(alignof(SignalType_FunctionPointer_int32_t_SignalType_MutPointer_void_SignalBytestringArray) == 8);
typedef struct SignalServerMessageAck SignalServerMessageAck;
typedef SignalServerMessageAck* SignalType_MutPointer_SignalServerMessageAck;
static_assert_64bit(sizeof(SignalType_MutPointer_SignalServerMessageAck) == 8);
static_assert_64bit(alignof(SignalType_MutPointer_SignalServerMessageAck) == 8);
typedef struct {
  SignalServerMessageAck* raw;
} SignalMutPointerServerMessageAck;
static_assert_64bit(offsetof(SignalMutPointerServerMessageAck, raw) == 0);
static_assert_64bit(sizeof(SignalMutPointerServerMessageAck) == 8);
static_assert_64bit(alignof(SignalMutPointerServerMessageAck) == 8);
typedef int32_t (*SignalType_FunctionPointer_int32_t_SignalType_MutPointer_void_SignalOwnedBuffer_uint64_t_SignalMutPointerServerMessageAck)(SignalType_MutPointer_void, SignalOwnedBuffer, uint64_t, SignalMutPointerServerMessageAck);
static_assert_64bit(sizeof(SignalType_FunctionPointer_int32_t_SignalType_MutPointer_void_SignalOwnedBuffer_uint64_t_SignalMutPointerServerMessageAck) == 8);
static_assert_64bit(alignof(SignalType_FunctionPointer_int32_t_SignalType_MutPointer_void_SignalOwnedBuffer_uint64_t_SignalMutPointerServerMessageAck) == 8);
typedef struct {
  void* ctx;
  SignalType_FunctionPointer_int32_t_SignalType_MutPointer_void_SignalOwnedBuffer_uint64_t_SignalMutPointerServerMessageAck received_incoming_message;
  SignalType_FunctionPointer_int32_t_SignalType_MutPointer_void received_queue_empty;
  SignalType_FunctionPointer_int32_t_SignalType_MutPointer_void_SignalBytestringArray received_alerts;
  SignalType_FunctionPointer_int32_t_SignalType_MutPointer_void_SignalType_MutPointer_SignalFfiError connection_interrupted;
  SignalType_FunctionPointer_void_SignalType_MutPointer_void destroy;
} SignalFfiChatListenerStruct;
static_assert_64bit(offsetof(SignalFfiChatListenerStruct, ctx) == 0);
static_assert_64bit(offsetof(SignalFfiChatListenerStruct, received_incoming_message) == 8);
static_assert_64bit(offsetof(SignalFfiChatListenerStruct, received_queue_empty) == 16);
static_assert_64bit(offsetof(SignalFfiChatListenerStruct, received_alerts) == 24);
static_assert_64bit(offsetof(SignalFfiChatListenerStruct, connection_interrupted) == 32);
static_assert_64bit(offsetof(SignalFfiChatListenerStruct, destroy) == 40);
static_assert_64bit(sizeof(SignalFfiChatListenerStruct) == 48);
static_assert_64bit(alignof(SignalFfiChatListenerStruct) == 8);
typedef const SignalFfiChatListenerStruct* SignalType_ConstPointer_SignalFfiChatListenerStruct;
static_assert_64bit(sizeof(SignalType_ConstPointer_SignalFfiChatListenerStruct) == 8);
static_assert_64bit(alignof(SignalType_ConstPointer_SignalFfiChatListenerStruct) == 8);
typedef int32_t (*SignalType_FunctionPointer_int32_t_SignalType_MutPointer_void_SignalCStringPtr_SignalMutPointerServerMessageAck)(SignalType_MutPointer_void, SignalCStringPtr, SignalMutPointerServerMessageAck);
static_assert_64bit(sizeof(SignalType_FunctionPointer_int32_t_SignalType_MutPointer_void_SignalCStringPtr_SignalMutPointerServerMessageAck) == 8);
static_assert_64bit(alignof(SignalType_FunctionPointer_int32_t_SignalType_MutPointer_void_SignalCStringPtr_SignalMutPointerServerMessageAck) == 8);
typedef int32_t (*SignalType_FunctionPointer_int32_t_SignalType_MutPointer_void_SignalOwnedBuffer_SignalMutPointerServerMessageAck)(SignalType_MutPointer_void, SignalOwnedBuffer, SignalMutPointerServerMessageAck);
static_assert_64bit(sizeof(SignalType_FunctionPointer_int32_t_SignalType_MutPointer_void_SignalOwnedBuffer_SignalMutPointerServerMessageAck) == 8);
static_assert_64bit(alignof(SignalType_FunctionPointer_int32_t_SignalType_MutPointer_void_SignalOwnedBuffer_SignalMutPointerServerMessageAck) == 8);
typedef struct {
  void* ctx;
  SignalType_FunctionPointer_int32_t_SignalType_MutPointer_void_SignalCStringPtr_SignalMutPointerServerMessageAck received_address;
  SignalType_FunctionPointer_int32_t_SignalType_MutPointer_void_SignalOwnedBuffer_SignalMutPointerServerMessageAck received_envelope;
  SignalType_FunctionPointer_int32_t_SignalType_MutPointer_void_SignalType_MutPointer_SignalFfiError connection_interrupted;
  SignalType_FunctionPointer_void_SignalType_MutPointer_void destroy;
} SignalFfiProvisioningListenerStruct;
static_assert_64bit(offsetof(SignalFfiProvisioningListenerStruct, ctx) == 0);
static_assert_64bit(offsetof(SignalFfiProvisioningListenerStruct, received_address) == 8);
static_assert_64bit(offsetof(SignalFfiProvisioningListenerStruct, received_envelope) == 16);
static_assert_64bit(offsetof(SignalFfiProvisioningListenerStruct, connection_interrupted) == 24);
static_assert_64bit(offsetof(SignalFfiProvisioningListenerStruct, destroy) == 32);
static_assert_64bit(sizeof(SignalFfiProvisioningListenerStruct) == 40);
static_assert_64bit(alignof(SignalFfiProvisioningListenerStruct) == 8);
typedef const SignalFfiProvisioningListenerStruct* SignalType_ConstPointer_SignalFfiProvisioningListenerStruct;
static_assert_64bit(sizeof(SignalType_ConstPointer_SignalFfiProvisioningListenerStruct) == 8);
static_assert_64bit(alignof(SignalType_ConstPointer_SignalFfiProvisioningListenerStruct) == 8);
typedef struct SignalHttpRequest SignalHttpRequest;
typedef const SignalHttpRequest* SignalType_ConstPointer_SignalHttpRequest;
static_assert_64bit(sizeof(SignalType_ConstPointer_SignalHttpRequest) == 8);
static_assert_64bit(alignof(SignalType_ConstPointer_SignalHttpRequest) == 8);
typedef const SignalProvisioningChatConnection* SignalType_ConstPointer_SignalProvisioningChatConnection;
static_assert_64bit(sizeof(SignalType_ConstPointer_SignalProvisioningChatConnection) == 8);
static_assert_64bit(alignof(SignalType_ConstPointer_SignalProvisioningChatConnection) == 8);
typedef const SignalServerMessageAck* SignalType_ConstPointer_SignalServerMessageAck;
static_assert_64bit(sizeof(SignalType_ConstPointer_SignalServerMessageAck) == 8);
static_assert_64bit(alignof(SignalType_ConstPointer_SignalServerMessageAck) == 8);
typedef const SignalUnauthenticatedChatConnection* SignalType_ConstPointer_SignalUnauthenticatedChatConnection;
static_assert_64bit(sizeof(SignalType_ConstPointer_SignalUnauthenticatedChatConnection) == 8);
static_assert_64bit(alignof(SignalType_ConstPointer_SignalUnauthenticatedChatConnection) == 8);
typedef struct SignalRegistrationAccountAttributes SignalRegistrationAccountAttributes;
typedef const SignalRegistrationAccountAttributes* SignalType_ConstPointer_SignalRegistrationAccountAttributes;
static_assert_64bit(sizeof(SignalType_ConstPointer_SignalRegistrationAccountAttributes) == 8);
static_assert_64bit(alignof(SignalType_ConstPointer_SignalRegistrationAccountAttributes) == 8);
typedef struct SignalRegisterAccountRequest SignalRegisterAccountRequest;
typedef const SignalRegisterAccountRequest* SignalType_ConstPointer_SignalRegisterAccountRequest;
static_assert_64bit(sizeof(SignalType_ConstPointer_SignalRegisterAccountRequest) == 8);
static_assert_64bit(alignof(SignalType_ConstPointer_SignalRegisterAccountRequest) == 8);
typedef const SignalRegistrationService* SignalType_ConstPointer_SignalRegistrationService;
static_assert_64bit(sizeof(SignalType_ConstPointer_SignalRegistrationService) == 8);
static_assert_64bit(alignof(SignalType_ConstPointer_SignalRegistrationService) == 8);
typedef struct SignalTokioAsyncContext SignalTokioAsyncContext;
typedef const SignalTokioAsyncContext* SignalType_ConstPointer_SignalTokioAsyncContext;
static_assert_64bit(sizeof(SignalType_ConstPointer_SignalTokioAsyncContext) == 8);
static_assert_64bit(alignof(SignalType_ConstPointer_SignalTokioAsyncContext) == 8);
typedef bool* SignalType_MutPointer_bool;
static_assert_64bit(sizeof(SignalType_MutPointer_bool) == 8);
static_assert_64bit(alignof(SignalType_MutPointer_bool) == 8);
typedef SignalProtocolAddress* SignalType_MutPointer_SignalProtocolAddress;
static_assert_64bit(sizeof(SignalType_MutPointer_SignalProtocolAddress) == 8);
static_assert_64bit(alignof(SignalType_MutPointer_SignalProtocolAddress) == 8);
typedef struct {
  SignalProtocolAddress* raw;
} SignalMutPointerProtocolAddress;
static_assert_64bit(offsetof(SignalMutPointerProtocolAddress, raw) == 0);
static_assert_64bit(sizeof(SignalMutPointerProtocolAddress) == 8);
static_assert_64bit(alignof(SignalMutPointerProtocolAddress) == 8);
typedef int32_t (*SignalType_FunctionPointer_int32_t_SignalType_MutPointer_void_SignalType_MutPointer_bool_SignalMutPointerProtocolAddress_SignalMutPointerPublicKey_uint32_t)(SignalType_MutPointer_void, SignalType_MutPointer_bool, SignalMutPointerProtocolAddress, SignalMutPointerPublicKey, uint32_t);
static_assert_64bit(sizeof(SignalType_FunctionPointer_int32_t_SignalType_MutPointer_void_SignalType_MutPointer_bool_SignalMutPointerProtocolAddress_SignalMutPointerPublicKey_uint32_t) == 8);
static_assert_64bit(alignof(SignalType_FunctionPointer_int32_t_SignalType_MutPointer_void_SignalType_MutPointer_bool_SignalMutPointerProtocolAddress_SignalMutPointerPublicKey_uint32_t) == 8);
typedef SignalMutPointerPublicKey* SignalType_MutPointer_SignalMutPointerPublicKey;
static_assert_64bit(sizeof(SignalType_MutPointer_SignalMutPointerPublicKey) == 8);
static_assert_64bit(alignof(SignalType_MutPointer_SignalMutPointerPublicKey) == 8);
typedef int32_t (*SignalType_FunctionPointer_int32_t_SignalType_MutPointer_void_SignalType_MutPointer_SignalMutPointerPublicKey_SignalMutPointerProtocolAddress)(SignalType_MutPointer_void, SignalType_MutPointer_SignalMutPointerPublicKey, SignalMutPointerProtocolAddress);
static_assert_64bit(sizeof(SignalType_FunctionPointer_int32_t_SignalType_MutPointer_void_SignalType_MutPointer_SignalMutPointerPublicKey_SignalMutPointerProtocolAddress) == 8);
static_assert_64bit(alignof(SignalType_FunctionPointer_int32_t_SignalType_MutPointer_void_SignalType_MutPointer_SignalMutPointerPublicKey_SignalMutPointerProtocolAddress) == 8);
typedef struct SignalPrivateKey SignalPrivateKey;
typedef SignalPrivateKey* SignalType_MutPointer_SignalPrivateKey;
static_assert_64bit(sizeof(SignalType_MutPointer_SignalPrivateKey) == 8);
static_assert_64bit(alignof(SignalType_MutPointer_SignalPrivateKey) == 8);
typedef struct {
  SignalPrivateKey* raw;
} SignalMutPointerPrivateKey;
static_assert_64bit(offsetof(SignalMutPointerPrivateKey, raw) == 0);
static_assert_64bit(sizeof(SignalMutPointerPrivateKey) == 8);
static_assert_64bit(alignof(SignalMutPointerPrivateKey) == 8);
typedef struct {
  SignalMutPointerPrivateKey first;
  SignalMutPointerPublicKey second;
} SignalPairOfMutPointerPrivateKeyMutPointerPublicKey;
static_assert_64bit(offsetof(SignalPairOfMutPointerPrivateKeyMutPointerPublicKey, first) == 0);
static_assert_64bit(offsetof(SignalPairOfMutPointerPrivateKeyMutPointerPublicKey, second) == 8);
static_assert_64bit(sizeof(SignalPairOfMutPointerPrivateKeyMutPointerPublicKey) == 16);
static_assert_64bit(alignof(SignalPairOfMutPointerPrivateKeyMutPointerPublicKey) == 8);
typedef SignalPairOfMutPointerPrivateKeyMutPointerPublicKey* SignalType_MutPointer_SignalPairOfMutPointerPrivateKeyMutPointerPublicKey;
static_assert_64bit(sizeof(SignalType_MutPointer_SignalPairOfMutPointerPrivateKeyMutPointerPublicKey) == 8);
static_assert_64bit(alignof(SignalType_MutPointer_SignalPairOfMutPointerPrivateKeyMutPointerPublicKey) == 8);
typedef int32_t (*SignalType_FunctionPointer_int32_t_SignalType_MutPointer_void_SignalType_MutPointer_SignalPairOfMutPointerPrivateKeyMutPointerPublicKey)(SignalType_MutPointer_void, SignalType_MutPointer_SignalPairOfMutPointerPrivateKeyMutPointerPublicKey);
static_assert_64bit(sizeof(SignalType_FunctionPointer_int32_t_SignalType_MutPointer_void_SignalType_MutPointer_SignalPairOfMutPointerPrivateKeyMutPointerPublicKey) == 8);
static_assert_64bit(alignof(SignalType_FunctionPointer_int32_t_SignalType_MutPointer_void_SignalType_MutPointer_SignalPairOfMutPointerPrivateKeyMutPointerPublicKey) == 8);
typedef uint32_t* SignalType_MutPointer_uint32_t;
static_assert_64bit(sizeof(SignalType_MutPointer_uint32_t) == 8);
static_assert_64bit(alignof(SignalType_MutPointer_uint32_t) == 8);
typedef int32_t (*SignalType_FunctionPointer_int32_t_SignalType_MutPointer_void_SignalType_MutPointer_uint32_t)(SignalType_MutPointer_void, SignalType_MutPointer_uint32_t);
static_assert_64bit(sizeof(SignalType_FunctionPointer_int32_t_SignalType_MutPointer_void_SignalType_MutPointer_uint32_t) == 8);
static_assert_64bit(alignof(SignalType_FunctionPointer_int32_t_SignalType_MutPointer_void_SignalType_MutPointer_uint32_t) == 8);
typedef int32_t (*SignalType_FunctionPointer_int32_t_SignalType_MutPointer_void_SignalType_MutPointer_uint8_t_SignalMutPointerProtocolAddress_SignalMutPointerPublicKey)(SignalType_MutPointer_void, SignalType_MutPointer_uint8_t, SignalMutPointerProtocolAddress, SignalMutPointerPublicKey);
static_assert_64bit(sizeof(SignalType_FunctionPointer_int32_t_SignalType_MutPointer_void_SignalType_MutPointer_uint8_t_SignalMutPointerProtocolAddress_SignalMutPointerPublicKey) == 8);
static_assert_64bit(alignof(SignalType_FunctionPointer_int32_t_SignalType_MutPointer_void_SignalType_MutPointer_uint8_t_SignalMutPointerProtocolAddress_SignalMutPointerPublicKey) == 8);
typedef struct {
  void* ctx;
  SignalType_FunctionPointer_int32_t_SignalType_MutPointer_void_SignalType_MutPointer_SignalPairOfMutPointerPrivateKeyMutPointerPublicKey get_local_identity_key_pair;
  SignalType_FunctionPointer_int32_t_SignalType_MutPointer_void_SignalType_MutPointer_uint32_t get_local_registration_id;
  SignalType_FunctionPointer_int32_t_SignalType_MutPointer_void_SignalType_MutPointer_SignalMutPointerPublicKey_SignalMutPointerProtocolAddress get_identity_key;
  SignalType_FunctionPointer_int32_t_SignalType_MutPointer_void_SignalType_MutPointer_uint8_t_SignalMutPointerProtocolAddress_SignalMutPointerPublicKey save_identity_key;
  SignalType_FunctionPointer_int32_t_SignalType_MutPointer_void_SignalType_MutPointer_bool_SignalMutPointerProtocolAddress_SignalMutPointerPublicKey_uint32_t is_trusted_identity;
  SignalType_FunctionPointer_void_SignalType_MutPointer_void destroy;
} SignalFfiIdentityKeyStoreStruct;
static_assert_64bit(offsetof(SignalFfiIdentityKeyStoreStruct, ctx) == 0);
static_assert_64bit(offsetof(SignalFfiIdentityKeyStoreStruct, get_local_identity_key_pair) == 8);
static_assert_64bit(offsetof(SignalFfiIdentityKeyStoreStruct, get_local_registration_id) == 16);
static_assert_64bit(offsetof(SignalFfiIdentityKeyStoreStruct, get_identity_key) == 24);
static_assert_64bit(offsetof(SignalFfiIdentityKeyStoreStruct, save_identity_key) == 32);
static_assert_64bit(offsetof(SignalFfiIdentityKeyStoreStruct, is_trusted_identity) == 40);
static_assert_64bit(offsetof(SignalFfiIdentityKeyStoreStruct, destroy) == 48);
static_assert_64bit(sizeof(SignalFfiIdentityKeyStoreStruct) == 56);
static_assert_64bit(alignof(SignalFfiIdentityKeyStoreStruct) == 8);
typedef const SignalFfiIdentityKeyStoreStruct* SignalType_ConstPointer_SignalFfiIdentityKeyStoreStruct;
static_assert_64bit(sizeof(SignalType_ConstPointer_SignalFfiIdentityKeyStoreStruct) == 8);
static_assert_64bit(alignof(SignalType_ConstPointer_SignalFfiIdentityKeyStoreStruct) == 8);
typedef struct SignalKyberPreKeyRecord SignalKyberPreKeyRecord;
typedef SignalKyberPreKeyRecord* SignalType_MutPointer_SignalKyberPreKeyRecord;
static_assert_64bit(sizeof(SignalType_MutPointer_SignalKyberPreKeyRecord) == 8);
static_assert_64bit(alignof(SignalType_MutPointer_SignalKyberPreKeyRecord) == 8);
typedef struct {
  SignalKyberPreKeyRecord* raw;
} SignalMutPointerKyberPreKeyRecord;
static_assert_64bit(offsetof(SignalMutPointerKyberPreKeyRecord, raw) == 0);
static_assert_64bit(sizeof(SignalMutPointerKyberPreKeyRecord) == 8);
static_assert_64bit(alignof(SignalMutPointerKyberPreKeyRecord) == 8);
typedef SignalMutPointerKyberPreKeyRecord* SignalType_MutPointer_SignalMutPointerKyberPreKeyRecord;
static_assert_64bit(sizeof(SignalType_MutPointer_SignalMutPointerKyberPreKeyRecord) == 8);
static_assert_64bit(alignof(SignalType_MutPointer_SignalMutPointerKyberPreKeyRecord) == 8);
typedef int32_t (*SignalType_FunctionPointer_int32_t_SignalType_MutPointer_void_SignalType_MutPointer_SignalMutPointerKyberPreKeyRecord_uint32_t)(SignalType_MutPointer_void, SignalType_MutPointer_SignalMutPointerKyberPreKeyRecord, uint32_t);
static_assert_64bit(sizeof(SignalType_FunctionPointer_int32_t_SignalType_MutPointer_void_SignalType_MutPointer_SignalMutPointerKyberPreKeyRecord_uint32_t) == 8);
static_assert_64bit(alignof(SignalType_FunctionPointer_int32_t_SignalType_MutPointer_void_SignalType_MutPointer_SignalMutPointerKyberPreKeyRecord_uint32_t) == 8);
typedef int32_t (*SignalType_FunctionPointer_int32_t_SignalType_MutPointer_void_uint32_t_SignalMutPointerKyberPreKeyRecord)(SignalType_MutPointer_void, uint32_t, SignalMutPointerKyberPreKeyRecord);
static_assert_64bit(sizeof(SignalType_FunctionPointer_int32_t_SignalType_MutPointer_void_uint32_t_SignalMutPointerKyberPreKeyRecord) == 8);
static_assert_64bit(alignof(SignalType_FunctionPointer_int32_t_SignalType_MutPointer_void_uint32_t_SignalMutPointerKyberPreKeyRecord) == 8);
typedef int32_t (*SignalType_FunctionPointer_int32_t_SignalType_MutPointer_void_uint32_t_uint32_t_SignalMutPointerPublicKey)(SignalType_MutPointer_void, uint32_t, uint32_t, SignalMutPointerPublicKey);
static_assert_64bit(sizeof(SignalType_FunctionPointer_int32_t_SignalType_MutPointer_void_uint32_t_uint32_t_SignalMutPointerPublicKey) == 8);
static_assert_64bit(alignof(SignalType_FunctionPointer_int32_t_SignalType_MutPointer_void_uint32_t_uint32_t_SignalMutPointerPublicKey) == 8);
typedef struct {
  void* ctx;
  SignalType_FunctionPointer_int32_t_SignalType_MutPointer_void_SignalType_MutPointer_SignalMutPointerKyberPreKeyRecord_uint32_t load_kyber_pre_key;
  SignalType_FunctionPointer_int32_t_SignalType_MutPointer_void_uint32_t_SignalMutPointerKyberPreKeyRecord store_kyber_pre_key;
  SignalType_FunctionPointer_int32_t_SignalType_MutPointer_void_uint32_t_uint32_t_SignalMutPointerPublicKey mark_kyber_pre_key_used;
  SignalType_FunctionPointer_void_SignalType_MutPointer_void destroy;
} SignalFfiKyberPreKeyStoreStruct;
static_assert_64bit(offsetof(SignalFfiKyberPreKeyStoreStruct, ctx) == 0);
static_assert_64bit(offsetof(SignalFfiKyberPreKeyStoreStruct, load_kyber_pre_key) == 8);
static_assert_64bit(offsetof(SignalFfiKyberPreKeyStoreStruct, store_kyber_pre_key) == 16);
static_assert_64bit(offsetof(SignalFfiKyberPreKeyStoreStruct, mark_kyber_pre_key_used) == 24);
static_assert_64bit(offsetof(SignalFfiKyberPreKeyStoreStruct, destroy) == 32);
static_assert_64bit(sizeof(SignalFfiKyberPreKeyStoreStruct) == 40);
static_assert_64bit(alignof(SignalFfiKyberPreKeyStoreStruct) == 8);
typedef const SignalFfiKyberPreKeyStoreStruct* SignalType_ConstPointer_SignalFfiKyberPreKeyStoreStruct;
static_assert_64bit(sizeof(SignalType_ConstPointer_SignalFfiKyberPreKeyStoreStruct) == 8);
static_assert_64bit(alignof(SignalType_ConstPointer_SignalFfiKyberPreKeyStoreStruct) == 8);
typedef struct SignalPreKeyRecord SignalPreKeyRecord;
typedef SignalPreKeyRecord* SignalType_MutPointer_SignalPreKeyRecord;
static_assert_64bit(sizeof(SignalType_MutPointer_SignalPreKeyRecord) == 8);
static_assert_64bit(alignof(SignalType_MutPointer_SignalPreKeyRecord) == 8);
typedef struct {
  SignalPreKeyRecord* raw;
} SignalMutPointerPreKeyRecord;
static_assert_64bit(offsetof(SignalMutPointerPreKeyRecord, raw) == 0);
static_assert_64bit(sizeof(SignalMutPointerPreKeyRecord) == 8);
static_assert_64bit(alignof(SignalMutPointerPreKeyRecord) == 8);
typedef SignalMutPointerPreKeyRecord* SignalType_MutPointer_SignalMutPointerPreKeyRecord;
static_assert_64bit(sizeof(SignalType_MutPointer_SignalMutPointerPreKeyRecord) == 8);
static_assert_64bit(alignof(SignalType_MutPointer_SignalMutPointerPreKeyRecord) == 8);
typedef int32_t (*SignalType_FunctionPointer_int32_t_SignalType_MutPointer_void_SignalType_MutPointer_SignalMutPointerPreKeyRecord_uint32_t)(SignalType_MutPointer_void, SignalType_MutPointer_SignalMutPointerPreKeyRecord, uint32_t);
static_assert_64bit(sizeof(SignalType_FunctionPointer_int32_t_SignalType_MutPointer_void_SignalType_MutPointer_SignalMutPointerPreKeyRecord_uint32_t) == 8);
static_assert_64bit(alignof(SignalType_FunctionPointer_int32_t_SignalType_MutPointer_void_SignalType_MutPointer_SignalMutPointerPreKeyRecord_uint32_t) == 8);
typedef int32_t (*SignalType_FunctionPointer_int32_t_SignalType_MutPointer_void_uint32_t)(SignalType_MutPointer_void, uint32_t);
static_assert_64bit(sizeof(SignalType_FunctionPointer_int32_t_SignalType_MutPointer_void_uint32_t) == 8);
static_assert_64bit(alignof(SignalType_FunctionPointer_int32_t_SignalType_MutPointer_void_uint32_t) == 8);
typedef int32_t (*SignalType_FunctionPointer_int32_t_SignalType_MutPointer_void_uint32_t_SignalMutPointerPreKeyRecord)(SignalType_MutPointer_void, uint32_t, SignalMutPointerPreKeyRecord);
static_assert_64bit(sizeof(SignalType_FunctionPointer_int32_t_SignalType_MutPointer_void_uint32_t_SignalMutPointerPreKeyRecord) == 8);
static_assert_64bit(alignof(SignalType_FunctionPointer_int32_t_SignalType_MutPointer_void_uint32_t_SignalMutPointerPreKeyRecord) == 8);
typedef struct {
  void* ctx;
  SignalType_FunctionPointer_int32_t_SignalType_MutPointer_void_SignalType_MutPointer_SignalMutPointerPreKeyRecord_uint32_t load_pre_key;
  SignalType_FunctionPointer_int32_t_SignalType_MutPointer_void_uint32_t_SignalMutPointerPreKeyRecord store_pre_key;
  SignalType_FunctionPointer_int32_t_SignalType_MutPointer_void_uint32_t remove_pre_key;
  SignalType_FunctionPointer_void_SignalType_MutPointer_void destroy;
} SignalFfiPreKeyStoreStruct;
static_assert_64bit(offsetof(SignalFfiPreKeyStoreStruct, ctx) == 0);
static_assert_64bit(offsetof(SignalFfiPreKeyStoreStruct, load_pre_key) == 8);
static_assert_64bit(offsetof(SignalFfiPreKeyStoreStruct, store_pre_key) == 16);
static_assert_64bit(offsetof(SignalFfiPreKeyStoreStruct, remove_pre_key) == 24);
static_assert_64bit(offsetof(SignalFfiPreKeyStoreStruct, destroy) == 32);
static_assert_64bit(sizeof(SignalFfiPreKeyStoreStruct) == 40);
static_assert_64bit(alignof(SignalFfiPreKeyStoreStruct) == 8);
typedef const SignalFfiPreKeyStoreStruct* SignalType_ConstPointer_SignalFfiPreKeyStoreStruct;
static_assert_64bit(sizeof(SignalType_ConstPointer_SignalFfiPreKeyStoreStruct) == 8);
static_assert_64bit(alignof(SignalType_ConstPointer_SignalFfiPreKeyStoreStruct) == 8);
typedef struct SignalSenderKeyRecord SignalSenderKeyRecord;
typedef SignalSenderKeyRecord* SignalType_MutPointer_SignalSenderKeyRecord;
static_assert_64bit(sizeof(SignalType_MutPointer_SignalSenderKeyRecord) == 8);
static_assert_64bit(alignof(SignalType_MutPointer_SignalSenderKeyRecord) == 8);
typedef struct {
  SignalSenderKeyRecord* raw;
} SignalMutPointerSenderKeyRecord;
static_assert_64bit(offsetof(SignalMutPointerSenderKeyRecord, raw) == 0);
static_assert_64bit(sizeof(SignalMutPointerSenderKeyRecord) == 8);
static_assert_64bit(alignof(SignalMutPointerSenderKeyRecord) == 8);
typedef SignalMutPointerSenderKeyRecord* SignalType_MutPointer_SignalMutPointerSenderKeyRecord;
static_assert_64bit(sizeof(SignalType_MutPointer_SignalMutPointerSenderKeyRecord) == 8);
static_assert_64bit(alignof(SignalType_MutPointer_SignalMutPointerSenderKeyRecord) == 8);
typedef int32_t (*SignalType_FunctionPointer_int32_t_SignalType_MutPointer_void_SignalType_MutPointer_SignalMutPointerSenderKeyRecord_SignalMutPointerProtocolAddress_SignalUuid)(SignalType_MutPointer_void, SignalType_MutPointer_SignalMutPointerSenderKeyRecord, SignalMutPointerProtocolAddress, SignalUuid);
static_assert_64bit(sizeof(SignalType_FunctionPointer_int32_t_SignalType_MutPointer_void_SignalType_MutPointer_SignalMutPointerSenderKeyRecord_SignalMutPointerProtocolAddress_SignalUuid) == 8);
static_assert_64bit(alignof(SignalType_FunctionPointer_int32_t_SignalType_MutPointer_void_SignalType_MutPointer_SignalMutPointerSenderKeyRecord_SignalMutPointerProtocolAddress_SignalUuid) == 8);
typedef int32_t (*SignalType_FunctionPointer_int32_t_SignalType_MutPointer_void_SignalMutPointerProtocolAddress_SignalUuid_SignalMutPointerSenderKeyRecord)(SignalType_MutPointer_void, SignalMutPointerProtocolAddress, SignalUuid, SignalMutPointerSenderKeyRecord);
static_assert_64bit(sizeof(SignalType_FunctionPointer_int32_t_SignalType_MutPointer_void_SignalMutPointerProtocolAddress_SignalUuid_SignalMutPointerSenderKeyRecord) == 8);
static_assert_64bit(alignof(SignalType_FunctionPointer_int32_t_SignalType_MutPointer_void_SignalMutPointerProtocolAddress_SignalUuid_SignalMutPointerSenderKeyRecord) == 8);
typedef struct {
  void* ctx;
  SignalType_FunctionPointer_int32_t_SignalType_MutPointer_void_SignalType_MutPointer_SignalMutPointerSenderKeyRecord_SignalMutPointerProtocolAddress_SignalUuid load_sender_key;
  SignalType_FunctionPointer_int32_t_SignalType_MutPointer_void_SignalMutPointerProtocolAddress_SignalUuid_SignalMutPointerSenderKeyRecord store_sender_key;
  SignalType_FunctionPointer_void_SignalType_MutPointer_void destroy;
} SignalFfiSenderKeyStoreStruct;
static_assert_64bit(offsetof(SignalFfiSenderKeyStoreStruct, ctx) == 0);
static_assert_64bit(offsetof(SignalFfiSenderKeyStoreStruct, load_sender_key) == 8);
static_assert_64bit(offsetof(SignalFfiSenderKeyStoreStruct, store_sender_key) == 16);
static_assert_64bit(offsetof(SignalFfiSenderKeyStoreStruct, destroy) == 24);
static_assert_64bit(sizeof(SignalFfiSenderKeyStoreStruct) == 32);
static_assert_64bit(alignof(SignalFfiSenderKeyStoreStruct) == 8);
typedef const SignalFfiSenderKeyStoreStruct* SignalType_ConstPointer_SignalFfiSenderKeyStoreStruct;
static_assert_64bit(sizeof(SignalType_ConstPointer_SignalFfiSenderKeyStoreStruct) == 8);
static_assert_64bit(alignof(SignalType_ConstPointer_SignalFfiSenderKeyStoreStruct) == 8);
typedef SignalSessionRecord* SignalType_MutPointer_SignalSessionRecord;
static_assert_64bit(sizeof(SignalType_MutPointer_SignalSessionRecord) == 8);
static_assert_64bit(alignof(SignalType_MutPointer_SignalSessionRecord) == 8);
typedef struct {
  SignalSessionRecord* raw;
} SignalMutPointerSessionRecord;
static_assert_64bit(offsetof(SignalMutPointerSessionRecord, raw) == 0);
static_assert_64bit(sizeof(SignalMutPointerSessionRecord) == 8);
static_assert_64bit(alignof(SignalMutPointerSessionRecord) == 8);
typedef SignalMutPointerSessionRecord* SignalType_MutPointer_SignalMutPointerSessionRecord;
static_assert_64bit(sizeof(SignalType_MutPointer_SignalMutPointerSessionRecord) == 8);
static_assert_64bit(alignof(SignalType_MutPointer_SignalMutPointerSessionRecord) == 8);
typedef int32_t (*SignalType_FunctionPointer_int32_t_SignalType_MutPointer_void_SignalType_MutPointer_SignalMutPointerSessionRecord_SignalMutPointerProtocolAddress)(SignalType_MutPointer_void, SignalType_MutPointer_SignalMutPointerSessionRecord, SignalMutPointerProtocolAddress);
static_assert_64bit(sizeof(SignalType_FunctionPointer_int32_t_SignalType_MutPointer_void_SignalType_MutPointer_SignalMutPointerSessionRecord_SignalMutPointerProtocolAddress) == 8);
static_assert_64bit(alignof(SignalType_FunctionPointer_int32_t_SignalType_MutPointer_void_SignalType_MutPointer_SignalMutPointerSessionRecord_SignalMutPointerProtocolAddress) == 8);
typedef int32_t (*SignalType_FunctionPointer_int32_t_SignalType_MutPointer_void_SignalMutPointerProtocolAddress_SignalMutPointerSessionRecord)(SignalType_MutPointer_void, SignalMutPointerProtocolAddress, SignalMutPointerSessionRecord);
static_assert_64bit(sizeof(SignalType_FunctionPointer_int32_t_SignalType_MutPointer_void_SignalMutPointerProtocolAddress_SignalMutPointerSessionRecord) == 8);
static_assert_64bit(alignof(SignalType_FunctionPointer_int32_t_SignalType_MutPointer_void_SignalMutPointerProtocolAddress_SignalMutPointerSessionRecord) == 8);
typedef struct {
  void* ctx;
  SignalType_FunctionPointer_int32_t_SignalType_MutPointer_void_SignalType_MutPointer_SignalMutPointerSessionRecord_SignalMutPointerProtocolAddress load_session;
  SignalType_FunctionPointer_int32_t_SignalType_MutPointer_void_SignalMutPointerProtocolAddress_SignalMutPointerSessionRecord store_session;
  SignalType_FunctionPointer_void_SignalType_MutPointer_void destroy;
} SignalFfiSessionStoreStruct;
static_assert_64bit(offsetof(SignalFfiSessionStoreStruct, ctx) == 0);
static_assert_64bit(offsetof(SignalFfiSessionStoreStruct, load_session) == 8);
static_assert_64bit(offsetof(SignalFfiSessionStoreStruct, store_session) == 16);
static_assert_64bit(offsetof(SignalFfiSessionStoreStruct, destroy) == 24);
static_assert_64bit(sizeof(SignalFfiSessionStoreStruct) == 32);
static_assert_64bit(alignof(SignalFfiSessionStoreStruct) == 8);
typedef const SignalFfiSessionStoreStruct* SignalType_ConstPointer_SignalFfiSessionStoreStruct;
static_assert_64bit(sizeof(SignalType_ConstPointer_SignalFfiSessionStoreStruct) == 8);
static_assert_64bit(alignof(SignalType_ConstPointer_SignalFfiSessionStoreStruct) == 8);
typedef struct SignalSignedPreKeyRecord SignalSignedPreKeyRecord;
typedef SignalSignedPreKeyRecord* SignalType_MutPointer_SignalSignedPreKeyRecord;
static_assert_64bit(sizeof(SignalType_MutPointer_SignalSignedPreKeyRecord) == 8);
static_assert_64bit(alignof(SignalType_MutPointer_SignalSignedPreKeyRecord) == 8);
typedef struct {
  SignalSignedPreKeyRecord* raw;
} SignalMutPointerSignedPreKeyRecord;
static_assert_64bit(offsetof(SignalMutPointerSignedPreKeyRecord, raw) == 0);
static_assert_64bit(sizeof(SignalMutPointerSignedPreKeyRecord) == 8);
static_assert_64bit(alignof(SignalMutPointerSignedPreKeyRecord) == 8);
typedef SignalMutPointerSignedPreKeyRecord* SignalType_MutPointer_SignalMutPointerSignedPreKeyRecord;
static_assert_64bit(sizeof(SignalType_MutPointer_SignalMutPointerSignedPreKeyRecord) == 8);
static_assert_64bit(alignof(SignalType_MutPointer_SignalMutPointerSignedPreKeyRecord) == 8);
typedef int32_t (*SignalType_FunctionPointer_int32_t_SignalType_MutPointer_void_SignalType_MutPointer_SignalMutPointerSignedPreKeyRecord_uint32_t)(SignalType_MutPointer_void, SignalType_MutPointer_SignalMutPointerSignedPreKeyRecord, uint32_t);
static_assert_64bit(sizeof(SignalType_FunctionPointer_int32_t_SignalType_MutPointer_void_SignalType_MutPointer_SignalMutPointerSignedPreKeyRecord_uint32_t) == 8);
static_assert_64bit(alignof(SignalType_FunctionPointer_int32_t_SignalType_MutPointer_void_SignalType_MutPointer_SignalMutPointerSignedPreKeyRecord_uint32_t) == 8);
typedef int32_t (*SignalType_FunctionPointer_int32_t_SignalType_MutPointer_void_uint32_t_SignalMutPointerSignedPreKeyRecord)(SignalType_MutPointer_void, uint32_t, SignalMutPointerSignedPreKeyRecord);
static_assert_64bit(sizeof(SignalType_FunctionPointer_int32_t_SignalType_MutPointer_void_uint32_t_SignalMutPointerSignedPreKeyRecord) == 8);
static_assert_64bit(alignof(SignalType_FunctionPointer_int32_t_SignalType_MutPointer_void_uint32_t_SignalMutPointerSignedPreKeyRecord) == 8);
typedef struct {
  void* ctx;
  SignalType_FunctionPointer_int32_t_SignalType_MutPointer_void_SignalType_MutPointer_SignalMutPointerSignedPreKeyRecord_uint32_t load_signed_pre_key;
  SignalType_FunctionPointer_int32_t_SignalType_MutPointer_void_uint32_t_SignalMutPointerSignedPreKeyRecord store_signed_pre_key;
  SignalType_FunctionPointer_void_SignalType_MutPointer_void destroy;
} SignalFfiSignedPreKeyStoreStruct;
static_assert_64bit(offsetof(SignalFfiSignedPreKeyStoreStruct, ctx) == 0);
static_assert_64bit(offsetof(SignalFfiSignedPreKeyStoreStruct, load_signed_pre_key) == 8);
static_assert_64bit(offsetof(SignalFfiSignedPreKeyStoreStruct, store_signed_pre_key) == 16);
static_assert_64bit(offsetof(SignalFfiSignedPreKeyStoreStruct, destroy) == 24);
static_assert_64bit(sizeof(SignalFfiSignedPreKeyStoreStruct) == 32);
static_assert_64bit(alignof(SignalFfiSignedPreKeyStoreStruct) == 8);
typedef const SignalFfiSignedPreKeyStoreStruct* SignalType_ConstPointer_SignalFfiSignedPreKeyStoreStruct;
static_assert_64bit(sizeof(SignalType_ConstPointer_SignalFfiSignedPreKeyStoreStruct) == 8);
static_assert_64bit(alignof(SignalType_ConstPointer_SignalFfiSignedPreKeyStoreStruct) == 8);
typedef struct SignalSgxClientState SignalSgxClientState;
typedef const SignalSgxClientState* SignalType_ConstPointer_SignalSgxClientState;
static_assert_64bit(sizeof(SignalType_ConstPointer_SignalSgxClientState) == 8);
static_assert_64bit(alignof(SignalType_ConstPointer_SignalSgxClientState) == 8);
typedef struct SignalBridgedStringMap SignalBridgedStringMap;
typedef const SignalBridgedStringMap* SignalType_ConstPointer_SignalBridgedStringMap;
static_assert_64bit(sizeof(SignalType_ConstPointer_SignalBridgedStringMap) == 8);
static_assert_64bit(alignof(SignalType_ConstPointer_SignalBridgedStringMap) == 8);
typedef const SignalPrivateKey* SignalType_ConstPointer_SignalPrivateKey;
static_assert_64bit(sizeof(SignalType_ConstPointer_SignalPrivateKey) == 8);
static_assert_64bit(alignof(SignalType_ConstPointer_SignalPrivateKey) == 8);
typedef struct SignalChatConnectionInfo SignalChatConnectionInfo;
typedef const SignalChatConnectionInfo* SignalType_ConstPointer_SignalChatConnectionInfo;
static_assert_64bit(sizeof(SignalType_ConstPointer_SignalChatConnectionInfo) == 8);
static_assert_64bit(alignof(SignalType_ConstPointer_SignalChatConnectionInfo) == 8);
typedef const SignalBackupRestoreResponse* SignalType_ConstPointer_SignalBackupRestoreResponse;
static_assert_64bit(sizeof(SignalType_ConstPointer_SignalBackupRestoreResponse) == 8);
static_assert_64bit(alignof(SignalType_ConstPointer_SignalBackupRestoreResponse) == 8);
typedef const SignalBackupStoreResponse* SignalType_ConstPointer_SignalBackupStoreResponse;
static_assert_64bit(sizeof(SignalType_ConstPointer_SignalBackupStoreResponse) == 8);
static_assert_64bit(alignof(SignalType_ConstPointer_SignalBackupStoreResponse) == 8);
typedef const SignalRegisterAccountResponse* SignalType_ConstPointer_SignalRegisterAccountResponse;
static_assert_64bit(sizeof(SignalType_ConstPointer_SignalRegisterAccountResponse) == 8);
static_assert_64bit(alignof(SignalType_ConstPointer_SignalRegisterAccountResponse) == 8);
typedef struct SignalRegistrationSession SignalRegistrationSession;
typedef const SignalRegistrationSession* SignalType_ConstPointer_SignalRegistrationSession;
static_assert_64bit(sizeof(SignalType_ConstPointer_SignalRegistrationSession) == 8);
static_assert_64bit(alignof(SignalType_ConstPointer_SignalRegistrationSession) == 8);
typedef struct SignalConnectionProxyConfig SignalConnectionProxyConfig;
typedef const SignalConnectionProxyConfig* SignalType_ConstPointer_SignalConnectionProxyConfig;
static_assert_64bit(sizeof(SignalType_ConstPointer_SignalConnectionProxyConfig) == 8);
static_assert_64bit(alignof(SignalType_ConstPointer_SignalConnectionProxyConfig) == 8);
typedef struct SignalFingerprint SignalFingerprint;
typedef const SignalFingerprint* SignalType_ConstPointer_SignalFingerprint;
static_assert_64bit(sizeof(SignalType_ConstPointer_SignalFingerprint) == 8);
static_assert_64bit(alignof(SignalType_ConstPointer_SignalFingerprint) == 8);
typedef struct SignalKyberPublicKey SignalKyberPublicKey;
typedef const SignalKyberPublicKey* SignalType_ConstPointer_SignalKyberPublicKey;
static_assert_64bit(sizeof(SignalType_ConstPointer_SignalKyberPublicKey) == 8);
static_assert_64bit(alignof(SignalType_ConstPointer_SignalKyberPublicKey) == 8);
typedef struct SignalKyberSecretKey SignalKyberSecretKey;
typedef const SignalKyberSecretKey* SignalType_ConstPointer_SignalKyberSecretKey;
static_assert_64bit(sizeof(SignalType_ConstPointer_SignalKyberSecretKey) == 8);
static_assert_64bit(alignof(SignalType_ConstPointer_SignalKyberSecretKey) == 8);
typedef struct SignalKyberKeyPair SignalKyberKeyPair;
typedef const SignalKyberKeyPair* SignalType_ConstPointer_SignalKyberKeyPair;
static_assert_64bit(sizeof(SignalType_ConstPointer_SignalKyberKeyPair) == 8);
static_assert_64bit(alignof(SignalType_ConstPointer_SignalKyberKeyPair) == 8);
typedef struct SignalDecryptionErrorMessage SignalDecryptionErrorMessage;
typedef const SignalDecryptionErrorMessage* SignalType_ConstPointer_SignalDecryptionErrorMessage;
static_assert_64bit(sizeof(SignalType_ConstPointer_SignalDecryptionErrorMessage) == 8);
static_assert_64bit(alignof(SignalType_ConstPointer_SignalDecryptionErrorMessage) == 8);
typedef struct SignalPlaintextContent SignalPlaintextContent;
typedef const SignalPlaintextContent* SignalType_ConstPointer_SignalPlaintextContent;
static_assert_64bit(sizeof(SignalType_ConstPointer_SignalPlaintextContent) == 8);
static_assert_64bit(alignof(SignalType_ConstPointer_SignalPlaintextContent) == 8);
typedef struct SignalPreKeySignalMessage SignalPreKeySignalMessage;
typedef const SignalPreKeySignalMessage* SignalType_ConstPointer_SignalPreKeySignalMessage;
static_assert_64bit(sizeof(SignalType_ConstPointer_SignalPreKeySignalMessage) == 8);
static_assert_64bit(alignof(SignalType_ConstPointer_SignalPreKeySignalMessage) == 8);
typedef struct SignalSenderKeyDistributionMessage SignalSenderKeyDistributionMessage;
typedef const SignalSenderKeyDistributionMessage* SignalType_ConstPointer_SignalSenderKeyDistributionMessage;
static_assert_64bit(sizeof(SignalType_ConstPointer_SignalSenderKeyDistributionMessage) == 8);
static_assert_64bit(alignof(SignalType_ConstPointer_SignalSenderKeyDistributionMessage) == 8);
typedef struct SignalSenderKeyMessage SignalSenderKeyMessage;
typedef const SignalSenderKeyMessage* SignalType_ConstPointer_SignalSenderKeyMessage;
static_assert_64bit(sizeof(SignalType_ConstPointer_SignalSenderKeyMessage) == 8);
static_assert_64bit(alignof(SignalType_ConstPointer_SignalSenderKeyMessage) == 8);
typedef struct SignalSignalMessage SignalSignalMessage;
typedef const SignalSignalMessage* SignalType_ConstPointer_SignalSignalMessage;
static_assert_64bit(sizeof(SignalType_ConstPointer_SignalSignalMessage) == 8);
static_assert_64bit(alignof(SignalType_ConstPointer_SignalSignalMessage) == 8);
typedef struct SignalSenderCertificate SignalSenderCertificate;
typedef const SignalSenderCertificate* SignalType_ConstPointer_SignalSenderCertificate;
static_assert_64bit(sizeof(SignalType_ConstPointer_SignalSenderCertificate) == 8);
static_assert_64bit(alignof(SignalType_ConstPointer_SignalSenderCertificate) == 8);
typedef struct SignalServerCertificate SignalServerCertificate;
typedef const SignalServerCertificate* SignalType_ConstPointer_SignalServerCertificate;
static_assert_64bit(sizeof(SignalType_ConstPointer_SignalServerCertificate) == 8);
static_assert_64bit(alignof(SignalType_ConstPointer_SignalServerCertificate) == 8);
typedef struct SignalUnidentifiedSenderMessageContent SignalUnidentifiedSenderMessageContent;
typedef const SignalUnidentifiedSenderMessageContent* SignalType_ConstPointer_SignalUnidentifiedSenderMessageContent;
static_assert_64bit(sizeof(SignalType_ConstPointer_SignalUnidentifiedSenderMessageContent) == 8);
static_assert_64bit(alignof(SignalType_ConstPointer_SignalUnidentifiedSenderMessageContent) == 8);
typedef const SignalSenderKeyRecord* SignalType_ConstPointer_SignalSenderKeyRecord;
static_assert_64bit(sizeof(SignalType_ConstPointer_SignalSenderKeyRecord) == 8);
static_assert_64bit(alignof(SignalType_ConstPointer_SignalSenderKeyRecord) == 8);
typedef const SignalPreKeyBundle* SignalType_ConstPointer_SignalPreKeyBundle;
static_assert_64bit(sizeof(SignalType_ConstPointer_SignalPreKeyBundle) == 8);
static_assert_64bit(alignof(SignalType_ConstPointer_SignalPreKeyBundle) == 8);
typedef const SignalKyberPreKeyRecord* SignalType_ConstPointer_SignalKyberPreKeyRecord;
static_assert_64bit(sizeof(SignalType_ConstPointer_SignalKyberPreKeyRecord) == 8);
static_assert_64bit(alignof(SignalType_ConstPointer_SignalKyberPreKeyRecord) == 8);
typedef const SignalPreKeyRecord* SignalType_ConstPointer_SignalPreKeyRecord;
static_assert_64bit(sizeof(SignalType_ConstPointer_SignalPreKeyRecord) == 8);
static_assert_64bit(alignof(SignalType_ConstPointer_SignalPreKeyRecord) == 8);
typedef const SignalSignedPreKeyRecord* SignalType_ConstPointer_SignalSignedPreKeyRecord;
static_assert_64bit(sizeof(SignalType_ConstPointer_SignalSignedPreKeyRecord) == 8);
static_assert_64bit(alignof(SignalType_ConstPointer_SignalSignedPreKeyRecord) == 8);
typedef const uint32_t* SignalType_ConstPointer_uint32_t;
static_assert_64bit(sizeof(SignalType_ConstPointer_uint32_t) == 8);
static_assert_64bit(alignof(SignalType_ConstPointer_uint32_t) == 8);
typedef const size_t* SignalType_ConstPointer_size_t;
static_assert_64bit(sizeof(SignalType_ConstPointer_size_t) == 8);
static_assert_64bit(alignof(SignalType_ConstPointer_size_t) == 8);
typedef struct SignalServerPublicParams SignalServerPublicParams;
typedef const SignalServerPublicParams* SignalType_ConstPointer_SignalServerPublicParams;
static_assert_64bit(sizeof(SignalType_ConstPointer_SignalServerPublicParams) == 8);
static_assert_64bit(alignof(SignalType_ConstPointer_SignalServerPublicParams) == 8);
typedef struct SignalServerSecretParams SignalServerSecretParams;
typedef const SignalServerSecretParams* SignalType_ConstPointer_SignalServerSecretParams;
static_assert_64bit(sizeof(SignalType_ConstPointer_SignalServerSecretParams) == 8);
static_assert_64bit(alignof(SignalType_ConstPointer_SignalServerSecretParams) == 8);
typedef SignalType_FixedArray129_uint8_t* SignalType_MutPointer_SignalType_FixedArray129_uint8_t;
static_assert_64bit(sizeof(SignalType_MutPointer_SignalType_FixedArray129_uint8_t) == 8);
static_assert_64bit(alignof(SignalType_MutPointer_SignalType_FixedArray129_uint8_t) == 8);
typedef SignalType_FixedArray153_uint8_t* SignalType_MutPointer_SignalType_FixedArray153_uint8_t;
static_assert_64bit(sizeof(SignalType_MutPointer_SignalType_FixedArray153_uint8_t) == 8);
static_assert_64bit(alignof(SignalType_MutPointer_SignalType_FixedArray153_uint8_t) == 8);
typedef SignalType_FixedArray15_uint8_t* SignalType_MutPointer_SignalType_FixedArray15_uint8_t;
static_assert_64bit(sizeof(SignalType_MutPointer_SignalType_FixedArray15_uint8_t) == 8);
static_assert_64bit(alignof(SignalType_MutPointer_SignalType_FixedArray15_uint8_t) == 8);
typedef SignalType_FixedArray16_uint8_t* SignalType_MutPointer_SignalType_FixedArray16_uint8_t;
static_assert_64bit(sizeof(SignalType_MutPointer_SignalType_FixedArray16_uint8_t) == 8);
static_assert_64bit(alignof(SignalType_MutPointer_SignalType_FixedArray16_uint8_t) == 8);
typedef SignalType_FixedArray177_uint8_t* SignalType_MutPointer_SignalType_FixedArray177_uint8_t;
static_assert_64bit(sizeof(SignalType_MutPointer_SignalType_FixedArray177_uint8_t) == 8);
static_assert_64bit(alignof(SignalType_MutPointer_SignalType_FixedArray177_uint8_t) == 8);
typedef SignalType_FixedArray289_uint8_t* SignalType_MutPointer_SignalType_FixedArray289_uint8_t;
static_assert_64bit(sizeof(SignalType_MutPointer_SignalType_FixedArray289_uint8_t) == 8);
static_assert_64bit(alignof(SignalType_MutPointer_SignalType_FixedArray289_uint8_t) == 8);
typedef SignalType_FixedArray329_uint8_t* SignalType_MutPointer_SignalType_FixedArray329_uint8_t;
static_assert_64bit(sizeof(SignalType_MutPointer_SignalType_FixedArray329_uint8_t) == 8);
static_assert_64bit(alignof(SignalType_MutPointer_SignalType_FixedArray329_uint8_t) == 8);
typedef SignalType_FixedArray32_uint8_t* SignalType_MutPointer_SignalType_FixedArray32_uint8_t;
static_assert_64bit(sizeof(SignalType_MutPointer_SignalType_FixedArray32_uint8_t) == 8);
static_assert_64bit(alignof(SignalType_MutPointer_SignalType_FixedArray32_uint8_t) == 8);
typedef SignalType_FixedArray409_uint8_t* SignalType_MutPointer_SignalType_FixedArray409_uint8_t;
static_assert_64bit(sizeof(SignalType_MutPointer_SignalType_FixedArray409_uint8_t) == 8);
static_assert_64bit(alignof(SignalType_MutPointer_SignalType_FixedArray409_uint8_t) == 8);
typedef SignalType_FixedArray473_uint8_t* SignalType_MutPointer_SignalType_FixedArray473_uint8_t;
static_assert_64bit(sizeof(SignalType_MutPointer_SignalType_FixedArray473_uint8_t) == 8);
static_assert_64bit(alignof(SignalType_MutPointer_SignalType_FixedArray473_uint8_t) == 8);
typedef SignalType_FixedArray497_uint8_t* SignalType_MutPointer_SignalType_FixedArray497_uint8_t;
static_assert_64bit(sizeof(SignalType_MutPointer_SignalType_FixedArray497_uint8_t) == 8);
static_assert_64bit(alignof(SignalType_MutPointer_SignalType_FixedArray497_uint8_t) == 8);
typedef SignalType_FixedArray64_uint8_t* SignalType_MutPointer_SignalType_FixedArray64_uint8_t;
static_assert_64bit(sizeof(SignalType_MutPointer_SignalType_FixedArray64_uint8_t) == 8);
static_assert_64bit(alignof(SignalType_MutPointer_SignalType_FixedArray64_uint8_t) == 8);
typedef SignalType_FixedArray65_uint8_t* SignalType_MutPointer_SignalType_FixedArray65_uint8_t;
static_assert_64bit(sizeof(SignalType_MutPointer_SignalType_FixedArray65_uint8_t) == 8);
static_assert_64bit(alignof(SignalType_MutPointer_SignalType_FixedArray65_uint8_t) == 8);
typedef SignalType_FixedArray97_uint8_t* SignalType_MutPointer_SignalType_FixedArray97_uint8_t;
static_assert_64bit(sizeof(SignalType_MutPointer_SignalType_FixedArray97_uint8_t) == 8);
static_assert_64bit(alignof(SignalType_MutPointer_SignalType_FixedArray97_uint8_t) == 8);
typedef int32_t* SignalType_MutPointer_int32_t;
static_assert_64bit(sizeof(SignalType_MutPointer_int32_t) == 8);
static_assert_64bit(alignof(SignalType_MutPointer_int32_t) == 8);
typedef SignalPinHash* SignalType_MutPointer_SignalPinHash;
static_assert_64bit(sizeof(SignalType_MutPointer_SignalPinHash) == 8);
static_assert_64bit(alignof(SignalType_MutPointer_SignalPinHash) == 8);
typedef struct SignalAes256GcmDecryption SignalAes256GcmDecryption;
typedef SignalAes256GcmDecryption* SignalType_MutPointer_SignalAes256GcmDecryption;
static_assert_64bit(sizeof(SignalType_MutPointer_SignalAes256GcmDecryption) == 8);
static_assert_64bit(alignof(SignalType_MutPointer_SignalAes256GcmDecryption) == 8);
typedef struct SignalAes256GcmEncryption SignalAes256GcmEncryption;
typedef SignalAes256GcmEncryption* SignalType_MutPointer_SignalAes256GcmEncryption;
static_assert_64bit(sizeof(SignalType_MutPointer_SignalAes256GcmEncryption) == 8);
static_assert_64bit(alignof(SignalType_MutPointer_SignalAes256GcmEncryption) == 8);
typedef SignalAes256GcmSiv* SignalType_MutPointer_SignalAes256GcmSiv;
static_assert_64bit(sizeof(SignalType_MutPointer_SignalAes256GcmSiv) == 8);
static_assert_64bit(alignof(SignalType_MutPointer_SignalAes256GcmSiv) == 8);
typedef SignalBytestringArray* SignalType_MutPointer_SignalBytestringArray;
static_assert_64bit(sizeof(SignalType_MutPointer_SignalBytestringArray) == 8);
static_assert_64bit(alignof(SignalType_MutPointer_SignalBytestringArray) == 8);
typedef struct {
  uint32_t* base;
  size_t length;
} SignalOwnedBufferOfu32;
static_assert_64bit(offsetof(SignalOwnedBufferOfu32, base) == 0);
static_assert_64bit(offsetof(SignalOwnedBufferOfu32, length) == 8);
static_assert_64bit(sizeof(SignalOwnedBufferOfu32) == 16);
static_assert_64bit(alignof(SignalOwnedBufferOfu32) == 8);
typedef struct {
  SignalType_FixedArray17_uint8_t account;
  SignalOwnedBufferOfu32 missing_devices;
  SignalOwnedBufferOfu32 extra_devices;
  SignalOwnedBufferOfu32 stale_devices;
} SignalFfiMismatchedDevicesError;
static_assert_64bit(offsetof(SignalFfiMismatchedDevicesError, account) == 0);
static_assert_64bit(offsetof(SignalFfiMismatchedDevicesError, missing_devices) == 24);
static_assert_64bit(offsetof(SignalFfiMismatchedDevicesError, extra_devices) == 40);
static_assert_64bit(offsetof(SignalFfiMismatchedDevicesError, stale_devices) == 56);
static_assert_64bit(sizeof(SignalFfiMismatchedDevicesError) == 72);
static_assert_64bit(alignof(SignalFfiMismatchedDevicesError) == 8);
typedef SignalFfiMismatchedDevicesError* SignalType_MutPointer_SignalFfiMismatchedDevicesError;
static_assert_64bit(sizeof(SignalType_MutPointer_SignalFfiMismatchedDevicesError) == 8);
static_assert_64bit(alignof(SignalType_MutPointer_SignalFfiMismatchedDevicesError) == 8);
static_assert_64bit(sizeof(double) == 8);
static_assert_64bit(alignof(double) == 8);
typedef struct {
  const int8_t* id;
  bool visible;
  double expiration_secs;
} SignalFfiRegisterResponseBadge;
static_assert_64bit(offsetof(SignalFfiRegisterResponseBadge, id) == 0);
static_assert_64bit(offsetof(SignalFfiRegisterResponseBadge, visible) == 8);
static_assert_64bit(offsetof(SignalFfiRegisterResponseBadge, expiration_secs) == 16);
static_assert_64bit(sizeof(SignalFfiRegisterResponseBadge) == 24);
static_assert_64bit(alignof(SignalFfiRegisterResponseBadge) == 8);
typedef SignalFfiRegisterResponseBadge* SignalType_MutPointer_SignalFfiRegisterResponseBadge;
static_assert_64bit(sizeof(SignalType_MutPointer_SignalFfiRegisterResponseBadge) == 8);
static_assert_64bit(alignof(SignalType_MutPointer_SignalFfiRegisterResponseBadge) == 8);
typedef struct {
  SignalPinHash* raw;
} SignalMutPointerPinHash;
static_assert_64bit(offsetof(SignalMutPointerPinHash, raw) == 0);
static_assert_64bit(sizeof(SignalMutPointerPinHash) == 8);
static_assert_64bit(alignof(SignalMutPointerPinHash) == 8);
typedef SignalMutPointerPinHash* SignalType_MutPointer_SignalMutPointerPinHash;
static_assert_64bit(sizeof(SignalType_MutPointer_SignalMutPointerPinHash) == 8);
static_assert_64bit(alignof(SignalType_MutPointer_SignalMutPointerPinHash) == 8);
typedef struct {
  SignalAes256GcmDecryption* raw;
} SignalMutPointerAes256GcmDecryption;
static_assert_64bit(offsetof(SignalMutPointerAes256GcmDecryption, raw) == 0);
static_assert_64bit(sizeof(SignalMutPointerAes256GcmDecryption) == 8);
static_assert_64bit(alignof(SignalMutPointerAes256GcmDecryption) == 8);
typedef SignalMutPointerAes256GcmDecryption* SignalType_MutPointer_SignalMutPointerAes256GcmDecryption;
static_assert_64bit(sizeof(SignalType_MutPointer_SignalMutPointerAes256GcmDecryption) == 8);
static_assert_64bit(alignof(SignalType_MutPointer_SignalMutPointerAes256GcmDecryption) == 8);
typedef struct {
  SignalAes256GcmEncryption* raw;
} SignalMutPointerAes256GcmEncryption;
static_assert_64bit(offsetof(SignalMutPointerAes256GcmEncryption, raw) == 0);
static_assert_64bit(sizeof(SignalMutPointerAes256GcmEncryption) == 8);
static_assert_64bit(alignof(SignalMutPointerAes256GcmEncryption) == 8);
typedef SignalMutPointerAes256GcmEncryption* SignalType_MutPointer_SignalMutPointerAes256GcmEncryption;
static_assert_64bit(sizeof(SignalType_MutPointer_SignalMutPointerAes256GcmEncryption) == 8);
static_assert_64bit(alignof(SignalType_MutPointer_SignalMutPointerAes256GcmEncryption) == 8);
typedef struct {
  SignalAes256GcmSiv* raw;
} SignalMutPointerAes256GcmSiv;
static_assert_64bit(offsetof(SignalMutPointerAes256GcmSiv, raw) == 0);
static_assert_64bit(sizeof(SignalMutPointerAes256GcmSiv) == 8);
static_assert_64bit(alignof(SignalMutPointerAes256GcmSiv) == 8);
typedef SignalMutPointerAes256GcmSiv* SignalType_MutPointer_SignalMutPointerAes256GcmSiv;
static_assert_64bit(sizeof(SignalType_MutPointer_SignalMutPointerAes256GcmSiv) == 8);
static_assert_64bit(alignof(SignalType_MutPointer_SignalMutPointerAes256GcmSiv) == 8);
typedef SignalHsmEnclaveClient* SignalType_MutPointer_SignalHsmEnclaveClient;
static_assert_64bit(sizeof(SignalType_MutPointer_SignalHsmEnclaveClient) == 8);
static_assert_64bit(alignof(SignalType_MutPointer_SignalHsmEnclaveClient) == 8);
typedef struct {
  SignalHsmEnclaveClient* raw;
} SignalMutPointerHsmEnclaveClient;
static_assert_64bit(offsetof(SignalMutPointerHsmEnclaveClient, raw) == 0);
static_assert_64bit(sizeof(SignalMutPointerHsmEnclaveClient) == 8);
static_assert_64bit(alignof(SignalMutPointerHsmEnclaveClient) == 8);
typedef SignalMutPointerHsmEnclaveClient* SignalType_MutPointer_SignalMutPointerHsmEnclaveClient;
static_assert_64bit(sizeof(SignalType_MutPointer_SignalMutPointerHsmEnclaveClient) == 8);
static_assert_64bit(alignof(SignalType_MutPointer_SignalMutPointerHsmEnclaveClient) == 8);
typedef struct SignalIncrementalMac SignalIncrementalMac;
typedef SignalIncrementalMac* SignalType_MutPointer_SignalIncrementalMac;
static_assert_64bit(sizeof(SignalType_MutPointer_SignalIncrementalMac) == 8);
static_assert_64bit(alignof(SignalType_MutPointer_SignalIncrementalMac) == 8);
typedef struct {
  SignalIncrementalMac* raw;
} SignalMutPointerIncrementalMac;
static_assert_64bit(offsetof(SignalMutPointerIncrementalMac, raw) == 0);
static_assert_64bit(sizeof(SignalMutPointerIncrementalMac) == 8);
static_assert_64bit(alignof(SignalMutPointerIncrementalMac) == 8);
typedef SignalMutPointerIncrementalMac* SignalType_MutPointer_SignalMutPointerIncrementalMac;
static_assert_64bit(sizeof(SignalType_MutPointer_SignalMutPointerIncrementalMac) == 8);
static_assert_64bit(alignof(SignalType_MutPointer_SignalMutPointerIncrementalMac) == 8);
typedef struct SignalValidatingMac SignalValidatingMac;
typedef SignalValidatingMac* SignalType_MutPointer_SignalValidatingMac;
static_assert_64bit(sizeof(SignalType_MutPointer_SignalValidatingMac) == 8);
static_assert_64bit(alignof(SignalType_MutPointer_SignalValidatingMac) == 8);
typedef struct {
  SignalValidatingMac* raw;
} SignalMutPointerValidatingMac;
static_assert_64bit(offsetof(SignalMutPointerValidatingMac, raw) == 0);
static_assert_64bit(sizeof(SignalMutPointerValidatingMac) == 8);
static_assert_64bit(alignof(SignalMutPointerValidatingMac) == 8);
typedef SignalMutPointerValidatingMac* SignalType_MutPointer_SignalMutPointerValidatingMac;
static_assert_64bit(sizeof(SignalType_MutPointer_SignalMutPointerValidatingMac) == 8);
static_assert_64bit(alignof(SignalType_MutPointer_SignalMutPointerValidatingMac) == 8);
typedef SignalMessageBackupKey* SignalType_MutPointer_SignalMessageBackupKey;
static_assert_64bit(sizeof(SignalType_MutPointer_SignalMessageBackupKey) == 8);
static_assert_64bit(alignof(SignalType_MutPointer_SignalMessageBackupKey) == 8);
typedef struct {
  SignalMessageBackupKey* raw;
} SignalMutPointerMessageBackupKey;
static_assert_64bit(offsetof(SignalMutPointerMessageBackupKey, raw) == 0);
static_assert_64bit(sizeof(SignalMutPointerMessageBackupKey) == 8);
static_assert_64bit(alignof(SignalMutPointerMessageBackupKey) == 8);
typedef SignalMutPointerMessageBackupKey* SignalType_MutPointer_SignalMutPointerMessageBackupKey;
static_assert_64bit(sizeof(SignalType_MutPointer_SignalMutPointerMessageBackupKey) == 8);
static_assert_64bit(alignof(SignalType_MutPointer_SignalMutPointerMessageBackupKey) == 8);
typedef SignalMessageBackupValidationOutcome* SignalType_MutPointer_SignalMessageBackupValidationOutcome;
static_assert_64bit(sizeof(SignalType_MutPointer_SignalMessageBackupValidationOutcome) == 8);
static_assert_64bit(alignof(SignalType_MutPointer_SignalMessageBackupValidationOutcome) == 8);
typedef struct {
  SignalMessageBackupValidationOutcome* raw;
} SignalMutPointerMessageBackupValidationOutcome;
static_assert_64bit(offsetof(SignalMutPointerMessageBackupValidationOutcome, raw) == 0);
static_assert_64bit(sizeof(SignalMutPointerMessageBackupValidationOutcome) == 8);
static_assert_64bit(alignof(SignalMutPointerMessageBackupValidationOutcome) == 8);
typedef SignalMutPointerMessageBackupValidationOutcome* SignalType_MutPointer_SignalMutPointerMessageBackupValidationOutcome;
static_assert_64bit(sizeof(SignalType_MutPointer_SignalMutPointerMessageBackupValidationOutcome) == 8);
static_assert_64bit(alignof(SignalType_MutPointer_SignalMutPointerMessageBackupValidationOutcome) == 8);
typedef struct SignalOnlineBackupValidator SignalOnlineBackupValidator;
typedef SignalOnlineBackupValidator* SignalType_MutPointer_SignalOnlineBackupValidator;
static_assert_64bit(sizeof(SignalType_MutPointer_SignalOnlineBackupValidator) == 8);
static_assert_64bit(alignof(SignalType_MutPointer_SignalOnlineBackupValidator) == 8);
typedef struct {
  SignalOnlineBackupValidator* raw;
} SignalMutPointerOnlineBackupValidator;
static_assert_64bit(offsetof(SignalMutPointerOnlineBackupValidator, raw) == 0);
static_assert_64bit(sizeof(SignalMutPointerOnlineBackupValidator) == 8);
static_assert_64bit(alignof(SignalMutPointerOnlineBackupValidator) == 8);
typedef SignalMutPointerOnlineBackupValidator* SignalType_MutPointer_SignalMutPointerOnlineBackupValidator;
static_assert_64bit(sizeof(SignalType_MutPointer_SignalMutPointerOnlineBackupValidator) == 8);
static_assert_64bit(alignof(SignalType_MutPointer_SignalMutPointerOnlineBackupValidator) == 8);
typedef SignalConnectionManager* SignalType_MutPointer_SignalConnectionManager;
static_assert_64bit(sizeof(SignalType_MutPointer_SignalConnectionManager) == 8);
static_assert_64bit(alignof(SignalType_MutPointer_SignalConnectionManager) == 8);
typedef struct {
  SignalConnectionManager* raw;
} SignalMutPointerConnectionManager;
static_assert_64bit(offsetof(SignalMutPointerConnectionManager, raw) == 0);
static_assert_64bit(sizeof(SignalMutPointerConnectionManager) == 8);
static_assert_64bit(alignof(SignalMutPointerConnectionManager) == 8);
typedef SignalMutPointerConnectionManager* SignalType_MutPointer_SignalMutPointerConnectionManager;
static_assert_64bit(sizeof(SignalType_MutPointer_SignalMutPointerConnectionManager) == 8);
static_assert_64bit(alignof(SignalType_MutPointer_SignalMutPointerConnectionManager) == 8);
typedef SignalLookupRequest* SignalType_MutPointer_SignalLookupRequest;
static_assert_64bit(sizeof(SignalType_MutPointer_SignalLookupRequest) == 8);
static_assert_64bit(alignof(SignalType_MutPointer_SignalLookupRequest) == 8);
typedef struct {
  SignalLookupRequest* raw;
} SignalMutPointerLookupRequest;
static_assert_64bit(offsetof(SignalMutPointerLookupRequest, raw) == 0);
static_assert_64bit(sizeof(SignalMutPointerLookupRequest) == 8);
static_assert_64bit(alignof(SignalMutPointerLookupRequest) == 8);
typedef SignalMutPointerLookupRequest* SignalType_MutPointer_SignalMutPointerLookupRequest;
static_assert_64bit(sizeof(SignalType_MutPointer_SignalMutPointerLookupRequest) == 8);
static_assert_64bit(alignof(SignalType_MutPointer_SignalMutPointerLookupRequest) == 8);
typedef SignalCopyBackupMediaStream* SignalType_MutPointer_SignalCopyBackupMediaStream;
static_assert_64bit(sizeof(SignalType_MutPointer_SignalCopyBackupMediaStream) == 8);
static_assert_64bit(alignof(SignalType_MutPointer_SignalCopyBackupMediaStream) == 8);
typedef struct {
  SignalCopyBackupMediaStream* raw;
} SignalMutPointerCopyBackupMediaStream;
static_assert_64bit(offsetof(SignalMutPointerCopyBackupMediaStream, raw) == 0);
static_assert_64bit(sizeof(SignalMutPointerCopyBackupMediaStream) == 8);
static_assert_64bit(alignof(SignalMutPointerCopyBackupMediaStream) == 8);
typedef SignalMutPointerCopyBackupMediaStream* SignalType_MutPointer_SignalMutPointerCopyBackupMediaStream;
static_assert_64bit(sizeof(SignalType_MutPointer_SignalMutPointerCopyBackupMediaStream) == 8);
static_assert_64bit(alignof(SignalType_MutPointer_SignalMutPointerCopyBackupMediaStream) == 8);
typedef SignalHttpRequest* SignalType_MutPointer_SignalHttpRequest;
static_assert_64bit(sizeof(SignalType_MutPointer_SignalHttpRequest) == 8);
static_assert_64bit(alignof(SignalType_MutPointer_SignalHttpRequest) == 8);
typedef struct {
  SignalHttpRequest* raw;
} SignalMutPointerHttpRequest;
static_assert_64bit(offsetof(SignalMutPointerHttpRequest, raw) == 0);
static_assert_64bit(sizeof(SignalMutPointerHttpRequest) == 8);
static_assert_64bit(alignof(SignalMutPointerHttpRequest) == 8);
typedef SignalMutPointerHttpRequest* SignalType_MutPointer_SignalMutPointerHttpRequest;
static_assert_64bit(sizeof(SignalType_MutPointer_SignalMutPointerHttpRequest) == 8);
static_assert_64bit(alignof(SignalType_MutPointer_SignalMutPointerHttpRequest) == 8);
typedef SignalRegistrationAccountAttributes* SignalType_MutPointer_SignalRegistrationAccountAttributes;
static_assert_64bit(sizeof(SignalType_MutPointer_SignalRegistrationAccountAttributes) == 8);
static_assert_64bit(alignof(SignalType_MutPointer_SignalRegistrationAccountAttributes) == 8);
typedef struct {
  SignalRegistrationAccountAttributes* raw;
} SignalMutPointerRegistrationAccountAttributes;
static_assert_64bit(offsetof(SignalMutPointerRegistrationAccountAttributes, raw) == 0);
static_assert_64bit(sizeof(SignalMutPointerRegistrationAccountAttributes) == 8);
static_assert_64bit(alignof(SignalMutPointerRegistrationAccountAttributes) == 8);
typedef SignalMutPointerRegistrationAccountAttributes* SignalType_MutPointer_SignalMutPointerRegistrationAccountAttributes;
static_assert_64bit(sizeof(SignalType_MutPointer_SignalMutPointerRegistrationAccountAttributes) == 8);
static_assert_64bit(alignof(SignalType_MutPointer_SignalMutPointerRegistrationAccountAttributes) == 8);
typedef SignalRegisterAccountRequest* SignalType_MutPointer_SignalRegisterAccountRequest;
static_assert_64bit(sizeof(SignalType_MutPointer_SignalRegisterAccountRequest) == 8);
static_assert_64bit(alignof(SignalType_MutPointer_SignalRegisterAccountRequest) == 8);
typedef struct {
  SignalRegisterAccountRequest* raw;
} SignalMutPointerRegisterAccountRequest;
static_assert_64bit(offsetof(SignalMutPointerRegisterAccountRequest, raw) == 0);
static_assert_64bit(sizeof(SignalMutPointerRegisterAccountRequest) == 8);
static_assert_64bit(alignof(SignalMutPointerRegisterAccountRequest) == 8);
typedef SignalMutPointerRegisterAccountRequest* SignalType_MutPointer_SignalMutPointerRegisterAccountRequest;
static_assert_64bit(sizeof(SignalType_MutPointer_SignalMutPointerRegisterAccountRequest) == 8);
static_assert_64bit(alignof(SignalType_MutPointer_SignalMutPointerRegisterAccountRequest) == 8);
typedef SignalTokioAsyncContext* SignalType_MutPointer_SignalTokioAsyncContext;
static_assert_64bit(sizeof(SignalType_MutPointer_SignalTokioAsyncContext) == 8);
static_assert_64bit(alignof(SignalType_MutPointer_SignalTokioAsyncContext) == 8);
typedef struct {
  SignalTokioAsyncContext* raw;
} SignalMutPointerTokioAsyncContext;
static_assert_64bit(offsetof(SignalMutPointerTokioAsyncContext, raw) == 0);
static_assert_64bit(sizeof(SignalMutPointerTokioAsyncContext) == 8);
static_assert_64bit(alignof(SignalMutPointerTokioAsyncContext) == 8);
typedef SignalMutPointerTokioAsyncContext* SignalType_MutPointer_SignalMutPointerTokioAsyncContext;
static_assert_64bit(sizeof(SignalType_MutPointer_SignalMutPointerTokioAsyncContext) == 8);
static_assert_64bit(alignof(SignalType_MutPointer_SignalMutPointerTokioAsyncContext) == 8);
typedef SignalSgxClientState* SignalType_MutPointer_SignalSgxClientState;
static_assert_64bit(sizeof(SignalType_MutPointer_SignalSgxClientState) == 8);
static_assert_64bit(alignof(SignalType_MutPointer_SignalSgxClientState) == 8);
typedef struct {
  SignalSgxClientState* raw;
} SignalMutPointerSgxClientState;
static_assert_64bit(offsetof(SignalMutPointerSgxClientState, raw) == 0);
static_assert_64bit(sizeof(SignalMutPointerSgxClientState) == 8);
static_assert_64bit(alignof(SignalMutPointerSgxClientState) == 8);
typedef SignalMutPointerSgxClientState* SignalType_MutPointer_SignalMutPointerSgxClientState;
static_assert_64bit(sizeof(SignalType_MutPointer_SignalMutPointerSgxClientState) == 8);
static_assert_64bit(alignof(SignalType_MutPointer_SignalMutPointerSgxClientState) == 8);
typedef SignalBridgedStringMap* SignalType_MutPointer_SignalBridgedStringMap;
static_assert_64bit(sizeof(SignalType_MutPointer_SignalBridgedStringMap) == 8);
static_assert_64bit(alignof(SignalType_MutPointer_SignalBridgedStringMap) == 8);
typedef struct {
  SignalBridgedStringMap* raw;
} SignalMutPointerBridgedStringMap;
static_assert_64bit(offsetof(SignalMutPointerBridgedStringMap, raw) == 0);
static_assert_64bit(sizeof(SignalMutPointerBridgedStringMap) == 8);
static_assert_64bit(alignof(SignalMutPointerBridgedStringMap) == 8);
typedef SignalMutPointerBridgedStringMap* SignalType_MutPointer_SignalMutPointerBridgedStringMap;
static_assert_64bit(sizeof(SignalType_MutPointer_SignalMutPointerBridgedStringMap) == 8);
static_assert_64bit(alignof(SignalType_MutPointer_SignalMutPointerBridgedStringMap) == 8);
typedef SignalMutPointerProtocolAddress* SignalType_MutPointer_SignalMutPointerProtocolAddress;
static_assert_64bit(sizeof(SignalType_MutPointer_SignalMutPointerProtocolAddress) == 8);
static_assert_64bit(alignof(SignalType_MutPointer_SignalMutPointerProtocolAddress) == 8);
typedef SignalMutPointerPrivateKey* SignalType_MutPointer_SignalMutPointerPrivateKey;
static_assert_64bit(sizeof(SignalType_MutPointer_SignalMutPointerPrivateKey) == 8);
static_assert_64bit(alignof(SignalType_MutPointer_SignalMutPointerPrivateKey) == 8);
typedef SignalChatConnectionInfo* SignalType_MutPointer_SignalChatConnectionInfo;
static_assert_64bit(sizeof(SignalType_MutPointer_SignalChatConnectionInfo) == 8);
static_assert_64bit(alignof(SignalType_MutPointer_SignalChatConnectionInfo) == 8);
typedef struct {
  SignalChatConnectionInfo* raw;
} SignalMutPointerChatConnectionInfo;
static_assert_64bit(offsetof(SignalMutPointerChatConnectionInfo, raw) == 0);
static_assert_64bit(sizeof(SignalMutPointerChatConnectionInfo) == 8);
static_assert_64bit(alignof(SignalMutPointerChatConnectionInfo) == 8);
typedef SignalMutPointerChatConnectionInfo* SignalType_MutPointer_SignalMutPointerChatConnectionInfo;
static_assert_64bit(sizeof(SignalType_MutPointer_SignalMutPointerChatConnectionInfo) == 8);
static_assert_64bit(alignof(SignalType_MutPointer_SignalMutPointerChatConnectionInfo) == 8);
typedef SignalRegistrationSession* SignalType_MutPointer_SignalRegistrationSession;
static_assert_64bit(sizeof(SignalType_MutPointer_SignalRegistrationSession) == 8);
static_assert_64bit(alignof(SignalType_MutPointer_SignalRegistrationSession) == 8);
typedef struct {
  SignalRegistrationSession* raw;
} SignalMutPointerRegistrationSession;
static_assert_64bit(offsetof(SignalMutPointerRegistrationSession, raw) == 0);
static_assert_64bit(sizeof(SignalMutPointerRegistrationSession) == 8);
static_assert_64bit(alignof(SignalMutPointerRegistrationSession) == 8);
typedef SignalMutPointerRegistrationSession* SignalType_MutPointer_SignalMutPointerRegistrationSession;
static_assert_64bit(sizeof(SignalType_MutPointer_SignalMutPointerRegistrationSession) == 8);
static_assert_64bit(alignof(SignalType_MutPointer_SignalMutPointerRegistrationSession) == 8);
typedef SignalConnectionProxyConfig* SignalType_MutPointer_SignalConnectionProxyConfig;
static_assert_64bit(sizeof(SignalType_MutPointer_SignalConnectionProxyConfig) == 8);
static_assert_64bit(alignof(SignalType_MutPointer_SignalConnectionProxyConfig) == 8);
typedef struct {
  SignalConnectionProxyConfig* raw;
} SignalMutPointerConnectionProxyConfig;
static_assert_64bit(offsetof(SignalMutPointerConnectionProxyConfig, raw) == 0);
static_assert_64bit(sizeof(SignalMutPointerConnectionProxyConfig) == 8);
static_assert_64bit(alignof(SignalMutPointerConnectionProxyConfig) == 8);
typedef SignalMutPointerConnectionProxyConfig* SignalType_MutPointer_SignalMutPointerConnectionProxyConfig;
static_assert_64bit(sizeof(SignalType_MutPointer_SignalMutPointerConnectionProxyConfig) == 8);
static_assert_64bit(alignof(SignalType_MutPointer_SignalMutPointerConnectionProxyConfig) == 8);
typedef SignalFingerprint* SignalType_MutPointer_SignalFingerprint;
static_assert_64bit(sizeof(SignalType_MutPointer_SignalFingerprint) == 8);
static_assert_64bit(alignof(SignalType_MutPointer_SignalFingerprint) == 8);
typedef struct {
  SignalFingerprint* raw;
} SignalMutPointerFingerprint;
static_assert_64bit(offsetof(SignalMutPointerFingerprint, raw) == 0);
static_assert_64bit(sizeof(SignalMutPointerFingerprint) == 8);
static_assert_64bit(alignof(SignalMutPointerFingerprint) == 8);
typedef SignalMutPointerFingerprint* SignalType_MutPointer_SignalMutPointerFingerprint;
static_assert_64bit(sizeof(SignalType_MutPointer_SignalMutPointerFingerprint) == 8);
static_assert_64bit(alignof(SignalType_MutPointer_SignalMutPointerFingerprint) == 8);
typedef SignalKyberPublicKey* SignalType_MutPointer_SignalKyberPublicKey;
static_assert_64bit(sizeof(SignalType_MutPointer_SignalKyberPublicKey) == 8);
static_assert_64bit(alignof(SignalType_MutPointer_SignalKyberPublicKey) == 8);
typedef struct {
  SignalKyberPublicKey* raw;
} SignalMutPointerKyberPublicKey;
static_assert_64bit(offsetof(SignalMutPointerKyberPublicKey, raw) == 0);
static_assert_64bit(sizeof(SignalMutPointerKyberPublicKey) == 8);
static_assert_64bit(alignof(SignalMutPointerKyberPublicKey) == 8);
typedef SignalMutPointerKyberPublicKey* SignalType_MutPointer_SignalMutPointerKyberPublicKey;
static_assert_64bit(sizeof(SignalType_MutPointer_SignalMutPointerKyberPublicKey) == 8);
static_assert_64bit(alignof(SignalType_MutPointer_SignalMutPointerKyberPublicKey) == 8);
typedef SignalKyberSecretKey* SignalType_MutPointer_SignalKyberSecretKey;
static_assert_64bit(sizeof(SignalType_MutPointer_SignalKyberSecretKey) == 8);
static_assert_64bit(alignof(SignalType_MutPointer_SignalKyberSecretKey) == 8);
typedef struct {
  SignalKyberSecretKey* raw;
} SignalMutPointerKyberSecretKey;
static_assert_64bit(offsetof(SignalMutPointerKyberSecretKey, raw) == 0);
static_assert_64bit(sizeof(SignalMutPointerKyberSecretKey) == 8);
static_assert_64bit(alignof(SignalMutPointerKyberSecretKey) == 8);
typedef SignalMutPointerKyberSecretKey* SignalType_MutPointer_SignalMutPointerKyberSecretKey;
static_assert_64bit(sizeof(SignalType_MutPointer_SignalMutPointerKyberSecretKey) == 8);
static_assert_64bit(alignof(SignalType_MutPointer_SignalMutPointerKyberSecretKey) == 8);
typedef SignalKyberKeyPair* SignalType_MutPointer_SignalKyberKeyPair;
static_assert_64bit(sizeof(SignalType_MutPointer_SignalKyberKeyPair) == 8);
static_assert_64bit(alignof(SignalType_MutPointer_SignalKyberKeyPair) == 8);
typedef struct {
  SignalKyberKeyPair* raw;
} SignalMutPointerKyberKeyPair;
static_assert_64bit(offsetof(SignalMutPointerKyberKeyPair, raw) == 0);
static_assert_64bit(sizeof(SignalMutPointerKyberKeyPair) == 8);
static_assert_64bit(alignof(SignalMutPointerKyberKeyPair) == 8);
typedef SignalMutPointerKyberKeyPair* SignalType_MutPointer_SignalMutPointerKyberKeyPair;
static_assert_64bit(sizeof(SignalType_MutPointer_SignalMutPointerKyberKeyPair) == 8);
static_assert_64bit(alignof(SignalType_MutPointer_SignalMutPointerKyberKeyPair) == 8);
typedef SignalCiphertextMessage* SignalType_MutPointer_SignalCiphertextMessage;
static_assert_64bit(sizeof(SignalType_MutPointer_SignalCiphertextMessage) == 8);
static_assert_64bit(alignof(SignalType_MutPointer_SignalCiphertextMessage) == 8);
typedef struct {
  SignalCiphertextMessage* raw;
} SignalMutPointerCiphertextMessage;
static_assert_64bit(offsetof(SignalMutPointerCiphertextMessage, raw) == 0);
static_assert_64bit(sizeof(SignalMutPointerCiphertextMessage) == 8);
static_assert_64bit(alignof(SignalMutPointerCiphertextMessage) == 8);
typedef SignalMutPointerCiphertextMessage* SignalType_MutPointer_SignalMutPointerCiphertextMessage;
static_assert_64bit(sizeof(SignalType_MutPointer_SignalMutPointerCiphertextMessage) == 8);
static_assert_64bit(alignof(SignalType_MutPointer_SignalMutPointerCiphertextMessage) == 8);
typedef SignalDecryptionErrorMessage* SignalType_MutPointer_SignalDecryptionErrorMessage;
static_assert_64bit(sizeof(SignalType_MutPointer_SignalDecryptionErrorMessage) == 8);
static_assert_64bit(alignof(SignalType_MutPointer_SignalDecryptionErrorMessage) == 8);
typedef struct {
  SignalDecryptionErrorMessage* raw;
} SignalMutPointerDecryptionErrorMessage;
static_assert_64bit(offsetof(SignalMutPointerDecryptionErrorMessage, raw) == 0);
static_assert_64bit(sizeof(SignalMutPointerDecryptionErrorMessage) == 8);
static_assert_64bit(alignof(SignalMutPointerDecryptionErrorMessage) == 8);
typedef SignalMutPointerDecryptionErrorMessage* SignalType_MutPointer_SignalMutPointerDecryptionErrorMessage;
static_assert_64bit(sizeof(SignalType_MutPointer_SignalMutPointerDecryptionErrorMessage) == 8);
static_assert_64bit(alignof(SignalType_MutPointer_SignalMutPointerDecryptionErrorMessage) == 8);
typedef SignalPlaintextContent* SignalType_MutPointer_SignalPlaintextContent;
static_assert_64bit(sizeof(SignalType_MutPointer_SignalPlaintextContent) == 8);
static_assert_64bit(alignof(SignalType_MutPointer_SignalPlaintextContent) == 8);
typedef struct {
  SignalPlaintextContent* raw;
} SignalMutPointerPlaintextContent;
static_assert_64bit(offsetof(SignalMutPointerPlaintextContent, raw) == 0);
static_assert_64bit(sizeof(SignalMutPointerPlaintextContent) == 8);
static_assert_64bit(alignof(SignalMutPointerPlaintextContent) == 8);
typedef SignalMutPointerPlaintextContent* SignalType_MutPointer_SignalMutPointerPlaintextContent;
static_assert_64bit(sizeof(SignalType_MutPointer_SignalMutPointerPlaintextContent) == 8);
static_assert_64bit(alignof(SignalType_MutPointer_SignalMutPointerPlaintextContent) == 8);
typedef SignalPreKeySignalMessage* SignalType_MutPointer_SignalPreKeySignalMessage;
static_assert_64bit(sizeof(SignalType_MutPointer_SignalPreKeySignalMessage) == 8);
static_assert_64bit(alignof(SignalType_MutPointer_SignalPreKeySignalMessage) == 8);
typedef struct {
  SignalPreKeySignalMessage* raw;
} SignalMutPointerPreKeySignalMessage;
static_assert_64bit(offsetof(SignalMutPointerPreKeySignalMessage, raw) == 0);
static_assert_64bit(sizeof(SignalMutPointerPreKeySignalMessage) == 8);
static_assert_64bit(alignof(SignalMutPointerPreKeySignalMessage) == 8);
typedef SignalMutPointerPreKeySignalMessage* SignalType_MutPointer_SignalMutPointerPreKeySignalMessage;
static_assert_64bit(sizeof(SignalType_MutPointer_SignalMutPointerPreKeySignalMessage) == 8);
static_assert_64bit(alignof(SignalType_MutPointer_SignalMutPointerPreKeySignalMessage) == 8);
typedef SignalSenderKeyDistributionMessage* SignalType_MutPointer_SignalSenderKeyDistributionMessage;
static_assert_64bit(sizeof(SignalType_MutPointer_SignalSenderKeyDistributionMessage) == 8);
static_assert_64bit(alignof(SignalType_MutPointer_SignalSenderKeyDistributionMessage) == 8);
typedef struct {
  SignalSenderKeyDistributionMessage* raw;
} SignalMutPointerSenderKeyDistributionMessage;
static_assert_64bit(offsetof(SignalMutPointerSenderKeyDistributionMessage, raw) == 0);
static_assert_64bit(sizeof(SignalMutPointerSenderKeyDistributionMessage) == 8);
static_assert_64bit(alignof(SignalMutPointerSenderKeyDistributionMessage) == 8);
typedef SignalMutPointerSenderKeyDistributionMessage* SignalType_MutPointer_SignalMutPointerSenderKeyDistributionMessage;
static_assert_64bit(sizeof(SignalType_MutPointer_SignalMutPointerSenderKeyDistributionMessage) == 8);
static_assert_64bit(alignof(SignalType_MutPointer_SignalMutPointerSenderKeyDistributionMessage) == 8);
typedef SignalSenderKeyMessage* SignalType_MutPointer_SignalSenderKeyMessage;
static_assert_64bit(sizeof(SignalType_MutPointer_SignalSenderKeyMessage) == 8);
static_assert_64bit(alignof(SignalType_MutPointer_SignalSenderKeyMessage) == 8);
typedef struct {
  SignalSenderKeyMessage* raw;
} SignalMutPointerSenderKeyMessage;
static_assert_64bit(offsetof(SignalMutPointerSenderKeyMessage, raw) == 0);
static_assert_64bit(sizeof(SignalMutPointerSenderKeyMessage) == 8);
static_assert_64bit(alignof(SignalMutPointerSenderKeyMessage) == 8);
typedef SignalMutPointerSenderKeyMessage* SignalType_MutPointer_SignalMutPointerSenderKeyMessage;
static_assert_64bit(sizeof(SignalType_MutPointer_SignalMutPointerSenderKeyMessage) == 8);
static_assert_64bit(alignof(SignalType_MutPointer_SignalMutPointerSenderKeyMessage) == 8);
typedef SignalSignalMessage* SignalType_MutPointer_SignalSignalMessage;
static_assert_64bit(sizeof(SignalType_MutPointer_SignalSignalMessage) == 8);
static_assert_64bit(alignof(SignalType_MutPointer_SignalSignalMessage) == 8);
typedef struct {
  SignalSignalMessage* raw;
} SignalMutPointerSignalMessage;
static_assert_64bit(offsetof(SignalMutPointerSignalMessage, raw) == 0);
static_assert_64bit(sizeof(SignalMutPointerSignalMessage) == 8);
static_assert_64bit(alignof(SignalMutPointerSignalMessage) == 8);
typedef SignalMutPointerSignalMessage* SignalType_MutPointer_SignalMutPointerSignalMessage;
static_assert_64bit(sizeof(SignalType_MutPointer_SignalMutPointerSignalMessage) == 8);
static_assert_64bit(alignof(SignalType_MutPointer_SignalMutPointerSignalMessage) == 8);
typedef SignalSenderCertificate* SignalType_MutPointer_SignalSenderCertificate;
static_assert_64bit(sizeof(SignalType_MutPointer_SignalSenderCertificate) == 8);
static_assert_64bit(alignof(SignalType_MutPointer_SignalSenderCertificate) == 8);
typedef struct {
  SignalSenderCertificate* raw;
} SignalMutPointerSenderCertificate;
static_assert_64bit(offsetof(SignalMutPointerSenderCertificate, raw) == 0);
static_assert_64bit(sizeof(SignalMutPointerSenderCertificate) == 8);
static_assert_64bit(alignof(SignalMutPointerSenderCertificate) == 8);
typedef SignalMutPointerSenderCertificate* SignalType_MutPointer_SignalMutPointerSenderCertificate;
static_assert_64bit(sizeof(SignalType_MutPointer_SignalMutPointerSenderCertificate) == 8);
static_assert_64bit(alignof(SignalType_MutPointer_SignalMutPointerSenderCertificate) == 8);
typedef SignalServerCertificate* SignalType_MutPointer_SignalServerCertificate;
static_assert_64bit(sizeof(SignalType_MutPointer_SignalServerCertificate) == 8);
static_assert_64bit(alignof(SignalType_MutPointer_SignalServerCertificate) == 8);
typedef struct {
  SignalServerCertificate* raw;
} SignalMutPointerServerCertificate;
static_assert_64bit(offsetof(SignalMutPointerServerCertificate, raw) == 0);
static_assert_64bit(sizeof(SignalMutPointerServerCertificate) == 8);
static_assert_64bit(alignof(SignalMutPointerServerCertificate) == 8);
typedef SignalMutPointerServerCertificate* SignalType_MutPointer_SignalMutPointerServerCertificate;
static_assert_64bit(sizeof(SignalType_MutPointer_SignalMutPointerServerCertificate) == 8);
static_assert_64bit(alignof(SignalType_MutPointer_SignalMutPointerServerCertificate) == 8);
typedef SignalUnidentifiedSenderMessageContent* SignalType_MutPointer_SignalUnidentifiedSenderMessageContent;
static_assert_64bit(sizeof(SignalType_MutPointer_SignalUnidentifiedSenderMessageContent) == 8);
static_assert_64bit(alignof(SignalType_MutPointer_SignalUnidentifiedSenderMessageContent) == 8);
typedef struct {
  SignalUnidentifiedSenderMessageContent* raw;
} SignalMutPointerUnidentifiedSenderMessageContent;
static_assert_64bit(offsetof(SignalMutPointerUnidentifiedSenderMessageContent, raw) == 0);
static_assert_64bit(sizeof(SignalMutPointerUnidentifiedSenderMessageContent) == 8);
static_assert_64bit(alignof(SignalMutPointerUnidentifiedSenderMessageContent) == 8);
typedef SignalMutPointerUnidentifiedSenderMessageContent* SignalType_MutPointer_SignalMutPointerUnidentifiedSenderMessageContent;
static_assert_64bit(sizeof(SignalType_MutPointer_SignalMutPointerUnidentifiedSenderMessageContent) == 8);
static_assert_64bit(alignof(SignalType_MutPointer_SignalMutPointerUnidentifiedSenderMessageContent) == 8);
typedef struct SignalAes256Ctr32 SignalAes256Ctr32;
typedef SignalAes256Ctr32* SignalType_MutPointer_SignalAes256Ctr32;
static_assert_64bit(sizeof(SignalType_MutPointer_SignalAes256Ctr32) == 8);
static_assert_64bit(alignof(SignalType_MutPointer_SignalAes256Ctr32) == 8);
typedef struct {
  SignalAes256Ctr32* raw;
} SignalMutPointerAes256Ctr32;
static_assert_64bit(offsetof(SignalMutPointerAes256Ctr32, raw) == 0);
static_assert_64bit(sizeof(SignalMutPointerAes256Ctr32) == 8);
static_assert_64bit(alignof(SignalMutPointerAes256Ctr32) == 8);
typedef SignalMutPointerAes256Ctr32* SignalType_MutPointer_SignalMutPointerAes256Ctr32;
static_assert_64bit(sizeof(SignalType_MutPointer_SignalMutPointerAes256Ctr32) == 8);
static_assert_64bit(alignof(SignalType_MutPointer_SignalMutPointerAes256Ctr32) == 8);
typedef SignalServerPublicParams* SignalType_MutPointer_SignalServerPublicParams;
static_assert_64bit(sizeof(SignalType_MutPointer_SignalServerPublicParams) == 8);
static_assert_64bit(alignof(SignalType_MutPointer_SignalServerPublicParams) == 8);
typedef struct {
  SignalServerPublicParams* raw;
} SignalMutPointerServerPublicParams;
static_assert_64bit(offsetof(SignalMutPointerServerPublicParams, raw) == 0);
static_assert_64bit(sizeof(SignalMutPointerServerPublicParams) == 8);
static_assert_64bit(alignof(SignalMutPointerServerPublicParams) == 8);
typedef SignalMutPointerServerPublicParams* SignalType_MutPointer_SignalMutPointerServerPublicParams;
static_assert_64bit(sizeof(SignalType_MutPointer_SignalMutPointerServerPublicParams) == 8);
static_assert_64bit(alignof(SignalType_MutPointer_SignalMutPointerServerPublicParams) == 8);
typedef SignalServerSecretParams* SignalType_MutPointer_SignalServerSecretParams;
static_assert_64bit(sizeof(SignalType_MutPointer_SignalServerSecretParams) == 8);
static_assert_64bit(alignof(SignalType_MutPointer_SignalServerSecretParams) == 8);
typedef struct {
  SignalServerSecretParams* raw;
} SignalMutPointerServerSecretParams;
static_assert_64bit(offsetof(SignalMutPointerServerSecretParams, raw) == 0);
static_assert_64bit(sizeof(SignalMutPointerServerSecretParams) == 8);
static_assert_64bit(alignof(SignalMutPointerServerSecretParams) == 8);
typedef SignalMutPointerServerSecretParams* SignalType_MutPointer_SignalMutPointerServerSecretParams;
static_assert_64bit(sizeof(SignalType_MutPointer_SignalMutPointerServerSecretParams) == 8);
static_assert_64bit(alignof(SignalType_MutPointer_SignalMutPointerServerSecretParams) == 8);
typedef SignalOptionalUuid* SignalType_MutPointer_SignalOptionalUuid;
static_assert_64bit(sizeof(SignalType_MutPointer_SignalOptionalUuid) == 8);
static_assert_64bit(alignof(SignalType_MutPointer_SignalOptionalUuid) == 8);
typedef struct {
  SignalFfiMismatchedDevicesError* base;
  size_t length;
} SignalOwnedBufferOfFfiMismatchedDevicesError;
static_assert_64bit(offsetof(SignalOwnedBufferOfFfiMismatchedDevicesError, base) == 0);
static_assert_64bit(offsetof(SignalOwnedBufferOfFfiMismatchedDevicesError, length) == 8);
static_assert_64bit(sizeof(SignalOwnedBufferOfFfiMismatchedDevicesError) == 16);
static_assert_64bit(alignof(SignalOwnedBufferOfFfiMismatchedDevicesError) == 8);
typedef SignalOwnedBufferOfFfiMismatchedDevicesError* SignalType_MutPointer_SignalOwnedBufferOfFfiMismatchedDevicesError;
static_assert_64bit(sizeof(SignalType_MutPointer_SignalOwnedBufferOfFfiMismatchedDevicesError) == 8);
static_assert_64bit(alignof(SignalType_MutPointer_SignalOwnedBufferOfFfiMismatchedDevicesError) == 8);
typedef struct {
  SignalFfiRegisterResponseBadge* base;
  size_t length;
} SignalOwnedBufferOfFfiRegisterResponseBadge;
static_assert_64bit(offsetof(SignalOwnedBufferOfFfiRegisterResponseBadge, base) == 0);
static_assert_64bit(offsetof(SignalOwnedBufferOfFfiRegisterResponseBadge, length) == 8);
static_assert_64bit(sizeof(SignalOwnedBufferOfFfiRegisterResponseBadge) == 16);
static_assert_64bit(alignof(SignalOwnedBufferOfFfiRegisterResponseBadge) == 8);
typedef SignalOwnedBufferOfFfiRegisterResponseBadge* SignalType_MutPointer_SignalOwnedBufferOfFfiRegisterResponseBadge;
static_assert_64bit(sizeof(SignalType_MutPointer_SignalOwnedBufferOfFfiRegisterResponseBadge) == 8);
static_assert_64bit(alignof(SignalType_MutPointer_SignalOwnedBufferOfFfiRegisterResponseBadge) == 8);
typedef SignalOwnedBuffer* SignalType_MutPointer_SignalOwnedBuffer;
static_assert_64bit(sizeof(SignalType_MutPointer_SignalOwnedBuffer) == 8);
static_assert_64bit(alignof(SignalType_MutPointer_SignalOwnedBuffer) == 8);
typedef struct {
  int32_t source_attachment_cdn;
  const int8_t* source_key;
  int64_t object_length;
  SignalType_FixedArray15_uint8_t media_id;
  SignalType_FixedArray64_uint8_t encryption_key;
} SignalBridgeCopyBackupMediaItemFfiResult;
static_assert_64bit(offsetof(SignalBridgeCopyBackupMediaItemFfiResult, source_attachment_cdn) == 0);
static_assert_64bit(offsetof(SignalBridgeCopyBackupMediaItemFfiResult, source_key) == 8);
static_assert_64bit(offsetof(SignalBridgeCopyBackupMediaItemFfiResult, object_length) == 16);
static_assert_64bit(offsetof(SignalBridgeCopyBackupMediaItemFfiResult, media_id) == 24);
static_assert_64bit(offsetof(SignalBridgeCopyBackupMediaItemFfiResult, encryption_key) == 39);
static_assert_64bit(sizeof(SignalBridgeCopyBackupMediaItemFfiResult) == 104);
static_assert_64bit(alignof(SignalBridgeCopyBackupMediaItemFfiResult) == 8);
typedef SignalBridgeCopyBackupMediaItemFfiResult* SignalType_MutPointer_SignalBridgeCopyBackupMediaItemFfiResult;
static_assert_64bit(sizeof(SignalType_MutPointer_SignalBridgeCopyBackupMediaItemFfiResult) == 8);
static_assert_64bit(alignof(SignalType_MutPointer_SignalBridgeCopyBackupMediaItemFfiResult) == 8);
typedef struct {
  SignalBridgeCopyBackupMediaItemFfiResult* base;
  size_t length;
  size_t size_bytes;
} SignalOwnedBufferOfMaxAlignedBridgeCopyBackupMediaItemFfiResult;
static_assert_64bit(offsetof(SignalOwnedBufferOfMaxAlignedBridgeCopyBackupMediaItemFfiResult, base) == 0);
static_assert_64bit(offsetof(SignalOwnedBufferOfMaxAlignedBridgeCopyBackupMediaItemFfiResult, length) == 8);
static_assert_64bit(offsetof(SignalOwnedBufferOfMaxAlignedBridgeCopyBackupMediaItemFfiResult, size_bytes) == 16);
static_assert_64bit(sizeof(SignalOwnedBufferOfMaxAlignedBridgeCopyBackupMediaItemFfiResult) == 24);
static_assert_64bit(alignof(SignalOwnedBufferOfMaxAlignedBridgeCopyBackupMediaItemFfiResult) == 8);
typedef SignalOwnedBufferOfMaxAlignedBridgeCopyBackupMediaItemFfiResult* SignalType_MutPointer_SignalOwnedBufferOfMaxAlignedBridgeCopyBackupMediaItemFfiResult;
static_assert_64bit(sizeof(SignalType_MutPointer_SignalOwnedBufferOfMaxAlignedBridgeCopyBackupMediaItemFfiResult) == 8);
static_assert_64bit(alignof(SignalType_MutPointer_SignalOwnedBufferOfMaxAlignedBridgeCopyBackupMediaItemFfiResult) == 8);
typedef struct {
  const int8_t* first;
  bool second;
} SignalPairOfCStringPtrbool;
static_assert_64bit(offsetof(SignalPairOfCStringPtrbool, first) == 0);
static_assert_64bit(offsetof(SignalPairOfCStringPtrbool, second) == 8);
static_assert_64bit(sizeof(SignalPairOfCStringPtrbool) == 16);
static_assert_64bit(alignof(SignalPairOfCStringPtrbool) == 8);
typedef SignalPairOfCStringPtrbool* SignalType_MutPointer_SignalPairOfCStringPtrbool;
static_assert_64bit(sizeof(SignalType_MutPointer_SignalPairOfCStringPtrbool) == 8);
static_assert_64bit(alignof(SignalType_MutPointer_SignalPairOfCStringPtrbool) == 8);
typedef struct {
  const int8_t* first;
  uint32_t second;
} SignalPairOfCStringPtru32;
static_assert_64bit(offsetof(SignalPairOfCStringPtru32, first) == 0);
static_assert_64bit(offsetof(SignalPairOfCStringPtru32, second) == 8);
static_assert_64bit(sizeof(SignalPairOfCStringPtru32) == 16);
static_assert_64bit(alignof(SignalPairOfCStringPtru32) == 8);
typedef SignalPairOfCStringPtru32* SignalType_MutPointer_SignalPairOfCStringPtru32;
static_assert_64bit(sizeof(SignalType_MutPointer_SignalPairOfCStringPtru32) == 8);
static_assert_64bit(alignof(SignalType_MutPointer_SignalPairOfCStringPtru32) == 8);
typedef struct {
  SignalMutPointerPublicKey first;
  SignalMutPointerPrivateKey second;
} SignalPairOfMutPointerPublicKeyMutPointerPrivateKey;
static_assert_64bit(offsetof(SignalPairOfMutPointerPublicKeyMutPointerPrivateKey, first) == 0);
static_assert_64bit(offsetof(SignalPairOfMutPointerPublicKeyMutPointerPrivateKey, second) == 8);
static_assert_64bit(sizeof(SignalPairOfMutPointerPublicKeyMutPointerPrivateKey) == 16);
static_assert_64bit(alignof(SignalPairOfMutPointerPublicKeyMutPointerPrivateKey) == 8);
typedef SignalPairOfMutPointerPublicKeyMutPointerPrivateKey* SignalType_MutPointer_SignalPairOfMutPointerPublicKeyMutPointerPrivateKey;
static_assert_64bit(sizeof(SignalType_MutPointer_SignalPairOfMutPointerPublicKeyMutPointerPrivateKey) == 8);
static_assert_64bit(alignof(SignalType_MutPointer_SignalPairOfMutPointerPublicKeyMutPointerPrivateKey) == 8);
typedef struct {
  const int8_t* first;
  SignalOwnedBuffer second;
} SignalPairOfCStringPtrOwnedBuffer;
static_assert_64bit(offsetof(SignalPairOfCStringPtrOwnedBuffer, first) == 0);
static_assert_64bit(offsetof(SignalPairOfCStringPtrOwnedBuffer, second) == 8);
static_assert_64bit(sizeof(SignalPairOfCStringPtrOwnedBuffer) == 24);
static_assert_64bit(alignof(SignalPairOfCStringPtrOwnedBuffer) == 8);
typedef struct {
  SignalPairOfCStringPtrOwnedBuffer first;
  int64_t second;
} SignalPairOfPairOfCStringPtrOwnedBufferi64;
static_assert_64bit(offsetof(SignalPairOfPairOfCStringPtrOwnedBufferi64, first) == 0);
static_assert_64bit(offsetof(SignalPairOfPairOfCStringPtrOwnedBufferi64, second) == 24);
static_assert_64bit(sizeof(SignalPairOfPairOfCStringPtrOwnedBufferi64) == 32);
static_assert_64bit(alignof(SignalPairOfPairOfCStringPtrOwnedBufferi64) == 8);
typedef SignalPairOfPairOfCStringPtrOwnedBufferi64* SignalType_MutPointer_SignalPairOfPairOfCStringPtrOwnedBufferi64;
static_assert_64bit(sizeof(SignalType_MutPointer_SignalPairOfPairOfCStringPtrOwnedBufferi64) == 8);
static_assert_64bit(alignof(SignalType_MutPointer_SignalPairOfPairOfCStringPtrOwnedBufferi64) == 8);
typedef SignalUuid* SignalType_MutPointer_SignalUuid;
static_assert_64bit(sizeof(SignalType_MutPointer_SignalUuid) == 8);
static_assert_64bit(alignof(SignalType_MutPointer_SignalUuid) == 8);
typedef void (*SignalType_FunctionPointer_void_SignalType_MutPointer_SignalFfiError_SignalType_ConstPointer_SignalType_FixedArray32_uint8_t_SignalType_ConstPointer_void)(SignalType_MutPointer_SignalFfiError, SignalType_ConstPointer_SignalType_FixedArray32_uint8_t, SignalType_ConstPointer_void);
static_assert_64bit(sizeof(SignalType_FunctionPointer_void_SignalType_MutPointer_SignalFfiError_SignalType_ConstPointer_SignalType_FixedArray32_uint8_t_SignalType_ConstPointer_void) == 8);
static_assert_64bit(alignof(SignalType_FunctionPointer_void_SignalType_MutPointer_SignalFfiError_SignalType_ConstPointer_SignalType_FixedArray32_uint8_t_SignalType_ConstPointer_void) == 8);
typedef struct {
  SignalType_FunctionPointer_void_SignalType_MutPointer_SignalFfiError_SignalType_ConstPointer_SignalType_FixedArray32_uint8_t_SignalType_ConstPointer_void complete;
  const void* context;
  uint64_t cancellation_id;
} SignalCPromisec_uchar32;
static_assert_64bit(offsetof(SignalCPromisec_uchar32, complete) == 0);
static_assert_64bit(offsetof(SignalCPromisec_uchar32, context) == 8);
static_assert_64bit(offsetof(SignalCPromisec_uchar32, cancellation_id) == 16);
static_assert_64bit(sizeof(SignalCPromisec_uchar32) == 24);
static_assert_64bit(alignof(SignalCPromisec_uchar32) == 8);
typedef SignalCPromisec_uchar32* SignalType_MutPointer_SignalCPromisec_uchar32;
static_assert_64bit(sizeof(SignalType_MutPointer_SignalCPromisec_uchar32) == 8);
static_assert_64bit(alignof(SignalType_MutPointer_SignalCPromisec_uchar32) == 8);
typedef void (*SignalType_FunctionPointer_void_SignalType_MutPointer_SignalFfiError_SignalType_ConstPointer_bool_SignalType_ConstPointer_void)(SignalType_MutPointer_SignalFfiError, SignalType_ConstPointer_bool, SignalType_ConstPointer_void);
static_assert_64bit(sizeof(SignalType_FunctionPointer_void_SignalType_MutPointer_SignalFfiError_SignalType_ConstPointer_bool_SignalType_ConstPointer_void) == 8);
static_assert_64bit(alignof(SignalType_FunctionPointer_void_SignalType_MutPointer_SignalFfiError_SignalType_ConstPointer_bool_SignalType_ConstPointer_void) == 8);
typedef struct {
  SignalType_FunctionPointer_void_SignalType_MutPointer_SignalFfiError_SignalType_ConstPointer_bool_SignalType_ConstPointer_void complete;
  const void* context;
  uint64_t cancellation_id;
} SignalCPromisebool;
static_assert_64bit(offsetof(SignalCPromisebool, complete) == 0);
static_assert_64bit(offsetof(SignalCPromisebool, context) == 8);
static_assert_64bit(offsetof(SignalCPromisebool, cancellation_id) == 16);
static_assert_64bit(sizeof(SignalCPromisebool) == 24);
static_assert_64bit(alignof(SignalCPromisebool) == 8);
typedef SignalCPromisebool* SignalType_MutPointer_SignalCPromisebool;
static_assert_64bit(sizeof(SignalType_MutPointer_SignalCPromisebool) == 8);
static_assert_64bit(alignof(SignalType_MutPointer_SignalCPromisebool) == 8);
typedef void (*SignalType_FunctionPointer_void_SignalType_MutPointer_SignalFfiError_SignalType_ConstPointer_SignalFfiCdsiLookupResponse_SignalType_ConstPointer_void)(SignalType_MutPointer_SignalFfiError, SignalType_ConstPointer_SignalFfiCdsiLookupResponse, SignalType_ConstPointer_void);
static_assert_64bit(sizeof(SignalType_FunctionPointer_void_SignalType_MutPointer_SignalFfiError_SignalType_ConstPointer_SignalFfiCdsiLookupResponse_SignalType_ConstPointer_void) == 8);
static_assert_64bit(alignof(SignalType_FunctionPointer_void_SignalType_MutPointer_SignalFfiError_SignalType_ConstPointer_SignalFfiCdsiLookupResponse_SignalType_ConstPointer_void) == 8);
typedef struct {
  SignalType_FunctionPointer_void_SignalType_MutPointer_SignalFfiError_SignalType_ConstPointer_SignalFfiCdsiLookupResponse_SignalType_ConstPointer_void complete;
  const void* context;
  uint64_t cancellation_id;
} SignalCPromiseFfiCdsiLookupResponse;
static_assert_64bit(offsetof(SignalCPromiseFfiCdsiLookupResponse, complete) == 0);
static_assert_64bit(offsetof(SignalCPromiseFfiCdsiLookupResponse, context) == 8);
static_assert_64bit(offsetof(SignalCPromiseFfiCdsiLookupResponse, cancellation_id) == 16);
static_assert_64bit(sizeof(SignalCPromiseFfiCdsiLookupResponse) == 24);
static_assert_64bit(alignof(SignalCPromiseFfiCdsiLookupResponse) == 8);
typedef SignalCPromiseFfiCdsiLookupResponse* SignalType_MutPointer_SignalCPromiseFfiCdsiLookupResponse;
static_assert_64bit(sizeof(SignalType_MutPointer_SignalCPromiseFfiCdsiLookupResponse) == 8);
static_assert_64bit(alignof(SignalType_MutPointer_SignalCPromiseFfiCdsiLookupResponse) == 8);
typedef void (*SignalType_FunctionPointer_void_SignalType_MutPointer_SignalFfiError_SignalType_ConstPointer_SignalFfiChatResponse_SignalType_ConstPointer_void)(SignalType_MutPointer_SignalFfiError, SignalType_ConstPointer_SignalFfiChatResponse, SignalType_ConstPointer_void);
static_assert_64bit(sizeof(SignalType_FunctionPointer_void_SignalType_MutPointer_SignalFfiError_SignalType_ConstPointer_SignalFfiChatResponse_SignalType_ConstPointer_void) == 8);
static_assert_64bit(alignof(SignalType_FunctionPointer_void_SignalType_MutPointer_SignalFfiError_SignalType_ConstPointer_SignalFfiChatResponse_SignalType_ConstPointer_void) == 8);
typedef struct {
  SignalType_FunctionPointer_void_SignalType_MutPointer_SignalFfiError_SignalType_ConstPointer_SignalFfiChatResponse_SignalType_ConstPointer_void complete;
  const void* context;
  uint64_t cancellation_id;
} SignalCPromiseFfiChatResponse;
static_assert_64bit(offsetof(SignalCPromiseFfiChatResponse, complete) == 0);
static_assert_64bit(offsetof(SignalCPromiseFfiChatResponse, context) == 8);
static_assert_64bit(offsetof(SignalCPromiseFfiChatResponse, cancellation_id) == 16);
static_assert_64bit(sizeof(SignalCPromiseFfiChatResponse) == 24);
static_assert_64bit(alignof(SignalCPromiseFfiChatResponse) == 8);
typedef SignalCPromiseFfiChatResponse* SignalType_MutPointer_SignalCPromiseFfiChatResponse;
static_assert_64bit(sizeof(SignalType_MutPointer_SignalCPromiseFfiChatResponse) == 8);
static_assert_64bit(alignof(SignalType_MutPointer_SignalCPromiseFfiChatResponse) == 8);
typedef void (*SignalType_FunctionPointer_void_SignalType_MutPointer_SignalFfiError_SignalType_ConstPointer_SignalFfiCheckSvr2CredentialsResponse_SignalType_ConstPointer_void)(SignalType_MutPointer_SignalFfiError, SignalType_ConstPointer_SignalFfiCheckSvr2CredentialsResponse, SignalType_ConstPointer_void);
static_assert_64bit(sizeof(SignalType_FunctionPointer_void_SignalType_MutPointer_SignalFfiError_SignalType_ConstPointer_SignalFfiCheckSvr2CredentialsResponse_SignalType_ConstPointer_void) == 8);
static_assert_64bit(alignof(SignalType_FunctionPointer_void_SignalType_MutPointer_SignalFfiError_SignalType_ConstPointer_SignalFfiCheckSvr2CredentialsResponse_SignalType_ConstPointer_void) == 8);
typedef struct {
  SignalType_FunctionPointer_void_SignalType_MutPointer_SignalFfiError_SignalType_ConstPointer_SignalFfiCheckSvr2CredentialsResponse_SignalType_ConstPointer_void complete;
  const void* context;
  uint64_t cancellation_id;
} SignalCPromiseFfiCheckSvr2CredentialsResponse;
static_assert_64bit(offsetof(SignalCPromiseFfiCheckSvr2CredentialsResponse, complete) == 0);
static_assert_64bit(offsetof(SignalCPromiseFfiCheckSvr2CredentialsResponse, context) == 8);
static_assert_64bit(offsetof(SignalCPromiseFfiCheckSvr2CredentialsResponse, cancellation_id) == 16);
static_assert_64bit(sizeof(SignalCPromiseFfiCheckSvr2CredentialsResponse) == 24);
static_assert_64bit(alignof(SignalCPromiseFfiCheckSvr2CredentialsResponse) == 8);
typedef SignalCPromiseFfiCheckSvr2CredentialsResponse* SignalType_MutPointer_SignalCPromiseFfiCheckSvr2CredentialsResponse;
static_assert_64bit(sizeof(SignalType_MutPointer_SignalCPromiseFfiCheckSvr2CredentialsResponse) == 8);
static_assert_64bit(alignof(SignalType_MutPointer_SignalCPromiseFfiCheckSvr2CredentialsResponse) == 8);
typedef void (*SignalType_FunctionPointer_void_SignalType_MutPointer_SignalFfiError_SignalType_ConstPointer_SignalFfiPreKeysResponse_SignalType_ConstPointer_void)(SignalType_MutPointer_SignalFfiError, SignalType_ConstPointer_SignalFfiPreKeysResponse, SignalType_ConstPointer_void);
static_assert_64bit(sizeof(SignalType_FunctionPointer_void_SignalType_MutPointer_SignalFfiError_SignalType_ConstPointer_SignalFfiPreKeysResponse_SignalType_ConstPointer_void) == 8);
static_assert_64bit(alignof(SignalType_FunctionPointer_void_SignalType_MutPointer_SignalFfiError_SignalType_ConstPointer_SignalFfiPreKeysResponse_SignalType_ConstPointer_void) == 8);
typedef struct {
  SignalType_FunctionPointer_void_SignalType_MutPointer_SignalFfiError_SignalType_ConstPointer_SignalFfiPreKeysResponse_SignalType_ConstPointer_void complete;
  const void* context;
  uint64_t cancellation_id;
} SignalCPromiseFfiPreKeysResponse;
static_assert_64bit(offsetof(SignalCPromiseFfiPreKeysResponse, complete) == 0);
static_assert_64bit(offsetof(SignalCPromiseFfiPreKeysResponse, context) == 8);
static_assert_64bit(offsetof(SignalCPromiseFfiPreKeysResponse, cancellation_id) == 16);
static_assert_64bit(sizeof(SignalCPromiseFfiPreKeysResponse) == 24);
static_assert_64bit(alignof(SignalCPromiseFfiPreKeysResponse) == 8);
typedef SignalCPromiseFfiPreKeysResponse* SignalType_MutPointer_SignalCPromiseFfiPreKeysResponse;
static_assert_64bit(sizeof(SignalType_MutPointer_SignalCPromiseFfiPreKeysResponse) == 8);
static_assert_64bit(alignof(SignalType_MutPointer_SignalCPromiseFfiPreKeysResponse) == 8);
typedef void (*SignalType_FunctionPointer_void_SignalType_MutPointer_SignalFfiError_SignalType_ConstPointer_SignalFfiUploadForm_SignalType_ConstPointer_void)(SignalType_MutPointer_SignalFfiError, SignalType_ConstPointer_SignalFfiUploadForm, SignalType_ConstPointer_void);
static_assert_64bit(sizeof(SignalType_FunctionPointer_void_SignalType_MutPointer_SignalFfiError_SignalType_ConstPointer_SignalFfiUploadForm_SignalType_ConstPointer_void) == 8);
static_assert_64bit(alignof(SignalType_FunctionPointer_void_SignalType_MutPointer_SignalFfiError_SignalType_ConstPointer_SignalFfiUploadForm_SignalType_ConstPointer_void) == 8);
typedef struct {
  SignalType_FunctionPointer_void_SignalType_MutPointer_SignalFfiError_SignalType_ConstPointer_SignalFfiUploadForm_SignalType_ConstPointer_void complete;
  const void* context;
  uint64_t cancellation_id;
} SignalCPromiseFfiUploadForm;
static_assert_64bit(offsetof(SignalCPromiseFfiUploadForm, complete) == 0);
static_assert_64bit(offsetof(SignalCPromiseFfiUploadForm, context) == 8);
static_assert_64bit(offsetof(SignalCPromiseFfiUploadForm, cancellation_id) == 16);
static_assert_64bit(sizeof(SignalCPromiseFfiUploadForm) == 24);
static_assert_64bit(alignof(SignalCPromiseFfiUploadForm) == 8);
typedef SignalCPromiseFfiUploadForm* SignalType_MutPointer_SignalCPromiseFfiUploadForm;
static_assert_64bit(sizeof(SignalType_MutPointer_SignalCPromiseFfiUploadForm) == 8);
static_assert_64bit(alignof(SignalType_MutPointer_SignalCPromiseFfiUploadForm) == 8);
typedef void (*SignalType_FunctionPointer_void_SignalType_MutPointer_SignalFfiError_SignalType_ConstPointer_SignalMutPointerCdsiLookup_SignalType_ConstPointer_void)(SignalType_MutPointer_SignalFfiError, SignalType_ConstPointer_SignalMutPointerCdsiLookup, SignalType_ConstPointer_void);
static_assert_64bit(sizeof(SignalType_FunctionPointer_void_SignalType_MutPointer_SignalFfiError_SignalType_ConstPointer_SignalMutPointerCdsiLookup_SignalType_ConstPointer_void) == 8);
static_assert_64bit(alignof(SignalType_FunctionPointer_void_SignalType_MutPointer_SignalFfiError_SignalType_ConstPointer_SignalMutPointerCdsiLookup_SignalType_ConstPointer_void) == 8);
typedef struct {
  SignalType_FunctionPointer_void_SignalType_MutPointer_SignalFfiError_SignalType_ConstPointer_SignalMutPointerCdsiLookup_SignalType_ConstPointer_void complete;
  const void* context;
  uint64_t cancellation_id;
} SignalCPromiseMutPointerCdsiLookup;
static_assert_64bit(offsetof(SignalCPromiseMutPointerCdsiLookup, complete) == 0);
static_assert_64bit(offsetof(SignalCPromiseMutPointerCdsiLookup, context) == 8);
static_assert_64bit(offsetof(SignalCPromiseMutPointerCdsiLookup, cancellation_id) == 16);
static_assert_64bit(sizeof(SignalCPromiseMutPointerCdsiLookup) == 24);
static_assert_64bit(alignof(SignalCPromiseMutPointerCdsiLookup) == 8);
typedef SignalCPromiseMutPointerCdsiLookup* SignalType_MutPointer_SignalCPromiseMutPointerCdsiLookup;
static_assert_64bit(sizeof(SignalType_MutPointer_SignalCPromiseMutPointerCdsiLookup) == 8);
static_assert_64bit(alignof(SignalType_MutPointer_SignalCPromiseMutPointerCdsiLookup) == 8);
typedef void (*SignalType_FunctionPointer_void_SignalType_MutPointer_SignalFfiError_SignalType_ConstPointer_SignalMutPointerAuthenticatedChatConnection_SignalType_ConstPointer_void)(SignalType_MutPointer_SignalFfiError, SignalType_ConstPointer_SignalMutPointerAuthenticatedChatConnection, SignalType_ConstPointer_void);
static_assert_64bit(sizeof(SignalType_FunctionPointer_void_SignalType_MutPointer_SignalFfiError_SignalType_ConstPointer_SignalMutPointerAuthenticatedChatConnection_SignalType_ConstPointer_void) == 8);
static_assert_64bit(alignof(SignalType_FunctionPointer_void_SignalType_MutPointer_SignalFfiError_SignalType_ConstPointer_SignalMutPointerAuthenticatedChatConnection_SignalType_ConstPointer_void) == 8);
typedef struct {
  SignalType_FunctionPointer_void_SignalType_MutPointer_SignalFfiError_SignalType_ConstPointer_SignalMutPointerAuthenticatedChatConnection_SignalType_ConstPointer_void complete;
  const void* context;
  uint64_t cancellation_id;
} SignalCPromiseMutPointerAuthenticatedChatConnection;
static_assert_64bit(offsetof(SignalCPromiseMutPointerAuthenticatedChatConnection, complete) == 0);
static_assert_64bit(offsetof(SignalCPromiseMutPointerAuthenticatedChatConnection, context) == 8);
static_assert_64bit(offsetof(SignalCPromiseMutPointerAuthenticatedChatConnection, cancellation_id) == 16);
static_assert_64bit(sizeof(SignalCPromiseMutPointerAuthenticatedChatConnection) == 24);
static_assert_64bit(alignof(SignalCPromiseMutPointerAuthenticatedChatConnection) == 8);
typedef SignalCPromiseMutPointerAuthenticatedChatConnection* SignalType_MutPointer_SignalCPromiseMutPointerAuthenticatedChatConnection;
static_assert_64bit(sizeof(SignalType_MutPointer_SignalCPromiseMutPointerAuthenticatedChatConnection) == 8);
static_assert_64bit(alignof(SignalType_MutPointer_SignalCPromiseMutPointerAuthenticatedChatConnection) == 8);
typedef void (*SignalType_FunctionPointer_void_SignalType_MutPointer_SignalFfiError_SignalType_ConstPointer_SignalMutPointerProvisioningChatConnection_SignalType_ConstPointer_void)(SignalType_MutPointer_SignalFfiError, SignalType_ConstPointer_SignalMutPointerProvisioningChatConnection, SignalType_ConstPointer_void);
static_assert_64bit(sizeof(SignalType_FunctionPointer_void_SignalType_MutPointer_SignalFfiError_SignalType_ConstPointer_SignalMutPointerProvisioningChatConnection_SignalType_ConstPointer_void) == 8);
static_assert_64bit(alignof(SignalType_FunctionPointer_void_SignalType_MutPointer_SignalFfiError_SignalType_ConstPointer_SignalMutPointerProvisioningChatConnection_SignalType_ConstPointer_void) == 8);
typedef struct {
  SignalType_FunctionPointer_void_SignalType_MutPointer_SignalFfiError_SignalType_ConstPointer_SignalMutPointerProvisioningChatConnection_SignalType_ConstPointer_void complete;
  const void* context;
  uint64_t cancellation_id;
} SignalCPromiseMutPointerProvisioningChatConnection;
static_assert_64bit(offsetof(SignalCPromiseMutPointerProvisioningChatConnection, complete) == 0);
static_assert_64bit(offsetof(SignalCPromiseMutPointerProvisioningChatConnection, context) == 8);
static_assert_64bit(offsetof(SignalCPromiseMutPointerProvisioningChatConnection, cancellation_id) == 16);
static_assert_64bit(sizeof(SignalCPromiseMutPointerProvisioningChatConnection) == 24);
static_assert_64bit(alignof(SignalCPromiseMutPointerProvisioningChatConnection) == 8);
typedef SignalCPromiseMutPointerProvisioningChatConnection* SignalType_MutPointer_SignalCPromiseMutPointerProvisioningChatConnection;
static_assert_64bit(sizeof(SignalType_MutPointer_SignalCPromiseMutPointerProvisioningChatConnection) == 8);
static_assert_64bit(alignof(SignalType_MutPointer_SignalCPromiseMutPointerProvisioningChatConnection) == 8);
typedef void (*SignalType_FunctionPointer_void_SignalType_MutPointer_SignalFfiError_SignalType_ConstPointer_SignalMutPointerUnauthenticatedChatConnection_SignalType_ConstPointer_void)(SignalType_MutPointer_SignalFfiError, SignalType_ConstPointer_SignalMutPointerUnauthenticatedChatConnection, SignalType_ConstPointer_void);
static_assert_64bit(sizeof(SignalType_FunctionPointer_void_SignalType_MutPointer_SignalFfiError_SignalType_ConstPointer_SignalMutPointerUnauthenticatedChatConnection_SignalType_ConstPointer_void) == 8);
static_assert_64bit(alignof(SignalType_FunctionPointer_void_SignalType_MutPointer_SignalFfiError_SignalType_ConstPointer_SignalMutPointerUnauthenticatedChatConnection_SignalType_ConstPointer_void) == 8);
typedef struct {
  SignalType_FunctionPointer_void_SignalType_MutPointer_SignalFfiError_SignalType_ConstPointer_SignalMutPointerUnauthenticatedChatConnection_SignalType_ConstPointer_void complete;
  const void* context;
  uint64_t cancellation_id;
} SignalCPromiseMutPointerUnauthenticatedChatConnection;
static_assert_64bit(offsetof(SignalCPromiseMutPointerUnauthenticatedChatConnection, complete) == 0);
static_assert_64bit(offsetof(SignalCPromiseMutPointerUnauthenticatedChatConnection, context) == 8);
static_assert_64bit(offsetof(SignalCPromiseMutPointerUnauthenticatedChatConnection, cancellation_id) == 16);
static_assert_64bit(sizeof(SignalCPromiseMutPointerUnauthenticatedChatConnection) == 24);
static_assert_64bit(alignof(SignalCPromiseMutPointerUnauthenticatedChatConnection) == 8);
typedef SignalCPromiseMutPointerUnauthenticatedChatConnection* SignalType_MutPointer_SignalCPromiseMutPointerUnauthenticatedChatConnection;
static_assert_64bit(sizeof(SignalType_MutPointer_SignalCPromiseMutPointerUnauthenticatedChatConnection) == 8);
static_assert_64bit(alignof(SignalType_MutPointer_SignalCPromiseMutPointerUnauthenticatedChatConnection) == 8);
typedef void (*SignalType_FunctionPointer_void_SignalType_MutPointer_SignalFfiError_SignalType_ConstPointer_SignalMutPointerRegistrationService_SignalType_ConstPointer_void)(SignalType_MutPointer_SignalFfiError, SignalType_ConstPointer_SignalMutPointerRegistrationService, SignalType_ConstPointer_void);
static_assert_64bit(sizeof(SignalType_FunctionPointer_void_SignalType_MutPointer_SignalFfiError_SignalType_ConstPointer_SignalMutPointerRegistrationService_SignalType_ConstPointer_void) == 8);
static_assert_64bit(alignof(SignalType_FunctionPointer_void_SignalType_MutPointer_SignalFfiError_SignalType_ConstPointer_SignalMutPointerRegistrationService_SignalType_ConstPointer_void) == 8);
typedef struct {
  SignalType_FunctionPointer_void_SignalType_MutPointer_SignalFfiError_SignalType_ConstPointer_SignalMutPointerRegistrationService_SignalType_ConstPointer_void complete;
  const void* context;
  uint64_t cancellation_id;
} SignalCPromiseMutPointerRegistrationService;
static_assert_64bit(offsetof(SignalCPromiseMutPointerRegistrationService, complete) == 0);
static_assert_64bit(offsetof(SignalCPromiseMutPointerRegistrationService, context) == 8);
static_assert_64bit(offsetof(SignalCPromiseMutPointerRegistrationService, cancellation_id) == 16);
static_assert_64bit(sizeof(SignalCPromiseMutPointerRegistrationService) == 24);
static_assert_64bit(alignof(SignalCPromiseMutPointerRegistrationService) == 8);
typedef SignalCPromiseMutPointerRegistrationService* SignalType_MutPointer_SignalCPromiseMutPointerRegistrationService;
static_assert_64bit(sizeof(SignalType_MutPointer_SignalCPromiseMutPointerRegistrationService) == 8);
static_assert_64bit(alignof(SignalType_MutPointer_SignalCPromiseMutPointerRegistrationService) == 8);
typedef void (*SignalType_FunctionPointer_void_SignalType_MutPointer_SignalFfiError_SignalType_ConstPointer_SignalMutPointerBackupRestoreResponse_SignalType_ConstPointer_void)(SignalType_MutPointer_SignalFfiError, SignalType_ConstPointer_SignalMutPointerBackupRestoreResponse, SignalType_ConstPointer_void);
static_assert_64bit(sizeof(SignalType_FunctionPointer_void_SignalType_MutPointer_SignalFfiError_SignalType_ConstPointer_SignalMutPointerBackupRestoreResponse_SignalType_ConstPointer_void) == 8);
static_assert_64bit(alignof(SignalType_FunctionPointer_void_SignalType_MutPointer_SignalFfiError_SignalType_ConstPointer_SignalMutPointerBackupRestoreResponse_SignalType_ConstPointer_void) == 8);
typedef struct {
  SignalType_FunctionPointer_void_SignalType_MutPointer_SignalFfiError_SignalType_ConstPointer_SignalMutPointerBackupRestoreResponse_SignalType_ConstPointer_void complete;
  const void* context;
  uint64_t cancellation_id;
} SignalCPromiseMutPointerBackupRestoreResponse;
static_assert_64bit(offsetof(SignalCPromiseMutPointerBackupRestoreResponse, complete) == 0);
static_assert_64bit(offsetof(SignalCPromiseMutPointerBackupRestoreResponse, context) == 8);
static_assert_64bit(offsetof(SignalCPromiseMutPointerBackupRestoreResponse, cancellation_id) == 16);
static_assert_64bit(sizeof(SignalCPromiseMutPointerBackupRestoreResponse) == 24);
static_assert_64bit(alignof(SignalCPromiseMutPointerBackupRestoreResponse) == 8);
typedef SignalCPromiseMutPointerBackupRestoreResponse* SignalType_MutPointer_SignalCPromiseMutPointerBackupRestoreResponse;
static_assert_64bit(sizeof(SignalType_MutPointer_SignalCPromiseMutPointerBackupRestoreResponse) == 8);
static_assert_64bit(alignof(SignalType_MutPointer_SignalCPromiseMutPointerBackupRestoreResponse) == 8);
typedef void (*SignalType_FunctionPointer_void_SignalType_MutPointer_SignalFfiError_SignalType_ConstPointer_SignalMutPointerBackupStoreResponse_SignalType_ConstPointer_void)(SignalType_MutPointer_SignalFfiError, SignalType_ConstPointer_SignalMutPointerBackupStoreResponse, SignalType_ConstPointer_void);
static_assert_64bit(sizeof(SignalType_FunctionPointer_void_SignalType_MutPointer_SignalFfiError_SignalType_ConstPointer_SignalMutPointerBackupStoreResponse_SignalType_ConstPointer_void) == 8);
static_assert_64bit(alignof(SignalType_FunctionPointer_void_SignalType_MutPointer_SignalFfiError_SignalType_ConstPointer_SignalMutPointerBackupStoreResponse_SignalType_ConstPointer_void) == 8);
typedef struct {
  SignalType_FunctionPointer_void_SignalType_MutPointer_SignalFfiError_SignalType_ConstPointer_SignalMutPointerBackupStoreResponse_SignalType_ConstPointer_void complete;
  const void* context;
  uint64_t cancellation_id;
} SignalCPromiseMutPointerBackupStoreResponse;
static_assert_64bit(offsetof(SignalCPromiseMutPointerBackupStoreResponse, complete) == 0);
static_assert_64bit(offsetof(SignalCPromiseMutPointerBackupStoreResponse, context) == 8);
static_assert_64bit(offsetof(SignalCPromiseMutPointerBackupStoreResponse, cancellation_id) == 16);
static_assert_64bit(sizeof(SignalCPromiseMutPointerBackupStoreResponse) == 24);
static_assert_64bit(alignof(SignalCPromiseMutPointerBackupStoreResponse) == 8);
typedef SignalCPromiseMutPointerBackupStoreResponse* SignalType_MutPointer_SignalCPromiseMutPointerBackupStoreResponse;
static_assert_64bit(sizeof(SignalType_MutPointer_SignalCPromiseMutPointerBackupStoreResponse) == 8);
static_assert_64bit(alignof(SignalType_MutPointer_SignalCPromiseMutPointerBackupStoreResponse) == 8);
typedef void (*SignalType_FunctionPointer_void_SignalType_MutPointer_SignalFfiError_SignalType_ConstPointer_SignalMutPointerRegisterAccountResponse_SignalType_ConstPointer_void)(SignalType_MutPointer_SignalFfiError, SignalType_ConstPointer_SignalMutPointerRegisterAccountResponse, SignalType_ConstPointer_void);
static_assert_64bit(sizeof(SignalType_FunctionPointer_void_SignalType_MutPointer_SignalFfiError_SignalType_ConstPointer_SignalMutPointerRegisterAccountResponse_SignalType_ConstPointer_void) == 8);
static_assert_64bit(alignof(SignalType_FunctionPointer_void_SignalType_MutPointer_SignalFfiError_SignalType_ConstPointer_SignalMutPointerRegisterAccountResponse_SignalType_ConstPointer_void) == 8);
typedef struct {
  SignalType_FunctionPointer_void_SignalType_MutPointer_SignalFfiError_SignalType_ConstPointer_SignalMutPointerRegisterAccountResponse_SignalType_ConstPointer_void complete;
  const void* context;
  uint64_t cancellation_id;
} SignalCPromiseMutPointerRegisterAccountResponse;
static_assert_64bit(offsetof(SignalCPromiseMutPointerRegisterAccountResponse, complete) == 0);
static_assert_64bit(offsetof(SignalCPromiseMutPointerRegisterAccountResponse, context) == 8);
static_assert_64bit(offsetof(SignalCPromiseMutPointerRegisterAccountResponse, cancellation_id) == 16);
static_assert_64bit(sizeof(SignalCPromiseMutPointerRegisterAccountResponse) == 24);
static_assert_64bit(alignof(SignalCPromiseMutPointerRegisterAccountResponse) == 8);
typedef SignalCPromiseMutPointerRegisterAccountResponse* SignalType_MutPointer_SignalCPromiseMutPointerRegisterAccountResponse;
static_assert_64bit(sizeof(SignalType_MutPointer_SignalCPromiseMutPointerRegisterAccountResponse) == 8);
static_assert_64bit(alignof(SignalType_MutPointer_SignalCPromiseMutPointerRegisterAccountResponse) == 8);
typedef void (*SignalType_FunctionPointer_void_SignalType_MutPointer_SignalFfiError_SignalType_ConstPointer_SignalOptionalPairOfCStringPtrc_uchar32_SignalType_ConstPointer_void)(SignalType_MutPointer_SignalFfiError, SignalType_ConstPointer_SignalOptionalPairOfCStringPtrc_uchar32, SignalType_ConstPointer_void);
static_assert_64bit(sizeof(SignalType_FunctionPointer_void_SignalType_MutPointer_SignalFfiError_SignalType_ConstPointer_SignalOptionalPairOfCStringPtrc_uchar32_SignalType_ConstPointer_void) == 8);
static_assert_64bit(alignof(SignalType_FunctionPointer_void_SignalType_MutPointer_SignalFfiError_SignalType_ConstPointer_SignalOptionalPairOfCStringPtrc_uchar32_SignalType_ConstPointer_void) == 8);
typedef struct {
  SignalType_FunctionPointer_void_SignalType_MutPointer_SignalFfiError_SignalType_ConstPointer_SignalOptionalPairOfCStringPtrc_uchar32_SignalType_ConstPointer_void complete;
  const void* context;
  uint64_t cancellation_id;
} SignalCPromiseOptionalPairOfCStringPtrc_uchar32;
static_assert_64bit(offsetof(SignalCPromiseOptionalPairOfCStringPtrc_uchar32, complete) == 0);
static_assert_64bit(offsetof(SignalCPromiseOptionalPairOfCStringPtrc_uchar32, context) == 8);
static_assert_64bit(offsetof(SignalCPromiseOptionalPairOfCStringPtrc_uchar32, cancellation_id) == 16);
static_assert_64bit(sizeof(SignalCPromiseOptionalPairOfCStringPtrc_uchar32) == 24);
static_assert_64bit(alignof(SignalCPromiseOptionalPairOfCStringPtrc_uchar32) == 8);
typedef SignalCPromiseOptionalPairOfCStringPtrc_uchar32* SignalType_MutPointer_SignalCPromiseOptionalPairOfCStringPtrc_uchar32;
static_assert_64bit(sizeof(SignalType_MutPointer_SignalCPromiseOptionalPairOfCStringPtrc_uchar32) == 8);
static_assert_64bit(alignof(SignalType_MutPointer_SignalCPromiseOptionalPairOfCStringPtrc_uchar32) == 8);
typedef void (*SignalType_FunctionPointer_void_SignalType_MutPointer_SignalFfiError_SignalType_ConstPointer_SignalOptionalUuid_SignalType_ConstPointer_void)(SignalType_MutPointer_SignalFfiError, SignalType_ConstPointer_SignalOptionalUuid, SignalType_ConstPointer_void);
static_assert_64bit(sizeof(SignalType_FunctionPointer_void_SignalType_MutPointer_SignalFfiError_SignalType_ConstPointer_SignalOptionalUuid_SignalType_ConstPointer_void) == 8);
static_assert_64bit(alignof(SignalType_FunctionPointer_void_SignalType_MutPointer_SignalFfiError_SignalType_ConstPointer_SignalOptionalUuid_SignalType_ConstPointer_void) == 8);
typedef struct {
  SignalType_FunctionPointer_void_SignalType_MutPointer_SignalFfiError_SignalType_ConstPointer_SignalOptionalUuid_SignalType_ConstPointer_void complete;
  const void* context;
  uint64_t cancellation_id;
} SignalCPromiseOptionalUuid;
static_assert_64bit(offsetof(SignalCPromiseOptionalUuid, complete) == 0);
static_assert_64bit(offsetof(SignalCPromiseOptionalUuid, context) == 8);
static_assert_64bit(offsetof(SignalCPromiseOptionalUuid, cancellation_id) == 16);
static_assert_64bit(sizeof(SignalCPromiseOptionalUuid) == 24);
static_assert_64bit(alignof(SignalCPromiseOptionalUuid) == 8);
typedef SignalCPromiseOptionalUuid* SignalType_MutPointer_SignalCPromiseOptionalUuid;
static_assert_64bit(sizeof(SignalType_MutPointer_SignalCPromiseOptionalUuid) == 8);
static_assert_64bit(alignof(SignalType_MutPointer_SignalCPromiseOptionalUuid) == 8);
typedef void (*SignalType_FunctionPointer_void_SignalType_MutPointer_SignalFfiError_SignalType_ConstPointer_SignalOwnedBufferOfc_uchar17_SignalType_ConstPointer_void)(SignalType_MutPointer_SignalFfiError, SignalType_ConstPointer_SignalOwnedBufferOfc_uchar17, SignalType_ConstPointer_void);
static_assert_64bit(sizeof(SignalType_FunctionPointer_void_SignalType_MutPointer_SignalFfiError_SignalType_ConstPointer_SignalOwnedBufferOfc_uchar17_SignalType_ConstPointer_void) == 8);
static_assert_64bit(alignof(SignalType_FunctionPointer_void_SignalType_MutPointer_SignalFfiError_SignalType_ConstPointer_SignalOwnedBufferOfc_uchar17_SignalType_ConstPointer_void) == 8);
typedef struct {
  SignalType_FunctionPointer_void_SignalType_MutPointer_SignalFfiError_SignalType_ConstPointer_SignalOwnedBufferOfc_uchar17_SignalType_ConstPointer_void complete;
  const void* context;
  uint64_t cancellation_id;
} SignalCPromiseOwnedBufferOfc_uchar17;
static_assert_64bit(offsetof(SignalCPromiseOwnedBufferOfc_uchar17, complete) == 0);
static_assert_64bit(offsetof(SignalCPromiseOwnedBufferOfc_uchar17, context) == 8);
static_assert_64bit(offsetof(SignalCPromiseOwnedBufferOfc_uchar17, cancellation_id) == 16);
static_assert_64bit(sizeof(SignalCPromiseOwnedBufferOfc_uchar17) == 24);
static_assert_64bit(alignof(SignalCPromiseOwnedBufferOfc_uchar17) == 8);
typedef SignalCPromiseOwnedBufferOfc_uchar17* SignalType_MutPointer_SignalCPromiseOwnedBufferOfc_uchar17;
static_assert_64bit(sizeof(SignalType_MutPointer_SignalCPromiseOwnedBufferOfc_uchar17) == 8);
static_assert_64bit(alignof(SignalType_MutPointer_SignalCPromiseOwnedBufferOfc_uchar17) == 8);
typedef void (*SignalType_FunctionPointer_void_SignalType_MutPointer_SignalFfiError_SignalType_ConstPointer_SignalOwnedBuffer_SignalType_ConstPointer_void)(SignalType_MutPointer_SignalFfiError, SignalType_ConstPointer_SignalOwnedBuffer, SignalType_ConstPointer_void);
static_assert_64bit(sizeof(SignalType_FunctionPointer_void_SignalType_MutPointer_SignalFfiError_SignalType_ConstPointer_SignalOwnedBuffer_SignalType_ConstPointer_void) == 8);
static_assert_64bit(alignof(SignalType_FunctionPointer_void_SignalType_MutPointer_SignalFfiError_SignalType_ConstPointer_SignalOwnedBuffer_SignalType_ConstPointer_void) == 8);
typedef struct {
  SignalType_FunctionPointer_void_SignalType_MutPointer_SignalFfiError_SignalType_ConstPointer_SignalOwnedBuffer_SignalType_ConstPointer_void complete;
  const void* context;
  uint64_t cancellation_id;
} SignalCPromiseOwnedBuffer;
static_assert_64bit(offsetof(SignalCPromiseOwnedBuffer, complete) == 0);
static_assert_64bit(offsetof(SignalCPromiseOwnedBuffer, context) == 8);
static_assert_64bit(offsetof(SignalCPromiseOwnedBuffer, cancellation_id) == 16);
static_assert_64bit(sizeof(SignalCPromiseOwnedBuffer) == 24);
static_assert_64bit(alignof(SignalCPromiseOwnedBuffer) == 8);
typedef SignalCPromiseOwnedBuffer* SignalType_MutPointer_SignalCPromiseOwnedBuffer;
static_assert_64bit(sizeof(SignalType_MutPointer_SignalCPromiseOwnedBuffer) == 8);
static_assert_64bit(alignof(SignalType_MutPointer_SignalCPromiseOwnedBuffer) == 8);
typedef void (*SignalType_FunctionPointer_void_SignalType_MutPointer_SignalFfiError_SignalType_ConstPointer_SignalOwnedBufferOfMaxAlignedLinkedDeviceInternalFfiResult_SignalType_ConstPointer_void)(SignalType_MutPointer_SignalFfiError, SignalType_ConstPointer_SignalOwnedBufferOfMaxAlignedLinkedDeviceInternalFfiResult, SignalType_ConstPointer_void);
static_assert_64bit(sizeof(SignalType_FunctionPointer_void_SignalType_MutPointer_SignalFfiError_SignalType_ConstPointer_SignalOwnedBufferOfMaxAlignedLinkedDeviceInternalFfiResult_SignalType_ConstPointer_void) == 8);
static_assert_64bit(alignof(SignalType_FunctionPointer_void_SignalType_MutPointer_SignalFfiError_SignalType_ConstPointer_SignalOwnedBufferOfMaxAlignedLinkedDeviceInternalFfiResult_SignalType_ConstPointer_void) == 8);
typedef struct {
  SignalType_FunctionPointer_void_SignalType_MutPointer_SignalFfiError_SignalType_ConstPointer_SignalOwnedBufferOfMaxAlignedLinkedDeviceInternalFfiResult_SignalType_ConstPointer_void complete;
  const void* context;
  uint64_t cancellation_id;
} SignalCPromiseOwnedBufferOfMaxAlignedLinkedDeviceInternalFfiResult;
static_assert_64bit(offsetof(SignalCPromiseOwnedBufferOfMaxAlignedLinkedDeviceInternalFfiResult, complete) == 0);
static_assert_64bit(offsetof(SignalCPromiseOwnedBufferOfMaxAlignedLinkedDeviceInternalFfiResult, context) == 8);
static_assert_64bit(offsetof(SignalCPromiseOwnedBufferOfMaxAlignedLinkedDeviceInternalFfiResult, cancellation_id) == 16);
static_assert_64bit(sizeof(SignalCPromiseOwnedBufferOfMaxAlignedLinkedDeviceInternalFfiResult) == 24);
static_assert_64bit(alignof(SignalCPromiseOwnedBufferOfMaxAlignedLinkedDeviceInternalFfiResult) == 8);
typedef SignalCPromiseOwnedBufferOfMaxAlignedLinkedDeviceInternalFfiResult* SignalType_MutPointer_SignalCPromiseOwnedBufferOfMaxAlignedLinkedDeviceInternalFfiResult;
static_assert_64bit(sizeof(SignalType_MutPointer_SignalCPromiseOwnedBufferOfMaxAlignedLinkedDeviceInternalFfiResult) == 8);
static_assert_64bit(alignof(SignalType_MutPointer_SignalCPromiseOwnedBufferOfMaxAlignedLinkedDeviceInternalFfiResult) == 8);
typedef void (*SignalType_FunctionPointer_void_SignalType_MutPointer_SignalFfiError_SignalType_ConstPointer_SignalPairOfCStringPtrCStringPtr_SignalType_ConstPointer_void)(SignalType_MutPointer_SignalFfiError, SignalType_ConstPointer_SignalPairOfCStringPtrCStringPtr, SignalType_ConstPointer_void);
static_assert_64bit(sizeof(SignalType_FunctionPointer_void_SignalType_MutPointer_SignalFfiError_SignalType_ConstPointer_SignalPairOfCStringPtrCStringPtr_SignalType_ConstPointer_void) == 8);
static_assert_64bit(alignof(SignalType_FunctionPointer_void_SignalType_MutPointer_SignalFfiError_SignalType_ConstPointer_SignalPairOfCStringPtrCStringPtr_SignalType_ConstPointer_void) == 8);
typedef struct {
  SignalType_FunctionPointer_void_SignalType_MutPointer_SignalFfiError_SignalType_ConstPointer_SignalPairOfCStringPtrCStringPtr_SignalType_ConstPointer_void complete;
  const void* context;
  uint64_t cancellation_id;
} SignalCPromisePairOfCStringPtrCStringPtr;
static_assert_64bit(offsetof(SignalCPromisePairOfCStringPtrCStringPtr, complete) == 0);
static_assert_64bit(offsetof(SignalCPromisePairOfCStringPtrCStringPtr, context) == 8);
static_assert_64bit(offsetof(SignalCPromisePairOfCStringPtrCStringPtr, cancellation_id) == 16);
static_assert_64bit(sizeof(SignalCPromisePairOfCStringPtrCStringPtr) == 24);
static_assert_64bit(alignof(SignalCPromisePairOfCStringPtrCStringPtr) == 8);
typedef SignalCPromisePairOfCStringPtrCStringPtr* SignalType_MutPointer_SignalCPromisePairOfCStringPtrCStringPtr;
static_assert_64bit(sizeof(SignalType_MutPointer_SignalCPromisePairOfCStringPtrCStringPtr) == 8);
static_assert_64bit(alignof(SignalType_MutPointer_SignalCPromisePairOfCStringPtrCStringPtr) == 8);
typedef void (*SignalType_FunctionPointer_void_SignalType_MutPointer_SignalFfiError_SignalType_ConstPointer_SignalPairOfOwnedBufferOfCStringPtrOwnedBufferOfCStringPtr_SignalType_ConstPointer_void)(SignalType_MutPointer_SignalFfiError, SignalType_ConstPointer_SignalPairOfOwnedBufferOfCStringPtrOwnedBufferOfCStringPtr, SignalType_ConstPointer_void);
static_assert_64bit(sizeof(SignalType_FunctionPointer_void_SignalType_MutPointer_SignalFfiError_SignalType_ConstPointer_SignalPairOfOwnedBufferOfCStringPtrOwnedBufferOfCStringPtr_SignalType_ConstPointer_void) == 8);
static_assert_64bit(alignof(SignalType_FunctionPointer_void_SignalType_MutPointer_SignalFfiError_SignalType_ConstPointer_SignalPairOfOwnedBufferOfCStringPtrOwnedBufferOfCStringPtr_SignalType_ConstPointer_void) == 8);
typedef struct {
  SignalType_FunctionPointer_void_SignalType_MutPointer_SignalFfiError_SignalType_ConstPointer_SignalPairOfOwnedBufferOfCStringPtrOwnedBufferOfCStringPtr_SignalType_ConstPointer_void complete;
  const void* context;
  uint64_t cancellation_id;
} SignalCPromisePairOfOwnedBufferOfCStringPtrOwnedBufferOfCStringPtr;
static_assert_64bit(offsetof(SignalCPromisePairOfOwnedBufferOfCStringPtrOwnedBufferOfCStringPtr, complete) == 0);
static_assert_64bit(offsetof(SignalCPromisePairOfOwnedBufferOfCStringPtrOwnedBufferOfCStringPtr, context) == 8);
static_assert_64bit(offsetof(SignalCPromisePairOfOwnedBufferOfCStringPtrOwnedBufferOfCStringPtr, cancellation_id) == 16);
static_assert_64bit(sizeof(SignalCPromisePairOfOwnedBufferOfCStringPtrOwnedBufferOfCStringPtr) == 24);
static_assert_64bit(alignof(SignalCPromisePairOfOwnedBufferOfCStringPtrOwnedBufferOfCStringPtr) == 8);
typedef SignalCPromisePairOfOwnedBufferOfCStringPtrOwnedBufferOfCStringPtr* SignalType_MutPointer_SignalCPromisePairOfOwnedBufferOfCStringPtrOwnedBufferOfCStringPtr;
static_assert_64bit(sizeof(SignalType_MutPointer_SignalCPromisePairOfOwnedBufferOfCStringPtrOwnedBufferOfCStringPtr) == 8);
static_assert_64bit(alignof(SignalType_MutPointer_SignalCPromisePairOfOwnedBufferOfCStringPtrOwnedBufferOfCStringPtr) == 8);
typedef void (*SignalType_FunctionPointer_void_SignalType_MutPointer_SignalFfiError_SignalType_ConstPointer_SignalPairOfOwnedBufferOwnedBuffer_SignalType_ConstPointer_void)(SignalType_MutPointer_SignalFfiError, SignalType_ConstPointer_SignalPairOfOwnedBufferOwnedBuffer, SignalType_ConstPointer_void);
static_assert_64bit(sizeof(SignalType_FunctionPointer_void_SignalType_MutPointer_SignalFfiError_SignalType_ConstPointer_SignalPairOfOwnedBufferOwnedBuffer_SignalType_ConstPointer_void) == 8);
static_assert_64bit(alignof(SignalType_FunctionPointer_void_SignalType_MutPointer_SignalFfiError_SignalType_ConstPointer_SignalPairOfOwnedBufferOwnedBuffer_SignalType_ConstPointer_void) == 8);
typedef struct {
  SignalType_FunctionPointer_void_SignalType_MutPointer_SignalFfiError_SignalType_ConstPointer_SignalPairOfOwnedBufferOwnedBuffer_SignalType_ConstPointer_void complete;
  const void* context;
  uint64_t cancellation_id;
} SignalCPromisePairOfOwnedBufferOwnedBuffer;
static_assert_64bit(offsetof(SignalCPromisePairOfOwnedBufferOwnedBuffer, complete) == 0);
static_assert_64bit(offsetof(SignalCPromisePairOfOwnedBufferOwnedBuffer, context) == 8);
static_assert_64bit(offsetof(SignalCPromisePairOfOwnedBufferOwnedBuffer, cancellation_id) == 16);
static_assert_64bit(sizeof(SignalCPromisePairOfOwnedBufferOwnedBuffer) == 24);
static_assert_64bit(alignof(SignalCPromisePairOfOwnedBufferOwnedBuffer) == 8);
typedef SignalCPromisePairOfOwnedBufferOwnedBuffer* SignalType_MutPointer_SignalCPromisePairOfOwnedBufferOwnedBuffer;
static_assert_64bit(sizeof(SignalType_MutPointer_SignalCPromisePairOfOwnedBufferOwnedBuffer) == 8);
static_assert_64bit(alignof(SignalType_MutPointer_SignalCPromisePairOfOwnedBufferOwnedBuffer) == 8);
typedef void (*SignalType_FunctionPointer_void_SignalType_MutPointer_SignalFfiError_SignalType_ConstPointer_SignalUuid_SignalType_ConstPointer_void)(SignalType_MutPointer_SignalFfiError, SignalType_ConstPointer_SignalUuid, SignalType_ConstPointer_void);
static_assert_64bit(sizeof(SignalType_FunctionPointer_void_SignalType_MutPointer_SignalFfiError_SignalType_ConstPointer_SignalUuid_SignalType_ConstPointer_void) == 8);
static_assert_64bit(alignof(SignalType_FunctionPointer_void_SignalType_MutPointer_SignalFfiError_SignalType_ConstPointer_SignalUuid_SignalType_ConstPointer_void) == 8);
typedef struct {
  SignalType_FunctionPointer_void_SignalType_MutPointer_SignalFfiError_SignalType_ConstPointer_SignalUuid_SignalType_ConstPointer_void complete;
  const void* context;
  uint64_t cancellation_id;
} SignalCPromiseUuid;
static_assert_64bit(offsetof(SignalCPromiseUuid, complete) == 0);
static_assert_64bit(offsetof(SignalCPromiseUuid, context) == 8);
static_assert_64bit(offsetof(SignalCPromiseUuid, cancellation_id) == 16);
static_assert_64bit(sizeof(SignalCPromiseUuid) == 24);
static_assert_64bit(alignof(SignalCPromiseUuid) == 8);
typedef SignalCPromiseUuid* SignalType_MutPointer_SignalCPromiseUuid;
static_assert_64bit(sizeof(SignalType_MutPointer_SignalCPromiseUuid) == 8);
static_assert_64bit(alignof(SignalType_MutPointer_SignalCPromiseUuid) == 8);
typedef void (*SignalType_FunctionPointer_void_SignalType_MutPointer_SignalFfiError_SignalType_ConstPointer_SignalCopyBackupMediaNextChunkFfiResult_SignalType_ConstPointer_void)(SignalType_MutPointer_SignalFfiError, SignalType_ConstPointer_SignalCopyBackupMediaNextChunkFfiResult, SignalType_ConstPointer_void);
static_assert_64bit(sizeof(SignalType_FunctionPointer_void_SignalType_MutPointer_SignalFfiError_SignalType_ConstPointer_SignalCopyBackupMediaNextChunkFfiResult_SignalType_ConstPointer_void) == 8);
static_assert_64bit(alignof(SignalType_FunctionPointer_void_SignalType_MutPointer_SignalFfiError_SignalType_ConstPointer_SignalCopyBackupMediaNextChunkFfiResult_SignalType_ConstPointer_void) == 8);
typedef struct {
  SignalType_FunctionPointer_void_SignalType_MutPointer_SignalFfiError_SignalType_ConstPointer_SignalCopyBackupMediaNextChunkFfiResult_SignalType_ConstPointer_void complete;
  const void* context;
  uint64_t cancellation_id;
} SignalCPromiseCopyBackupMediaNextChunkFfiResult;
static_assert_64bit(offsetof(SignalCPromiseCopyBackupMediaNextChunkFfiResult, complete) == 0);
static_assert_64bit(offsetof(SignalCPromiseCopyBackupMediaNextChunkFfiResult, context) == 8);
static_assert_64bit(offsetof(SignalCPromiseCopyBackupMediaNextChunkFfiResult, cancellation_id) == 16);
static_assert_64bit(sizeof(SignalCPromiseCopyBackupMediaNextChunkFfiResult) == 24);
static_assert_64bit(alignof(SignalCPromiseCopyBackupMediaNextChunkFfiResult) == 8);
typedef SignalCPromiseCopyBackupMediaNextChunkFfiResult* SignalType_MutPointer_SignalCPromiseCopyBackupMediaNextChunkFfiResult;
static_assert_64bit(sizeof(SignalType_MutPointer_SignalCPromiseCopyBackupMediaNextChunkFfiResult) == 8);
static_assert_64bit(alignof(SignalType_MutPointer_SignalCPromiseCopyBackupMediaNextChunkFfiResult) == 8);
typedef uint16_t* SignalType_MutPointer_uint16_t;
static_assert_64bit(sizeof(SignalType_MutPointer_uint16_t) == 8);
static_assert_64bit(alignof(SignalType_MutPointer_uint16_t) == 8);
typedef uint64_t* SignalType_MutPointer_uint64_t;
static_assert_64bit(sizeof(SignalType_MutPointer_uint64_t) == 8);
static_assert_64bit(alignof(SignalType_MutPointer_uint64_t) == 8);
typedef enum {
  SignalLogLevelError = 1,
  SignalLogLevelWarn = 2,
  SignalLogLevelInfo = 3,
  SignalLogLevelDebug = 4,
  SignalLogLevelTrace = 5,
} SignalLogLevel;
static_assert_64bit(sizeof(SignalLogLevel) == 4);
static_assert_64bit(alignof(SignalLogLevel) == 4);
typedef int32_t (*SignalType_FunctionPointer_int32_t_SignalType_MutPointer_void_SignalLogLevel_SignalCStringPtr_uint32_t_SignalCStringPtr)(SignalType_MutPointer_void, SignalLogLevel, SignalCStringPtr, uint32_t, SignalCStringPtr);
static_assert_64bit(sizeof(SignalType_FunctionPointer_int32_t_SignalType_MutPointer_void_SignalLogLevel_SignalCStringPtr_uint32_t_SignalCStringPtr) == 8);
static_assert_64bit(alignof(SignalType_FunctionPointer_int32_t_SignalType_MutPointer_void_SignalLogLevel_SignalCStringPtr_uint32_t_SignalCStringPtr) == 8);
typedef struct {
  const size_t* base;
  size_t length;
} SignalBorrowedSliceOfusize;
static_assert_64bit(offsetof(SignalBorrowedSliceOfusize, base) == 0);
static_assert_64bit(offsetof(SignalBorrowedSliceOfusize, length) == 8);
static_assert_64bit(sizeof(SignalBorrowedSliceOfusize) == 16);
static_assert_64bit(alignof(SignalBorrowedSliceOfusize) == 8);
typedef struct {
  SignalBorrowedBuffer bytes;
  SignalBorrowedSliceOfusize lengths;
} SignalBorrowedBytestringArray;
static_assert_64bit(offsetof(SignalBorrowedBytestringArray, bytes) == 0);
static_assert_64bit(offsetof(SignalBorrowedBytestringArray, lengths) == 16);
static_assert_64bit(sizeof(SignalBorrowedBytestringArray) == 32);
static_assert_64bit(alignof(SignalBorrowedBytestringArray) == 8);
typedef struct {
  const SignalType_ConstPointer_SignalType_FixedArray32_uint8_t* base;
  size_t length;
} SignalBorrowedSliceOfc_uchar32;
static_assert_64bit(offsetof(SignalBorrowedSliceOfc_uchar32, base) == 0);
static_assert_64bit(offsetof(SignalBorrowedSliceOfc_uchar32, length) == 8);
static_assert_64bit(sizeof(SignalBorrowedSliceOfc_uchar32) == 16);
static_assert_64bit(alignof(SignalBorrowedSliceOfc_uchar32) == 8);
typedef struct {
  const SignalBorrowedBuffer* base;
  size_t length;
} SignalBorrowedSliceOfBuffers;
static_assert_64bit(offsetof(SignalBorrowedSliceOfBuffers, base) == 0);
static_assert_64bit(offsetof(SignalBorrowedSliceOfBuffers, length) == 8);
static_assert_64bit(sizeof(SignalBorrowedSliceOfBuffers) == 16);
static_assert_64bit(alignof(SignalBorrowedSliceOfBuffers) == 8);
typedef struct {
  const SignalConstPointerProtocolAddress* base;
  size_t length;
} SignalBorrowedSliceOfConstPointerProtocolAddress;
static_assert_64bit(offsetof(SignalBorrowedSliceOfConstPointerProtocolAddress, base) == 0);
static_assert_64bit(offsetof(SignalBorrowedSliceOfConstPointerProtocolAddress, length) == 8);
static_assert_64bit(sizeof(SignalBorrowedSliceOfConstPointerProtocolAddress) == 16);
static_assert_64bit(alignof(SignalBorrowedSliceOfConstPointerProtocolAddress) == 8);
typedef struct {
  const SignalConstPointerPublicKey* base;
  size_t length;
} SignalBorrowedSliceOfConstPointerPublicKey;
static_assert_64bit(offsetof(SignalBorrowedSliceOfConstPointerPublicKey, base) == 0);
static_assert_64bit(offsetof(SignalBorrowedSliceOfConstPointerPublicKey, length) == 8);
static_assert_64bit(sizeof(SignalBorrowedSliceOfConstPointerPublicKey) == 16);
static_assert_64bit(alignof(SignalBorrowedSliceOfConstPointerPublicKey) == 8);
typedef struct {
  const SignalConstPointerCiphertextMessage* base;
  size_t length;
} SignalBorrowedSliceOfConstPointerCiphertextMessage;
static_assert_64bit(offsetof(SignalBorrowedSliceOfConstPointerCiphertextMessage, base) == 0);
static_assert_64bit(offsetof(SignalBorrowedSliceOfConstPointerCiphertextMessage, length) == 8);
static_assert_64bit(sizeof(SignalBorrowedSliceOfConstPointerCiphertextMessage) == 16);
static_assert_64bit(alignof(SignalBorrowedSliceOfConstPointerCiphertextMessage) == 8);
typedef struct {
  const SignalConstPointerSessionRecord* base;
  size_t length;
} SignalBorrowedSliceOfConstPointerSessionRecord;
static_assert_64bit(offsetof(SignalBorrowedSliceOfConstPointerSessionRecord, base) == 0);
static_assert_64bit(offsetof(SignalBorrowedSliceOfConstPointerSessionRecord, length) == 8);
static_assert_64bit(sizeof(SignalBorrowedSliceOfConstPointerSessionRecord) == 16);
static_assert_64bit(alignof(SignalBorrowedSliceOfConstPointerSessionRecord) == 8);
typedef struct {
  const SignalBridgeCopyBackupMediaItemFfiArg* base;
  size_t length;
} SignalBorrowedSliceOfBridgeCopyBackupMediaItemFfiArg;
static_assert_64bit(offsetof(SignalBorrowedSliceOfBridgeCopyBackupMediaItemFfiArg, base) == 0);
static_assert_64bit(offsetof(SignalBorrowedSliceOfBridgeCopyBackupMediaItemFfiArg, length) == 8);
static_assert_64bit(sizeof(SignalBorrowedSliceOfBridgeCopyBackupMediaItemFfiArg) == 16);
static_assert_64bit(alignof(SignalBorrowedSliceOfBridgeCopyBackupMediaItemFfiArg) == 8);
typedef struct {
  const uint32_t* base;
  size_t length;
} SignalBorrowedSliceOfu32;
static_assert_64bit(offsetof(SignalBorrowedSliceOfu32, base) == 0);
static_assert_64bit(offsetof(SignalBorrowedSliceOfu32, length) == 8);
static_assert_64bit(sizeof(SignalBorrowedSliceOfu32) == 16);
static_assert_64bit(alignof(SignalBorrowedSliceOfu32) == 8);
typedef struct {
  const SignalPinHash* raw;
} SignalConstPointerPinHash;
static_assert_64bit(offsetof(SignalConstPointerPinHash, raw) == 0);
static_assert_64bit(sizeof(SignalConstPointerPinHash) == 8);
static_assert_64bit(alignof(SignalConstPointerPinHash) == 8);
typedef struct {
  const SignalAes256GcmSiv* raw;
} SignalConstPointerAes256GcmSiv;
static_assert_64bit(offsetof(SignalConstPointerAes256GcmSiv, raw) == 0);
static_assert_64bit(sizeof(SignalConstPointerAes256GcmSiv) == 8);
static_assert_64bit(alignof(SignalConstPointerAes256GcmSiv) == 8);
typedef struct {
  const SignalFfiConnectChatBridgeStruct* raw;
} SignalConstPointerFfiConnectChatBridgeStruct;
static_assert_64bit(offsetof(SignalConstPointerFfiConnectChatBridgeStruct, raw) == 0);
static_assert_64bit(sizeof(SignalConstPointerFfiConnectChatBridgeStruct) == 8);
static_assert_64bit(alignof(SignalConstPointerFfiConnectChatBridgeStruct) == 8);
typedef struct {
  const SignalHsmEnclaveClient* raw;
} SignalConstPointerHsmEnclaveClient;
static_assert_64bit(offsetof(SignalConstPointerHsmEnclaveClient, raw) == 0);
static_assert_64bit(sizeof(SignalConstPointerHsmEnclaveClient) == 8);
static_assert_64bit(alignof(SignalConstPointerHsmEnclaveClient) == 8);
typedef struct {
  const SignalFfiSyncInputStreamStruct* raw;
} SignalConstPointerFfiSyncInputStreamStruct;
static_assert_64bit(offsetof(SignalConstPointerFfiSyncInputStreamStruct, raw) == 0);
static_assert_64bit(sizeof(SignalConstPointerFfiSyncInputStreamStruct) == 8);
static_assert_64bit(alignof(SignalConstPointerFfiSyncInputStreamStruct) == 8);
typedef struct {
  const SignalMessageBackupKey* raw;
} SignalConstPointerMessageBackupKey;
static_assert_64bit(offsetof(SignalConstPointerMessageBackupKey, raw) == 0);
static_assert_64bit(sizeof(SignalConstPointerMessageBackupKey) == 8);
static_assert_64bit(alignof(SignalConstPointerMessageBackupKey) == 8);
typedef struct {
  const SignalMessageBackupValidationOutcome* raw;
} SignalConstPointerMessageBackupValidationOutcome;
static_assert_64bit(offsetof(SignalConstPointerMessageBackupValidationOutcome, raw) == 0);
static_assert_64bit(sizeof(SignalConstPointerMessageBackupValidationOutcome) == 8);
static_assert_64bit(alignof(SignalConstPointerMessageBackupValidationOutcome) == 8);
typedef struct {
  const SignalConnectionManager* raw;
} SignalConstPointerConnectionManager;
static_assert_64bit(offsetof(SignalConstPointerConnectionManager, raw) == 0);
static_assert_64bit(sizeof(SignalConstPointerConnectionManager) == 8);
static_assert_64bit(alignof(SignalConstPointerConnectionManager) == 8);
typedef struct {
  const SignalCdsiLookup* raw;
} SignalConstPointerCdsiLookup;
static_assert_64bit(offsetof(SignalConstPointerCdsiLookup, raw) == 0);
static_assert_64bit(sizeof(SignalConstPointerCdsiLookup) == 8);
static_assert_64bit(alignof(SignalConstPointerCdsiLookup) == 8);
typedef struct {
  const SignalLookupRequest* raw;
} SignalConstPointerLookupRequest;
static_assert_64bit(offsetof(SignalConstPointerLookupRequest, raw) == 0);
static_assert_64bit(sizeof(SignalConstPointerLookupRequest) == 8);
static_assert_64bit(alignof(SignalConstPointerLookupRequest) == 8);
typedef struct {
  const SignalAuthenticatedChatConnection* raw;
} SignalConstPointerAuthenticatedChatConnection;
static_assert_64bit(offsetof(SignalConstPointerAuthenticatedChatConnection, raw) == 0);
static_assert_64bit(sizeof(SignalConstPointerAuthenticatedChatConnection) == 8);
static_assert_64bit(alignof(SignalConstPointerAuthenticatedChatConnection) == 8);
typedef struct {
  const SignalCopyBackupMediaStream* raw;
} SignalConstPointerCopyBackupMediaStream;
static_assert_64bit(offsetof(SignalConstPointerCopyBackupMediaStream, raw) == 0);
static_assert_64bit(sizeof(SignalConstPointerCopyBackupMediaStream) == 8);
static_assert_64bit(alignof(SignalConstPointerCopyBackupMediaStream) == 8);
typedef struct {
  const SignalFfiChatListenerStruct* raw;
} SignalConstPointerFfiChatListenerStruct;
static_assert_64bit(offsetof(SignalConstPointerFfiChatListenerStruct, raw) == 0);
static_assert_64bit(sizeof(SignalConstPointerFfiChatListenerStruct) == 8);
static_assert_64bit(alignof(SignalConstPointerFfiChatListenerStruct) == 8);
typedef struct {
  const SignalFfiProvisioningListenerStruct* raw;
} SignalConstPointerFfiProvisioningListenerStruct;
static_assert_64bit(offsetof(SignalConstPointerFfiProvisioningListenerStruct, raw) == 0);
static_assert_64bit(sizeof(SignalConstPointerFfiProvisioningListenerStruct) == 8);
static_assert_64bit(alignof(SignalConstPointerFfiProvisioningListenerStruct) == 8);
typedef struct {
  const SignalHttpRequest* raw;
} SignalConstPointerHttpRequest;
static_assert_64bit(offsetof(SignalConstPointerHttpRequest, raw) == 0);
static_assert_64bit(sizeof(SignalConstPointerHttpRequest) == 8);
static_assert_64bit(alignof(SignalConstPointerHttpRequest) == 8);
typedef struct {
  const SignalProvisioningChatConnection* raw;
} SignalConstPointerProvisioningChatConnection;
static_assert_64bit(offsetof(SignalConstPointerProvisioningChatConnection, raw) == 0);
static_assert_64bit(sizeof(SignalConstPointerProvisioningChatConnection) == 8);
static_assert_64bit(alignof(SignalConstPointerProvisioningChatConnection) == 8);
typedef struct {
  const SignalServerMessageAck* raw;
} SignalConstPointerServerMessageAck;
static_assert_64bit(offsetof(SignalConstPointerServerMessageAck, raw) == 0);
static_assert_64bit(sizeof(SignalConstPointerServerMessageAck) == 8);
static_assert_64bit(alignof(SignalConstPointerServerMessageAck) == 8);
typedef struct {
  const SignalUnauthenticatedChatConnection* raw;
} SignalConstPointerUnauthenticatedChatConnection;
static_assert_64bit(offsetof(SignalConstPointerUnauthenticatedChatConnection, raw) == 0);
static_assert_64bit(sizeof(SignalConstPointerUnauthenticatedChatConnection) == 8);
static_assert_64bit(alignof(SignalConstPointerUnauthenticatedChatConnection) == 8);
typedef struct {
  const SignalRegistrationAccountAttributes* raw;
} SignalConstPointerRegistrationAccountAttributes;
static_assert_64bit(offsetof(SignalConstPointerRegistrationAccountAttributes, raw) == 0);
static_assert_64bit(sizeof(SignalConstPointerRegistrationAccountAttributes) == 8);
static_assert_64bit(alignof(SignalConstPointerRegistrationAccountAttributes) == 8);
typedef struct {
  const SignalRegisterAccountRequest* raw;
} SignalConstPointerRegisterAccountRequest;
static_assert_64bit(offsetof(SignalConstPointerRegisterAccountRequest, raw) == 0);
static_assert_64bit(sizeof(SignalConstPointerRegisterAccountRequest) == 8);
static_assert_64bit(alignof(SignalConstPointerRegisterAccountRequest) == 8);
typedef struct {
  const SignalRegistrationService* raw;
} SignalConstPointerRegistrationService;
static_assert_64bit(offsetof(SignalConstPointerRegistrationService, raw) == 0);
static_assert_64bit(sizeof(SignalConstPointerRegistrationService) == 8);
static_assert_64bit(alignof(SignalConstPointerRegistrationService) == 8);
typedef struct {
  const SignalTokioAsyncContext* raw;
} SignalConstPointerTokioAsyncContext;
static_assert_64bit(offsetof(SignalConstPointerTokioAsyncContext, raw) == 0);
static_assert_64bit(sizeof(SignalConstPointerTokioAsyncContext) == 8);
static_assert_64bit(alignof(SignalConstPointerTokioAsyncContext) == 8);
typedef struct {
  const SignalFfiIdentityKeyStoreStruct* raw;
} SignalConstPointerFfiIdentityKeyStoreStruct;
static_assert_64bit(offsetof(SignalConstPointerFfiIdentityKeyStoreStruct, raw) == 0);
static_assert_64bit(sizeof(SignalConstPointerFfiIdentityKeyStoreStruct) == 8);
static_assert_64bit(alignof(SignalConstPointerFfiIdentityKeyStoreStruct) == 8);
typedef struct {
  const SignalFfiKyberPreKeyStoreStruct* raw;
} SignalConstPointerFfiKyberPreKeyStoreStruct;
static_assert_64bit(offsetof(SignalConstPointerFfiKyberPreKeyStoreStruct, raw) == 0);
static_assert_64bit(sizeof(SignalConstPointerFfiKyberPreKeyStoreStruct) == 8);
static_assert_64bit(alignof(SignalConstPointerFfiKyberPreKeyStoreStruct) == 8);
typedef struct {
  const SignalFfiPreKeyStoreStruct* raw;
} SignalConstPointerFfiPreKeyStoreStruct;
static_assert_64bit(offsetof(SignalConstPointerFfiPreKeyStoreStruct, raw) == 0);
static_assert_64bit(sizeof(SignalConstPointerFfiPreKeyStoreStruct) == 8);
static_assert_64bit(alignof(SignalConstPointerFfiPreKeyStoreStruct) == 8);
typedef struct {
  const SignalFfiSenderKeyStoreStruct* raw;
} SignalConstPointerFfiSenderKeyStoreStruct;
static_assert_64bit(offsetof(SignalConstPointerFfiSenderKeyStoreStruct, raw) == 0);
static_assert_64bit(sizeof(SignalConstPointerFfiSenderKeyStoreStruct) == 8);
static_assert_64bit(alignof(SignalConstPointerFfiSenderKeyStoreStruct) == 8);
typedef struct {
  const SignalFfiSessionStoreStruct* raw;
} SignalConstPointerFfiSessionStoreStruct;
static_assert_64bit(offsetof(SignalConstPointerFfiSessionStoreStruct, raw) == 0);
static_assert_64bit(sizeof(SignalConstPointerFfiSessionStoreStruct) == 8);
static_assert_64bit(alignof(SignalConstPointerFfiSessionStoreStruct) == 8);
typedef struct {
  const SignalFfiSignedPreKeyStoreStruct* raw;
} SignalConstPointerFfiSignedPreKeyStoreStruct;
static_assert_64bit(offsetof(SignalConstPointerFfiSignedPreKeyStoreStruct, raw) == 0);
static_assert_64bit(sizeof(SignalConstPointerFfiSignedPreKeyStoreStruct) == 8);
static_assert_64bit(alignof(SignalConstPointerFfiSignedPreKeyStoreStruct) == 8);
typedef struct {
  const SignalSgxClientState* raw;
} SignalConstPointerSgxClientState;
static_assert_64bit(offsetof(SignalConstPointerSgxClientState, raw) == 0);
static_assert_64bit(sizeof(SignalConstPointerSgxClientState) == 8);
static_assert_64bit(alignof(SignalConstPointerSgxClientState) == 8);
typedef struct {
  const SignalBridgedStringMap* raw;
} SignalConstPointerBridgedStringMap;
static_assert_64bit(offsetof(SignalConstPointerBridgedStringMap, raw) == 0);
static_assert_64bit(sizeof(SignalConstPointerBridgedStringMap) == 8);
static_assert_64bit(alignof(SignalConstPointerBridgedStringMap) == 8);
typedef struct {
  const SignalPrivateKey* raw;
} SignalConstPointerPrivateKey;
static_assert_64bit(offsetof(SignalConstPointerPrivateKey, raw) == 0);
static_assert_64bit(sizeof(SignalConstPointerPrivateKey) == 8);
static_assert_64bit(alignof(SignalConstPointerPrivateKey) == 8);
typedef struct {
  const SignalChatConnectionInfo* raw;
} SignalConstPointerChatConnectionInfo;
static_assert_64bit(offsetof(SignalConstPointerChatConnectionInfo, raw) == 0);
static_assert_64bit(sizeof(SignalConstPointerChatConnectionInfo) == 8);
static_assert_64bit(alignof(SignalConstPointerChatConnectionInfo) == 8);
typedef struct {
  const SignalBackupRestoreResponse* raw;
} SignalConstPointerBackupRestoreResponse;
static_assert_64bit(offsetof(SignalConstPointerBackupRestoreResponse, raw) == 0);
static_assert_64bit(sizeof(SignalConstPointerBackupRestoreResponse) == 8);
static_assert_64bit(alignof(SignalConstPointerBackupRestoreResponse) == 8);
typedef struct {
  const SignalBackupStoreResponse* raw;
} SignalConstPointerBackupStoreResponse;
static_assert_64bit(offsetof(SignalConstPointerBackupStoreResponse, raw) == 0);
static_assert_64bit(sizeof(SignalConstPointerBackupStoreResponse) == 8);
static_assert_64bit(alignof(SignalConstPointerBackupStoreResponse) == 8);
typedef struct {
  const SignalRegisterAccountResponse* raw;
} SignalConstPointerRegisterAccountResponse;
static_assert_64bit(offsetof(SignalConstPointerRegisterAccountResponse, raw) == 0);
static_assert_64bit(sizeof(SignalConstPointerRegisterAccountResponse) == 8);
static_assert_64bit(alignof(SignalConstPointerRegisterAccountResponse) == 8);
typedef struct {
  const SignalRegistrationSession* raw;
} SignalConstPointerRegistrationSession;
static_assert_64bit(offsetof(SignalConstPointerRegistrationSession, raw) == 0);
static_assert_64bit(sizeof(SignalConstPointerRegistrationSession) == 8);
static_assert_64bit(alignof(SignalConstPointerRegistrationSession) == 8);
typedef struct {
  const SignalConnectionProxyConfig* raw;
} SignalConstPointerConnectionProxyConfig;
static_assert_64bit(offsetof(SignalConstPointerConnectionProxyConfig, raw) == 0);
static_assert_64bit(sizeof(SignalConstPointerConnectionProxyConfig) == 8);
static_assert_64bit(alignof(SignalConstPointerConnectionProxyConfig) == 8);
typedef struct {
  const SignalFingerprint* raw;
} SignalConstPointerFingerprint;
static_assert_64bit(offsetof(SignalConstPointerFingerprint, raw) == 0);
static_assert_64bit(sizeof(SignalConstPointerFingerprint) == 8);
static_assert_64bit(alignof(SignalConstPointerFingerprint) == 8);
typedef struct {
  const SignalKyberPublicKey* raw;
} SignalConstPointerKyberPublicKey;
static_assert_64bit(offsetof(SignalConstPointerKyberPublicKey, raw) == 0);
static_assert_64bit(sizeof(SignalConstPointerKyberPublicKey) == 8);
static_assert_64bit(alignof(SignalConstPointerKyberPublicKey) == 8);
typedef struct {
  const SignalKyberSecretKey* raw;
} SignalConstPointerKyberSecretKey;
static_assert_64bit(offsetof(SignalConstPointerKyberSecretKey, raw) == 0);
static_assert_64bit(sizeof(SignalConstPointerKyberSecretKey) == 8);
static_assert_64bit(alignof(SignalConstPointerKyberSecretKey) == 8);
typedef struct {
  const SignalKyberKeyPair* raw;
} SignalConstPointerKyberKeyPair;
static_assert_64bit(offsetof(SignalConstPointerKyberKeyPair, raw) == 0);
static_assert_64bit(sizeof(SignalConstPointerKyberKeyPair) == 8);
static_assert_64bit(alignof(SignalConstPointerKyberKeyPair) == 8);
typedef struct {
  const SignalDecryptionErrorMessage* raw;
} SignalConstPointerDecryptionErrorMessage;
static_assert_64bit(offsetof(SignalConstPointerDecryptionErrorMessage, raw) == 0);
static_assert_64bit(sizeof(SignalConstPointerDecryptionErrorMessage) == 8);
static_assert_64bit(alignof(SignalConstPointerDecryptionErrorMessage) == 8);
typedef struct {
  const SignalPlaintextContent* raw;
} SignalConstPointerPlaintextContent;
static_assert_64bit(offsetof(SignalConstPointerPlaintextContent, raw) == 0);
static_assert_64bit(sizeof(SignalConstPointerPlaintextContent) == 8);
static_assert_64bit(alignof(SignalConstPointerPlaintextContent) == 8);
typedef struct {
  const SignalPreKeySignalMessage* raw;
} SignalConstPointerPreKeySignalMessage;
static_assert_64bit(offsetof(SignalConstPointerPreKeySignalMessage, raw) == 0);
static_assert_64bit(sizeof(SignalConstPointerPreKeySignalMessage) == 8);
static_assert_64bit(alignof(SignalConstPointerPreKeySignalMessage) == 8);
typedef struct {
  const SignalSenderKeyDistributionMessage* raw;
} SignalConstPointerSenderKeyDistributionMessage;
static_assert_64bit(offsetof(SignalConstPointerSenderKeyDistributionMessage, raw) == 0);
static_assert_64bit(sizeof(SignalConstPointerSenderKeyDistributionMessage) == 8);
static_assert_64bit(alignof(SignalConstPointerSenderKeyDistributionMessage) == 8);
typedef struct {
  const SignalSenderKeyMessage* raw;
} SignalConstPointerSenderKeyMessage;
static_assert_64bit(offsetof(SignalConstPointerSenderKeyMessage, raw) == 0);
static_assert_64bit(sizeof(SignalConstPointerSenderKeyMessage) == 8);
static_assert_64bit(alignof(SignalConstPointerSenderKeyMessage) == 8);
typedef struct {
  const SignalSignalMessage* raw;
} SignalConstPointerSignalMessage;
static_assert_64bit(offsetof(SignalConstPointerSignalMessage, raw) == 0);
static_assert_64bit(sizeof(SignalConstPointerSignalMessage) == 8);
static_assert_64bit(alignof(SignalConstPointerSignalMessage) == 8);
typedef struct {
  const SignalSenderCertificate* raw;
} SignalConstPointerSenderCertificate;
static_assert_64bit(offsetof(SignalConstPointerSenderCertificate, raw) == 0);
static_assert_64bit(sizeof(SignalConstPointerSenderCertificate) == 8);
static_assert_64bit(alignof(SignalConstPointerSenderCertificate) == 8);
typedef struct {
  const SignalServerCertificate* raw;
} SignalConstPointerServerCertificate;
static_assert_64bit(offsetof(SignalConstPointerServerCertificate, raw) == 0);
static_assert_64bit(sizeof(SignalConstPointerServerCertificate) == 8);
static_assert_64bit(alignof(SignalConstPointerServerCertificate) == 8);
typedef struct {
  const SignalUnidentifiedSenderMessageContent* raw;
} SignalConstPointerUnidentifiedSenderMessageContent;
static_assert_64bit(offsetof(SignalConstPointerUnidentifiedSenderMessageContent, raw) == 0);
static_assert_64bit(sizeof(SignalConstPointerUnidentifiedSenderMessageContent) == 8);
static_assert_64bit(alignof(SignalConstPointerUnidentifiedSenderMessageContent) == 8);
typedef struct {
  const SignalSenderKeyRecord* raw;
} SignalConstPointerSenderKeyRecord;
static_assert_64bit(offsetof(SignalConstPointerSenderKeyRecord, raw) == 0);
static_assert_64bit(sizeof(SignalConstPointerSenderKeyRecord) == 8);
static_assert_64bit(alignof(SignalConstPointerSenderKeyRecord) == 8);
typedef struct {
  const SignalPreKeyBundle* raw;
} SignalConstPointerPreKeyBundle;
static_assert_64bit(offsetof(SignalConstPointerPreKeyBundle, raw) == 0);
static_assert_64bit(sizeof(SignalConstPointerPreKeyBundle) == 8);
static_assert_64bit(alignof(SignalConstPointerPreKeyBundle) == 8);
typedef struct {
  const SignalKyberPreKeyRecord* raw;
} SignalConstPointerKyberPreKeyRecord;
static_assert_64bit(offsetof(SignalConstPointerKyberPreKeyRecord, raw) == 0);
static_assert_64bit(sizeof(SignalConstPointerKyberPreKeyRecord) == 8);
static_assert_64bit(alignof(SignalConstPointerKyberPreKeyRecord) == 8);
typedef struct {
  const SignalPreKeyRecord* raw;
} SignalConstPointerPreKeyRecord;
static_assert_64bit(offsetof(SignalConstPointerPreKeyRecord, raw) == 0);
static_assert_64bit(sizeof(SignalConstPointerPreKeyRecord) == 8);
static_assert_64bit(alignof(SignalConstPointerPreKeyRecord) == 8);
typedef struct {
  const SignalSignedPreKeyRecord* raw;
} SignalConstPointerSignedPreKeyRecord;
static_assert_64bit(offsetof(SignalConstPointerSignedPreKeyRecord, raw) == 0);
static_assert_64bit(sizeof(SignalConstPointerSignedPreKeyRecord) == 8);
static_assert_64bit(alignof(SignalConstPointerSignedPreKeyRecord) == 8);
typedef struct {
  const SignalServerPublicParams* raw;
} SignalConstPointerServerPublicParams;
static_assert_64bit(offsetof(SignalConstPointerServerPublicParams, raw) == 0);
static_assert_64bit(sizeof(SignalConstPointerServerPublicParams) == 8);
static_assert_64bit(alignof(SignalConstPointerServerPublicParams) == 8);
typedef struct {
  const SignalServerSecretParams* raw;
} SignalConstPointerServerSecretParams;
static_assert_64bit(offsetof(SignalConstPointerServerSecretParams, raw) == 0);
static_assert_64bit(sizeof(SignalConstPointerServerSecretParams) == 8);
static_assert_64bit(alignof(SignalConstPointerServerSecretParams) == 8);
enum SignalFfiPublicKeyType {
  SignalFfiPublicKeyTypeECC,
  SignalFfiPublicKeyTypeKyber,
};
typedef uint8_t SignalFfiPublicKeyType;
static_assert_64bit(sizeof(SignalFfiPublicKeyType) == 1);
static_assert_64bit(alignof(SignalFfiPublicKeyType) == 1);
typedef struct {
  const int8_t* number;
  const int8_t* push_token;
  const int8_t* mcc;
  const int8_t* mnc;
} SignalFfiRegistrationCreateSessionRequest;
static_assert_64bit(offsetof(SignalFfiRegistrationCreateSessionRequest, number) == 0);
static_assert_64bit(offsetof(SignalFfiRegistrationCreateSessionRequest, push_token) == 8);
static_assert_64bit(offsetof(SignalFfiRegistrationCreateSessionRequest, mcc) == 16);
static_assert_64bit(offsetof(SignalFfiRegistrationCreateSessionRequest, mnc) == 24);
static_assert_64bit(sizeof(SignalFfiRegistrationCreateSessionRequest) == 32);
static_assert_64bit(alignof(SignalFfiRegistrationCreateSessionRequest) == 8);
typedef struct {
  uint32_t key_id;
  SignalFfiPublicKeyType public_key_type;
  const void* public_key;
  SignalBorrowedBuffer signature;
} SignalFfiSignedPublicPreKey;
static_assert_64bit(offsetof(SignalFfiSignedPublicPreKey, key_id) == 0);
static_assert_64bit(offsetof(SignalFfiSignedPublicPreKey, public_key_type) == 4);
static_assert_64bit(offsetof(SignalFfiSignedPublicPreKey, public_key) == 8);
static_assert_64bit(offsetof(SignalFfiSignedPublicPreKey, signature) == 16);
static_assert_64bit(sizeof(SignalFfiSignedPublicPreKey) == 32);
static_assert_64bit(alignof(SignalFfiSignedPublicPreKey) == 8);
typedef struct {
  bool present;
  SignalBorrowedBuffer value;
} SignalOptionalBorrowedSliceOfc_uchar;
static_assert_64bit(offsetof(SignalOptionalBorrowedSliceOfc_uchar, present) == 0);
static_assert_64bit(offsetof(SignalOptionalBorrowedSliceOfc_uchar, value) == 8);
static_assert_64bit(sizeof(SignalOptionalBorrowedSliceOfc_uchar) == 24);
static_assert_64bit(alignof(SignalOptionalBorrowedSliceOfc_uchar) == 8);
typedef struct {
  void* base;
  size_t length;
  size_t size_bytes;
} SignalOwnedBufferOfMaxAlignedc_void;
static_assert_64bit(offsetof(SignalOwnedBufferOfMaxAlignedc_void, base) == 0);
static_assert_64bit(offsetof(SignalOwnedBufferOfMaxAlignedc_void, length) == 8);
static_assert_64bit(offsetof(SignalOwnedBufferOfMaxAlignedc_void, size_bytes) == 16);
static_assert_64bit(sizeof(SignalOwnedBufferOfMaxAlignedc_void) == 24);
static_assert_64bit(alignof(SignalOwnedBufferOfMaxAlignedc_void) == 8);
typedef enum {
  SignalErrorCodeUnknownError = 1,
  SignalErrorCodeInvalidState = 2,
  SignalErrorCodeInternalError = 3,
  SignalErrorCodeNullParameter = 4,
  SignalErrorCodeInvalidArgument = 5,
  SignalErrorCodeInvalidType = 6,
  SignalErrorCodeInvalidUtf8String = 7,
  SignalErrorCodeCancelled = 8,
  SignalErrorCodeProtobufError = 10,
  SignalErrorCodeLegacyCiphertextVersion = 21,
  SignalErrorCodeUnknownCiphertextVersion = 22,
  SignalErrorCodeUnrecognizedMessageVersion = 23,
  SignalErrorCodeInvalidMessage = 30,
  SignalErrorCodeSealedSenderSelfSend = 31,
  SignalErrorCodeInvalidKey = 40,
  SignalErrorCodeInvalidSignature = 41,
  SignalErrorCodeInvalidAttestationData = 42,
  SignalErrorCodeFingerprintVersionMismatch = 51,
  SignalErrorCodeFingerprintParsingError = 52,
  SignalErrorCodeUntrustedIdentity = 60,
  SignalErrorCodeInvalidKeyIdentifier = 70,
  SignalErrorCodeSessionNotFound = 80,
  SignalErrorCodeInvalidRegistrationId = 81,
  SignalErrorCodeInvalidSession = 82,
  SignalErrorCodeInvalidSenderKeySession = 83,
  SignalErrorCodeInvalidProtocolAddress = 84,
  SignalErrorCodeDuplicatedMessage = 90,
  SignalErrorCodeCallbackError = 100,
  SignalErrorCodeVerificationFailure = 110,
  SignalErrorCodeUsernameCannotBeEmpty = 120,
  SignalErrorCodeUsernameCannotStartWithDigit = 121,
  SignalErrorCodeUsernameMissingSeparator = 122,
  SignalErrorCodeUsernameBadDiscriminatorCharacter = 123,
  SignalErrorCodeUsernameBadNicknameCharacter = 124,
  SignalErrorCodeUsernameTooShort = 125,
  SignalErrorCodeUsernameTooLong = 126,
  SignalErrorCodeUsernameLinkInvalidEntropyDataLength = 127,
  SignalErrorCodeUsernameLinkInvalid = 128,
  SignalErrorCodeUsernameDiscriminatorCannotBeEmpty = 130,
  SignalErrorCodeUsernameDiscriminatorCannotBeZero = 131,
  SignalErrorCodeUsernameDiscriminatorCannotBeSingleDigit = 132,
  SignalErrorCodeUsernameDiscriminatorCannotHaveLeadingZeros = 133,
  SignalErrorCodeUsernameDiscriminatorTooLarge = 134,
  SignalErrorCodeIoError = 140,
  SignalErrorCodeInvalidMediaInput = 141,
  SignalErrorCodeUnsupportedMediaInput = 142,
  SignalErrorCodeConnectionTimedOut = 143,
  SignalErrorCodeNetworkProtocol = 144,
  SignalErrorCodeRateLimited = 145,
  SignalErrorCodeWebSocket = 146,
  SignalErrorCodeCdsiInvalidToken = 147,
  SignalErrorCodeConnectionFailed = 148,
  SignalErrorCodeChatServiceInactive = 149,
  SignalErrorCodeRequestTimedOut = 150,
  SignalErrorCodeRateLimitChallenge = 151,
  SignalErrorCodePossibleCaptiveNetwork = 152,
  SignalErrorCodeSvrDataMissing = 160,
  SignalErrorCodeSvrRestoreFailed = 161,
  SignalErrorCodeSvrRotationMachineTooManySteps = 162,
  SignalErrorCodeSvrRequestFailed = 163,
  SignalErrorCodeAppExpired = 170,
  SignalErrorCodeDeviceDeregistered = 171,
  SignalErrorCodeConnectionInvalidated = 172,
  SignalErrorCodeConnectedElsewhere = 173,
  SignalErrorCodeBackupValidation = 180,
  SignalErrorCodeRegistrationInvalidSessionId = 190,
  SignalErrorCodeRegistrationUnknown = 192,
  SignalErrorCodeRegistrationSessionNotFound = 193,
  SignalErrorCodeRegistrationNotReadyForVerification = 194,
  SignalErrorCodeRegistrationSendVerificationCodeFailed = 195,
  SignalErrorCodeRegistrationCodeNotDeliverable = 196,
  SignalErrorCodeRegistrationSessionUpdateRejected = 197,
  SignalErrorCodeRegistrationCredentialsCouldNotBeParsed = 198,
  SignalErrorCodeRegistrationDeviceTransferPossible = 199,
  SignalErrorCodeRegistrationRecoveryVerificationFailed = 200,
  SignalErrorCodeRegistrationLock = 201,
  SignalErrorCodeKeyTransparencyError = 210,
  SignalErrorCodeKeyTransparencyVerificationFailed = 211,
  SignalErrorCodeRequestUnauthorized = 220,
  SignalErrorCodeMismatchedDevices = 221,
  SignalErrorCodeServiceIdNotFound = 222,
  SignalErrorCodeUploadTooLarge = 223,
  SignalErrorCodeDeviceIdNotFound = 224,
  SignalErrorCodeUsernameNotAvailable = 225,
  SignalErrorCodeUsernameNotSet = 226,
} SignalErrorCode;
static_assert_64bit(sizeof(SignalErrorCode) == 4);
static_assert_64bit(alignof(SignalErrorCode) == 4);
typedef enum {
  SignalChallengeOptionPushChallenge,
  SignalChallengeOptionCaptcha,
} SignalChallengeOption;
static_assert_64bit(sizeof(SignalChallengeOption) == 4);
static_assert_64bit(alignof(SignalChallengeOption) == 4);
typedef enum {
  SignalIdentityChangeNewOrUnchanged,
  SignalIdentityChangeReplacedExisting,
} SignalIdentityChange;
static_assert_64bit(sizeof(SignalIdentityChange) == 4);
static_assert_64bit(alignof(SignalIdentityChange) == 4);
enum SignalSvr2CredentialsResult {
  SignalSvr2CredentialsResultMatch,
  SignalSvr2CredentialsResultNoMatch,
  SignalSvr2CredentialsResultInvalid,
};
typedef uint8_t SignalSvr2CredentialsResult;
static_assert_64bit(sizeof(SignalSvr2CredentialsResult) == 1);
static_assert_64bit(alignof(SignalSvr2CredentialsResult) == 1);
typedef enum {
  SignalCiphertextMessageTypeWhisper = 2,
  SignalCiphertextMessageTypePreKey = 3,
  SignalCiphertextMessageTypeSenderKey = 7,
  SignalCiphertextMessageTypePlaintext = 8,
} SignalCiphertextMessageType;
static_assert_64bit(sizeof(SignalCiphertextMessageType) == 4);
static_assert_64bit(alignof(SignalCiphertextMessageType) == 4);
typedef enum {
  SignalContentHintDefault,
  SignalContentHintResendable,
  SignalContentHintImplicit,
} SignalContentHint;
static_assert_64bit(sizeof(SignalContentHint) == 4);
static_assert_64bit(alignof(SignalContentHint) == 4);
typedef enum {
  SignalDirectionSending,
  SignalDirectionReceiving,
} SignalDirection;
static_assert_64bit(sizeof(SignalDirection) == 4);
static_assert_64bit(alignof(SignalDirection) == 4);
typedef struct {
  void* ctx;
  SignalType_FunctionPointer_int32_t_SignalType_MutPointer_void_SignalLogLevel_SignalCStringPtr_uint32_t_SignalCStringPtr log;
  SignalType_FunctionPointer_int32_t_SignalType_MutPointer_void flush;
  SignalType_FunctionPointer_void_SignalType_MutPointer_void destroy;
} SignalFfiLoggerStruct;
static_assert_64bit(offsetof(SignalFfiLoggerStruct, ctx) == 0);
static_assert_64bit(offsetof(SignalFfiLoggerStruct, log) == 8);
static_assert_64bit(offsetof(SignalFfiLoggerStruct, flush) == 16);
static_assert_64bit(offsetof(SignalFfiLoggerStruct, destroy) == 24);
static_assert_64bit(sizeof(SignalFfiLoggerStruct) == 32);
static_assert_64bit(alignof(SignalFfiLoggerStruct) == 8);
SignalFfiError* signal_account_entropy_pool_derive_backup_key(
  SignalType_FixedArray32_uint8_t* out,
  const int8_t* account_entropy
);
SignalFfiError* signal_account_entropy_pool_derive_svr_key(
  SignalType_FixedArray32_uint8_t* out,
  const int8_t* account_entropy
);
SignalFfiError* signal_account_entropy_pool_generate(
  SignalCStringPtr* out
);
SignalFfiError* signal_account_entropy_pool_is_valid(
  bool* out,
  const int8_t* account_entropy
);
SignalFfiError* signal_address_clone(
  SignalMutPointerProtocolAddress* new_obj,
  SignalConstPointerProtocolAddress obj
);
SignalFfiError* signal_address_destroy(
  SignalMutPointerProtocolAddress p
);
SignalFfiError* signal_address_get_device_id(
  uint32_t* out,
  SignalConstPointerProtocolAddress obj
);
SignalFfiError* signal_address_get_name(
  SignalCStringPtr* out,
  SignalConstPointerProtocolAddress obj
);
SignalFfiError* signal_address_new(
